#loc = loc(unknown)
#loc1 = loc("key")
#loc4 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":298:50 to :74)
#loc6 = loc("/Users/noahfarr/reinforcement-learning/src/environments/environments/wrappers/vectorize.py":20:21 to :54)
#loc7 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":300:38 to 302:9)
#loc32 = loc("/Users/noahfarr/reinforcement-learning/.venv/lib/python3.13/site-packages/flax/linen/linear.py":263:13 to 268:5)
#loc33 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":121:24 to :77)
#loc34 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":307:17 to 314:9)
#loc91 = loc("vmap()")
#loc113 = loc("erf")
#loc125 = loc("RecurrentPPO.init"(#loc4))
#loc127 = loc("Vectorize.init"(#loc6))
#loc128 = loc("RecurrentPPO.init"(#loc7))
#loc153 = loc("Dense.__call__"(#loc32))
#loc154 = loc("MaskedActorCriticNetwork.__call__"(#loc33))
#loc155 = loc("RecurrentPPO.init"(#loc34))
#loc202 = loc(callsite(#loc127 at #loc128))
#loc203 = loc(callsite(#loc154 at #loc155))
#loc221 = loc(callsite(#loc153 at #loc203))
module @jit_init attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key")) -> (tensor<i32> {jax.result_info = "result.step"}, tensor<64x16xi1> {jax.result_info = "result.timestep.obs['action_mask']"}, tensor<64x15xf32> {jax.result_info = "result.timestep.obs['observation']"}, tensor<64xi32> {jax.result_info = "result.timestep.action"}, tensor<64xf32> {jax.result_info = "result.timestep.reward"}, tensor<64xi1> {jax.result_info = "result.timestep.terminated"}, tensor<64xi1> {jax.result_info = "result.timestep.truncated"}, tensor<64xf32> {jax.result_info = "result.timestep.info['guess_count']"}, tensor<64xf32> {jax.result_info = "result.timestep.info['illegal_guesses']"}, tensor<64xf32> {jax.result_info = "result.timestep.info['matched_secret']"}, tensor<64x5xi32> {jax.result_info = "result.environment_state.secret_answer"}, tensor<64x5xi32> {jax.result_info = "result.environment_state.guess_feedback"}, tensor<64xi1> {jax.result_info = "result.environment_state.guess_revealed"}, tensor<64xi32> {jax.result_info = "result.environment_state.guess_count"}, tensor<64xi1> {jax.result_info = "result.environment_state.matched_secret"}, tensor<64x32xf32> {jax.result_info = "result.carry[1]"}, tensor<32x16xf32> {jax.result_info = "result.params['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.params['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.params['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.params['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['candidate']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['update_gate']['kernel']"}, tensor<i32> {jax.result_info = "result.optimizer_state[1][0].count"}, tensor<32x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['candidate']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['update_gate']['kernel']"}, tensor<32x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['candidate']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['update_gate']['kernel']"}) {
    %c = stablehlo.constant dense<3831938679> : tensor<ui32> loc(#loc214)
    %c_0 = stablehlo.constant dense<3491981184> : tensor<ui32> loc(#loc214)
    %cst = stablehlo.constant dense<-3.40282347E+38> : tensor<f32> loc(#loc214)
    %c_1 = stablehlo.constant dense<2876566538> : tensor<ui32> loc(#loc214)
    %c_2 = stablehlo.constant dense<1> : tensor<i32> loc(#loc214)
    %c_3 = stablehlo.constant dense<1521533140> : tensor<ui32> loc(#loc214)
    %cst_4 = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %cst_5 = stablehlo.constant dense<3.125000e-02> : tensor<f32> loc(#loc)
    %c_6 = stablehlo.constant dense<1543552912> : tensor<ui32> loc(#loc214)
    %c_7 = stablehlo.constant dense<-1> : tensor<i32> loc(#loc)
    %c_8 = stablehlo.constant dense<3178254832> : tensor<ui32> loc(#loc214)
    %cst_9 = stablehlo.constant dense<0.020833334> : tensor<f32> loc(#loc214)
    %c_10 = stablehlo.constant dense<1157806390> : tensor<ui32> loc(#loc214)
    %c_11 = stablehlo.constant dense<3085490160> : tensor<ui32> loc(#loc214)
    %c_12 = stablehlo.constant dense<2> : tensor<i32> loc(#loc)
    %c_13 = stablehlo.constant dense<-2> : tensor<i32> loc(#loc)
    %cst_14 = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %cst_15 = stablehlo.constant dense<0.0666666701> : tensor<f32> loc(#loc214)
    %c_16 = stablehlo.constant dense<2075703144> : tensor<ui32> loc(#loc214)
    %c_17 = stablehlo.constant dense<true> : tensor<i1> loc(#loc)
    %cst_18 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c_19 = stablehlo.constant dense<false> : tensor<i1> loc(#loc)
    %c_20 = stablehlo.constant dense<5> : tensor<i32> loc(#loc214)
    %c_21 = stablehlo.constant dense<16> : tensor<i32> loc(#loc)
    %c_22 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_23 = stablehlo.constant dense<[[0, 20, 3, 8, 14], [1, 17, 8, 2, 10], [2, 7, 0, 8, 17], [2, 11, 14, 20, 3], [2, 17, 0, 13, 4], [5, 11, 8, 13, 19], [5, 17, 14, 18, 19], [6, 11, 0, 25, 4], [6, 17, 0, 15, 4], [7, 14, 20, 18, 4], [11, 4, 12, 14, 13], [12, 14, 20, 13, 3], [15, 11, 0, 13, 19], [18, 11, 0, 19, 4], [18, 15, 0, 3, 4], [18, 19, 14, 17, 12]]> : tensor<16x5xi32> loc(#loc214)
    %0 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<3x2xui32> loc(#loc276)
    %1 = stablehlo.slice %0 [0:1, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc239)
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc240)
    %3 = stablehlo.slice %0 [1:2, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc239)
    %4 = stablehlo.reshape %3 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc240)
    %5 = call @_threefry_split_0(%2) : (tensor<2xui32>) -> tensor<64x2xui32> loc(#loc310)
    %6 = stablehlo.broadcast_in_dim %5, dims = [0, 2] : (tensor<64x2xui32>) -> tensor<64x1x2xui32> loc(#loc278)
    %7 = stablehlo.reshape %6 : (tensor<64x1x2xui32>) -> tensor<64x2xui32> loc(#loc279)
    %8 = call @_randint(%7, %c_22, %c_21) : (tensor<64x2xui32>, tensor<i32>, tensor<i32>) -> tensor<64xi32> loc(#loc379)
    %9 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc380)
    %10 = stablehlo.compare LT, %8, %9, SIGNED : (tensor<64xi32>, tensor<64xi32>) -> tensor<64xi1> loc(#loc380)
    %11 = stablehlo.broadcast_in_dim %c_21, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc381)
    %12 = stablehlo.add %8, %11 : tensor<64xi32> loc(#loc381)
    %13 = stablehlo.select %10, %12, %8 : tensor<64xi1>, tensor<64xi32> loc(#loc382)
    %14 = stablehlo.compare LT, %c_22, %c_22, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc380)
    %15 = stablehlo.add %c_22, %c_20 : tensor<i32> loc(#loc381)
    %16 = stablehlo.select %14, %15, %c_22 : tensor<i1>, tensor<i32> loc(#loc382)
    %17 = stablehlo.broadcast_in_dim %13, dims = [0] : (tensor<64xi32>) -> tensor<64x1xi32> loc(#loc383)
    %18 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<i32>) -> tensor<64x1xi32> loc(#loc383)
    %19 = stablehlo.concatenate %17, %18, dim = 1 : (tensor<64x1xi32>, tensor<64x1xi32>) -> tensor<64x2xi32> loc(#loc384)
    %20 = "stablehlo.gather"(%c_23, %19) <{dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 5>}> : (tensor<16x5xi32>, tensor<64x2xi32>) -> tensor<64x1x5xi32> loc(#loc385)
    %21 = stablehlo.reshape %20 : (tensor<64x1x5xi32>) -> tensor<64x5xi32> loc(#loc386)
    %22 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc387)
    %23 = call @_one_hot(%22) : (tensor<5xi32>) -> tensor<5x3xf32> loc(#loc423)
    %24 = stablehlo.reshape %23 : (tensor<5x3xf32>) -> tensor<15xf32> loc(#loc424)
    %25 = call @_where(%c_19, %24, %cst_18) : (tensor<i1>, tensor<15xf32>, tensor<f32>) -> tensor<15xf32> loc(#loc425)
    %26 = stablehlo.broadcast_in_dim %c_17, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc391)
    %27 = stablehlo.broadcast_in_dim %22, dims = [1] : (tensor<5xi32>) -> tensor<64x5xi32> loc(#loc281)
    %28 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc281)
    %29 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc281)
    %30 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc281)
    %31 = stablehlo.broadcast_in_dim %26, dims = [1] : (tensor<16xi1>) -> tensor<64x16xi1> loc(#loc281)
    %32 = stablehlo.broadcast_in_dim %25, dims = [1] : (tensor<15xf32>) -> tensor<64x15xf32> loc(#loc281)
    %33 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc281)
    %34 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc281)
    %35 = stablehlo.broadcast_in_dim %c_17, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc281)
    %36 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc281)
    %37 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc281)
    %38 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc281)
    %39 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc281)
    %40 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<64x32xf32> loc(#loc426)
    %41 = stablehlo.broadcast_in_dim %31, dims = [0, 2] : (tensor<64x16xi1>) -> tensor<64x1x16xi1> loc(#loc314)
    %42 = stablehlo.broadcast_in_dim %32, dims = [0, 2] : (tensor<64x15xf32>) -> tensor<64x1x15xf32> loc(#loc314)
    %43 = stablehlo.broadcast_in_dim %33, dims = [0] : (tensor<64xi32>) -> tensor<64x1xi32> loc(#loc314)
    %44 = stablehlo.broadcast_in_dim %35, dims = [0] : (tensor<64xi1>) -> tensor<64x1xi1> loc(#loc314)
    %45 = stablehlo.broadcast_in_dim %36, dims = [0] : (tensor<64xi1>) -> tensor<64x1xi1> loc(#loc314)
    %46 = stablehlo.or %44, %45 : tensor<64x1xi1> loc(#loc284)
    %47 = call @_threefry_fold_in(%4, %c_16) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc355)
    %48 = stablehlo.sqrt %cst_15 : tensor<f32> loc(#loc316)
    %49 = stablehlo.divide %48, %cst_14 : tensor<f32> loc(#loc317)
    %50 = call @_truncated_normal(%47, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<15x32xf32> loc(#loc318)
    %51 = stablehlo.broadcast_in_dim %49, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc319)
    %52 = stablehlo.multiply %50, %51 : tensor<15x32xf32> loc(#loc319)
    %53 = call @_threefry_fold_in(%4, %c_11) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc356)
    %54 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc321)
    %55 = stablehlo.dot_general %42, %52, contracting_dims = [2] x [0] : (tensor<64x1x15xf32>, tensor<15x32xf32>) -> tensor<64x1x32xf32> loc(#loc322)
    %56 = stablehlo.reshape %54 : (tensor<32xf32>) -> tensor<1x1x32xf32> loc(#loc323)
    %57 = stablehlo.broadcast_in_dim %56, dims = [0, 1, 2] : (tensor<1x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc324)
    %58 = stablehlo.add %55, %57 : tensor<64x1x32xf32> loc(#loc324)
    %59 = call @relu(%58) : (tensor<64x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc290)
    %60 = call @_one_hot_14(%43) : (tensor<64x1xi32>) -> tensor<64x1x16xf32> loc(#loc291)
    %61 = stablehlo.concatenate %59, %60, dim = 2 : (tensor<64x1x32xf32>, tensor<64x1x16xf32>) -> tensor<64x1x48xf32> loc(#loc292)
    %62 = call @_threefry_fold_in(%4, %c_10) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc453)
    %63 = stablehlo.sqrt %cst_9 : tensor<f32> loc(#loc428)
    %64 = stablehlo.divide %63, %cst_14 : tensor<f32> loc(#loc429)
    %65 = call @_truncated_normal_15(%62, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<48x32xf32> loc(#loc430)
    %66 = stablehlo.broadcast_in_dim %64, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc431)
    %67 = stablehlo.multiply %65, %66 : tensor<48x32xf32> loc(#loc431)
    %68 = call @_threefry_fold_in(%4, %c_8) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc454)
    %69 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc433)
    %70 = stablehlo.dot_general %61, %67, contracting_dims = [2] x [0] : (tensor<64x1x48xf32>, tensor<48x32xf32>) -> tensor<64x1x32xf32> loc(#loc434)
    %71 = stablehlo.reshape %69 : (tensor<32xf32>) -> tensor<1x1x32xf32> loc(#loc435)
    %72 = stablehlo.broadcast_in_dim %71, dims = [0, 1, 2] : (tensor<1x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc436)
    %73 = stablehlo.add %70, %72 : tensor<64x1x32xf32> loc(#loc436)
    %74 = call @relu(%73) : (tensor<64x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc398)
    %75 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<64x32xf32> loc(#loc437)
    %76 = call @_threefry_fold_in(%4, %c_6) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc477)
    %77 = stablehlo.sqrt %cst_5 : tensor<f32> loc(#loc456)
    %78 = stablehlo.divide %77, %cst_14 : tensor<f32> loc(#loc457)
    %79 = call @_truncated_normal_20(%76, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc458)
    %80 = stablehlo.broadcast_in_dim %78, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc459)
    %81 = stablehlo.multiply %79, %80 : tensor<32x32xf32> loc(#loc459)
    %82 = stablehlo.dot_general %74, %81, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x32xf32>) -> tensor<64x1x32xf32> loc(#loc460)
    %83 = stablehlo.negate %82 : tensor<64x1x32xf32> loc(#loc461)
    %84 = stablehlo.exponential %83 : tensor<64x1x32xf32> loc(#loc462)
    %85 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<64x1x32xf32> loc(#loc463)
    %86 = stablehlo.add %85, %84 : tensor<64x1x32xf32> loc(#loc463)
    %87 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<64x1x32xf32> loc(#loc464)
    %88 = stablehlo.divide %87, %86 : tensor<64x1x32xf32> loc(#loc464)
    %89 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<64x1x32xf32> loc(#loc441)
    %90 = stablehlo.subtract %89, %88 : tensor<64x1x32xf32> loc(#loc441)
    %91 = call @_threefry_fold_in(%4, %c_3) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc478)
    %92 = stablehlo.sqrt %cst_5 : tensor<f32> loc(#loc466)
    %93 = stablehlo.divide %92, %cst_14 : tensor<f32> loc(#loc467)
    %94 = call @_truncated_normal_20(%91, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc468)
    %95 = stablehlo.broadcast_in_dim %93, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc469)
    %96 = stablehlo.multiply %94, %95 : tensor<32x32xf32> loc(#loc469)
    %97 = stablehlo.dot_general %74, %96, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x32xf32>) -> tensor<64x1x32xf32> loc(#loc470)
    %98 = stablehlo.multiply %88, %97 : tensor<64x1x32xf32> loc(#loc444)
    %99 = stablehlo.reshape %46 : (tensor<64x1xi1>) -> tensor<64x1x1xi1> loc(#loc445)
    %100 = stablehlo.convert %99 : (tensor<64x1x1xi1>) -> tensor<64x1x1xf32> loc(#loc406)
    %101 = stablehlo.broadcast_in_dim %100, dims = [0, 1, 2] : (tensor<64x1x1xf32>) -> tensor<64x1x32xf32> loc(#loc407)
    %102 = stablehlo.multiply %101, %90 : tensor<64x1x32xf32> loc(#loc407)
    %103 = stablehlo.broadcast_in_dim %75, dims = [0, 2] : (tensor<64x32xf32>) -> tensor<64x1x32xf32> loc(#loc408)
    %104 = stablehlo.multiply %102, %103 : tensor<64x1x32xf32> loc(#loc409)
    %105 = stablehlo.add %98, %104 : tensor<64x1x32xf32> loc(#loc410)
    %106 = stablehlo.convert %99 : (tensor<64x1x1xi1>) -> tensor<64x1x1xi32> loc(#loc411)
    %107 = stablehlo.broadcast_in_dim %c_2, dims = [] : (tensor<i32>) -> tensor<64x1x1xi32> loc(#loc412)
    %108 = stablehlo.subtract %107, %106 : tensor<64x1x1xi32> loc(#loc412)
    %109 = stablehlo.convert %108 : (tensor<64x1x1xi32>) -> tensor<64x1x1xf32> loc(#loc413)
    %110 = stablehlo.broadcast_in_dim %109, dims = [0, 1, 2] : (tensor<64x1x1xf32>) -> tensor<64x1x32xf32> loc(#loc414)
    %111 = stablehlo.multiply %110, %90 : tensor<64x1x32xf32> loc(#loc414)
    %112 = stablehlo.broadcast_in_dim %40, dims = [0, 2] : (tensor<64x32xf32>) -> tensor<64x1x32xf32> loc(#loc415)
    %113 = stablehlo.multiply %111, %112 : tensor<64x1x32xf32> loc(#loc416)
    %114 = stablehlo.add %105, %113 : tensor<64x1x32xf32> loc(#loc417)
    %115 = call @_take(%114, %c_7) : (tensor<64x1x32xf32>, tensor<i32>) -> tensor<64x32xf32> loc(#loc418)
    %116 = call @_threefry_fold_in(%4, %c_1) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc372)
    %117 = stablehlo.sqrt %cst_5 : tensor<f32> loc(#loc328)
    %118 = stablehlo.divide %117, %cst_14 : tensor<f32> loc(#loc329)
    %119 = call @_truncated_normal_26(%116, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x16xf32> loc(#loc330)
    %120 = stablehlo.broadcast_in_dim %118, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc331)
    %121 = stablehlo.multiply %119, %120 : tensor<32x16xf32> loc(#loc331)
    %122 = stablehlo.dot_general %114, %121, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x16xf32>) -> tensor<64x1x16xf32> loc(#loc332)
    %123 = call @_where_31(%41, %122, %cst) : (tensor<64x1x16xi1>, tensor<64x1x16xf32>, tensor<f32>) -> tensor<64x1x16xf32> loc(#loc297)
    %124 = call @_threefry_fold_in(%4, %c_0) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc373)
    %125 = stablehlo.sqrt %cst_5 : tensor<f32> loc(#loc334)
    %126 = stablehlo.divide %125, %cst_14 : tensor<f32> loc(#loc335)
    %127 = call @_truncated_normal_32(%124, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x1xf32> loc(#loc336)
    %128 = stablehlo.broadcast_in_dim %126, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc337)
    %129 = stablehlo.multiply %127, %128 : tensor<32x1xf32> loc(#loc337)
    %130 = call @_threefry_fold_in(%4, %c) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc374)
    %131 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc339)
    %132 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc479)
    %133 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc479)
    %134 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc479)
    %135 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc479)
    %136 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc479)
    %137 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc479)
    %138 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc479)
    %139 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc479)
    %140 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc479)
    %141 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc480)
    %142 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc480)
    %143 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc480)
    %144 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc480)
    %145 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc480)
    %146 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc480)
    %147 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc480)
    %148 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc480)
    %149 = stablehlo.broadcast_in_dim %cst_18, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc480)
    return %c_22, %31, %32, %33, %34, %35, %36, %37, %38, %39, %21, %27, %28, %29, %30, %40, %121, %131, %129, %54, %52, %69, %67, %96, %81, %c_22, %132, %133, %134, %135, %136, %137, %138, %139, %140, %141, %142, %143, %144, %145, %146, %147, %148, %149 : tensor<i32>, tensor<64x16xi1>, tensor<64x15xf32>, tensor<64xi32>, tensor<64xf32>, tensor<64xi1>, tensor<64xi1>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64x5xi32>, tensor<64x5xi32>, tensor<64xi1>, tensor<64xi32>, tensor<64xi1>, tensor<64x32xf32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<i32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<32x32xf32>, tensor<32x32xf32> loc(#loc214)
  } loc(#loc)
  func.func private @_threefry_split(%arg0: tensor<2xui32> loc(unknown)) -> tensor<3x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc206)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc206)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc207)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc208)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc207)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc208)
    %4 = stablehlo.iota dim = 0 : tensor<3xui64> loc(#loc206)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc206)
    %6 = stablehlo.multiply %5, %4 : tensor<3xui64> loc(#loc206)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc206)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<3xui64> loc(#loc206)
    %9 = stablehlo.convert %6 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc206)
    %10 = stablehlo.convert %8 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc206)
    %11:2 = call @threefry2x32(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<3xui32>, tensor<3xui32>) -> (tensor<3xui32>, tensor<3xui32>) loc(#loc125)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc209)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc209)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<3x1xui32>, tensor<3x1xui32>) -> tensor<3x2xui32> loc(#loc209)
    return %14 : tensor<3x2xui32> loc(#loc)
  } loc(#loc225)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg1: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg2: tensor<3xui32> loc("RecurrentPPO.init"(#loc4)), %arg3: tensor<3xui32> loc("RecurrentPPO.init"(#loc4))) -> (tensor<3xui32>, tensor<3xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc197)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc197)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc197)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc210)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc210)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc211)
    %3 = stablehlo.add %arg2, %2 : tensor<3xui32> loc(#loc211)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc211)
    %5 = stablehlo.add %arg3, %4 : tensor<3xui32> loc(#loc211)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc257)
      stablehlo.return %7 : tensor<i1> loc(#loc226)
    } do {
      %7:8 = func.call @closed_call(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc258)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc259)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc226)
    } loc(#loc226)
    return %6#2, %6#3 : tensor<3xui32>, tensor<3xui32> loc(#loc125)
  } loc(#loc125)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<3xui32> loc(unknown), %arg2: tensor<3xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc77)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %3 = stablehlo.add %arg1, %arg2 : tensor<3xui32> loc(#loc77)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc80)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<3xui32> loc(#loc80)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc81)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<3xui32> loc(#loc82)
    %9 = stablehlo.or %5, %8 : tensor<3xui32> loc(#loc83)
    %10 = stablehlo.xor %3, %9 : tensor<3xui32> loc(#loc84)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %13 = stablehlo.add %3, %10 : tensor<3xui32> loc(#loc77)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc80)
    %15 = stablehlo.shift_left %10, %14 : tensor<3xui32> loc(#loc80)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc81)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<3xui32> loc(#loc82)
    %19 = stablehlo.or %15, %18 : tensor<3xui32> loc(#loc83)
    %20 = stablehlo.xor %13, %19 : tensor<3xui32> loc(#loc84)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %23 = stablehlo.add %13, %20 : tensor<3xui32> loc(#loc77)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc80)
    %25 = stablehlo.shift_left %20, %24 : tensor<3xui32> loc(#loc80)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc81)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<3xui32> loc(#loc82)
    %29 = stablehlo.or %25, %28 : tensor<3xui32> loc(#loc83)
    %30 = stablehlo.xor %23, %29 : tensor<3xui32> loc(#loc84)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %33 = stablehlo.add %23, %30 : tensor<3xui32> loc(#loc77)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc80)
    %35 = stablehlo.shift_left %30, %34 : tensor<3xui32> loc(#loc80)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc81)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<3xui32> loc(#loc82)
    %39 = stablehlo.or %35, %38 : tensor<3xui32> loc(#loc83)
    %40 = stablehlo.xor %33, %39 : tensor<3xui32> loc(#loc84)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc77)
    %42 = stablehlo.add %33, %41 : tensor<3xui32> loc(#loc77)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc77)
    %44 = stablehlo.add %40, %43 : tensor<3xui32> loc(#loc77)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc77)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc85)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc77)
    %48 = stablehlo.add %44, %47 : tensor<3xui32> loc(#loc77)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc228)
  func.func private @_threefry_split_0(%arg0: tensor<2xui32> loc(unknown)) -> tensor<64x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc230)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc230)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc231)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc232)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc231)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc232)
    %4 = stablehlo.iota dim = 0 : tensor<64xui64> loc(#loc230)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<64xui64> loc(#loc230)
    %6 = stablehlo.multiply %5, %4 : tensor<64xui64> loc(#loc230)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<64xui64> loc(#loc230)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<64xui64> loc(#loc230)
    %9 = stablehlo.convert %6 : (tensor<64xui64>) -> tensor<64xui32> loc(#loc230)
    %10 = stablehlo.convert %8 : (tensor<64xui64>) -> tensor<64xui32> loc(#loc230)
    %11:2 = call @threefry2x32_1(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<64xui32>, tensor<64xui32>) -> (tensor<64xui32>, tensor<64xui32>) loc(#loc202)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc233)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc233)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<64x1xui32>, tensor<64x1xui32>) -> tensor<64x2xui32> loc(#loc233)
    return %14 : tensor<64x2xui32> loc(#loc)
  } loc(#loc260)
  func.func private @threefry2x32_1(%arg0: tensor<ui32> loc(callsite(#loc127 at #loc128)), %arg1: tensor<ui32> loc(callsite(#loc127 at #loc128)), %arg2: tensor<64xui32> loc(callsite(#loc127 at #loc128)), %arg3: tensor<64xui32> loc(callsite(#loc127 at #loc128))) -> (tensor<64xui32>, tensor<64xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc197)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc197)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc197)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc234)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc234)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc235)
    %3 = stablehlo.add %arg2, %2 : tensor<64xui32> loc(#loc235)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc235)
    %5 = stablehlo.add %arg3, %4 : tensor<64xui32> loc(#loc235)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc301)
      stablehlo.return %7 : tensor<i1> loc(#loc261)
    } do {
      %7:8 = func.call @closed_call_2(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc302)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc303)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc261)
    } loc(#loc261)
    return %6#2, %6#3 : tensor<64xui32>, tensor<64xui32> loc(#loc202)
  } loc(#loc202)
  func.func private @closed_call_2(%arg0: tensor<i32> loc(unknown), %arg1: tensor<64xui32> loc(unknown), %arg2: tensor<64xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc77)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %3 = stablehlo.add %arg1, %arg2 : tensor<64xui32> loc(#loc77)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc80)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<64xui32> loc(#loc80)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc81)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<64xui32> loc(#loc82)
    %9 = stablehlo.or %5, %8 : tensor<64xui32> loc(#loc83)
    %10 = stablehlo.xor %3, %9 : tensor<64xui32> loc(#loc84)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %13 = stablehlo.add %3, %10 : tensor<64xui32> loc(#loc77)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc80)
    %15 = stablehlo.shift_left %10, %14 : tensor<64xui32> loc(#loc80)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc81)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<64xui32> loc(#loc82)
    %19 = stablehlo.or %15, %18 : tensor<64xui32> loc(#loc83)
    %20 = stablehlo.xor %13, %19 : tensor<64xui32> loc(#loc84)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %23 = stablehlo.add %13, %20 : tensor<64xui32> loc(#loc77)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc80)
    %25 = stablehlo.shift_left %20, %24 : tensor<64xui32> loc(#loc80)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc81)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<64xui32> loc(#loc82)
    %29 = stablehlo.or %25, %28 : tensor<64xui32> loc(#loc83)
    %30 = stablehlo.xor %23, %29 : tensor<64xui32> loc(#loc84)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc78)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc79)
    %33 = stablehlo.add %23, %30 : tensor<64xui32> loc(#loc77)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc80)
    %35 = stablehlo.shift_left %30, %34 : tensor<64xui32> loc(#loc80)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc81)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<64xui32> loc(#loc82)
    %39 = stablehlo.or %35, %38 : tensor<64xui32> loc(#loc83)
    %40 = stablehlo.xor %33, %39 : tensor<64xui32> loc(#loc84)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc77)
    %42 = stablehlo.add %33, %41 : tensor<64xui32> loc(#loc77)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc77)
    %44 = stablehlo.add %40, %43 : tensor<64xui32> loc(#loc77)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc77)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc85)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc77)
    %48 = stablehlo.add %44, %47 : tensor<64xui32> loc(#loc77)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc263)
  func.func private @_randint(%arg0: tensor<64x2xui32> loc(unknown), %arg1: tensor<i32> loc(unknown), %arg2: tensor<i32> loc(unknown)) -> tensor<64xi32> {
    %c = stablehlo.constant dense<65536> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<ui32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<ui32> loc(#loc)
    %c_2 = stablehlo.constant dense<2147483647> : tensor<i32> loc(#loc)
    %c_3 = stablehlo.constant dense<-2147483648> : tensor<i32> loc(#loc)
    %0 = call @clip(%c_2, %c_3, %c_2) : (tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<i32> loc(#loc86)
    %1 = stablehlo.compare GT, %arg2, %0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc87)
    %2 = call @clip_3(%arg1, %c_3, %c_2) : (tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<i32> loc(#loc86)
    %3 = stablehlo.convert %2 : tensor<i32> loc(#loc85)
    %4 = call @clip_3(%arg2, %c_3, %c_2) : (tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<i32> loc(#loc86)
    %5 = stablehlo.convert %4 : tensor<i32> loc(#loc85)
    %6 = call @_threefry_split_4(%arg0) : (tensor<64x2xui32>) -> tensor<64x2x2xui32> loc(#loc88)
    %7 = stablehlo.slice %6 [0:64, 0:1, 0:2] : (tensor<64x2x2xui32>) -> tensor<64x1x2xui32> loc(#loc78)
    %8 = stablehlo.reshape %7 : (tensor<64x1x2xui32>) -> tensor<64x2xui32> loc(#loc79)
    %9 = stablehlo.slice %6 [0:64, 1:2, 0:2] : (tensor<64x2x2xui32>) -> tensor<64x1x2xui32> loc(#loc78)
    %10 = stablehlo.reshape %9 : (tensor<64x1x2xui32>) -> tensor<64x2xui32> loc(#loc79)
    %11 = stablehlo.slice %8 [0:64, 0:1] : (tensor<64x2xui32>) -> tensor<64x1xui32> loc(#loc89)
    %12 = stablehlo.reshape %11 : (tensor<64x1xui32>) -> tensor<64xui32> loc(#loc90)
    %13 = stablehlo.slice %8 [0:64, 1:2] : (tensor<64x2xui32>) -> tensor<64x1xui32> loc(#loc89)
    %14 = stablehlo.reshape %13 : (tensor<64x1xui32>) -> tensor<64xui32> loc(#loc90)
    %15:2 = call @threefry2x32_7(%12, %14, %c_1, %c_1) : (tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>) -> (tensor<64xui32>, tensor<64xui32>) loc(#loc91)
    %16 = stablehlo.xor %15#0, %15#1 : tensor<64xui32> loc(#loc92)
    %17 = stablehlo.slice %10 [0:64, 0:1] : (tensor<64x2xui32>) -> tensor<64x1xui32> loc(#loc89)
    %18 = stablehlo.reshape %17 : (tensor<64x1xui32>) -> tensor<64xui32> loc(#loc90)
    %19 = stablehlo.slice %10 [0:64, 1:2] : (tensor<64x2xui32>) -> tensor<64x1xui32> loc(#loc89)
    %20 = stablehlo.reshape %19 : (tensor<64x1xui32>) -> tensor<64xui32> loc(#loc90)
    %21:2 = call @threefry2x32_7(%18, %20, %c_1, %c_1) : (tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>) -> (tensor<64xui32>, tensor<64xui32>) loc(#loc91)
    %22 = stablehlo.xor %21#0, %21#1 : tensor<64xui32> loc(#loc92)
    %23 = stablehlo.subtract %5, %3 : tensor<i32> loc(#loc81)
    %24 = stablehlo.convert %23 : (tensor<i32>) -> tensor<ui32> loc(#loc85)
    %25 = stablehlo.compare LE, %5, %3, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc93)
    %26 = stablehlo.select %25, %c_0, %24 : tensor<i1>, tensor<ui32> loc(#loc94)
    %27 = stablehlo.compare GT, %5, %3, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc87)
    %28 = stablehlo.and %1, %27 : tensor<i1> loc(#loc95)
    %29 = stablehlo.add %26, %c_0 : tensor<ui32> loc(#loc77)
    %30 = stablehlo.select %28, %29, %26 : tensor<i1>, tensor<ui32> loc(#loc94)
    %31 = stablehlo.remainder %c, %30 : tensor<ui32> loc(#loc96)
    %32 = stablehlo.multiply %31, %31 : tensor<ui32> loc(#loc97)
    %33 = stablehlo.remainder %32, %30 : tensor<ui32> loc(#loc96)
    %34 = stablehlo.broadcast_in_dim %30, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc96)
    %35 = stablehlo.remainder %16, %34 : tensor<64xui32> loc(#loc96)
    %36 = stablehlo.broadcast_in_dim %33, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc97)
    %37 = stablehlo.multiply %35, %36 : tensor<64xui32> loc(#loc97)
    %38 = stablehlo.broadcast_in_dim %30, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc96)
    %39 = stablehlo.remainder %22, %38 : tensor<64xui32> loc(#loc96)
    %40 = stablehlo.add %37, %39 : tensor<64xui32> loc(#loc77)
    %41 = stablehlo.broadcast_in_dim %30, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc96)
    %42 = stablehlo.remainder %40, %41 : tensor<64xui32> loc(#loc96)
    %43 = stablehlo.convert %42 : (tensor<64xui32>) -> tensor<64xi32> loc(#loc85)
    %44 = stablehlo.broadcast_in_dim %3, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc77)
    %45 = stablehlo.add %44, %43 : tensor<64xi32> loc(#loc77)
    return %45 : tensor<64xi32> loc(#loc)
  } loc(#loc448)
  func.func private @clip(%arg0: tensor<i32> loc(unknown), %arg1: tensor<i32> loc(unknown), %arg2: tensor<i32> loc(unknown)) -> tensor<i32> {
    %0 = stablehlo.maximum %arg1, %arg0 : tensor<i32> loc(#loc99)
    %1 = stablehlo.minimum %arg2, %0 : tensor<i32> loc(#loc100)
    return %1 : tensor<i32> loc(#loc)
  } loc(#loc198)
  func.func private @clip_3(%arg0: tensor<i32> loc(unknown), %arg1: tensor<i32> loc(unknown), %arg2: tensor<i32> loc(unknown)) -> tensor<i32> {
    %0 = stablehlo.maximum %arg1, %arg0 : tensor<i32> loc(#loc99)
    %1 = stablehlo.minimum %arg2, %0 : tensor<i32> loc(#loc100)
    return %1 : tensor<i32> loc(#loc)
  } loc(#loc198)
  func.func private @_threefry_split_4(%arg0: tensor<64x2xui32> loc(unknown)) -> tensor<64x2x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc102)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc102)
    %0 = stablehlo.slice %arg0 [0:64, 0:1] : (tensor<64x2xui32>) -> tensor<64x1xui32> loc(#loc78)
    %1 = stablehlo.reshape %0 : (tensor<64x1xui32>) -> tensor<64xui32> loc(#loc79)
    %2 = stablehlo.slice %arg0 [0:64, 1:2] : (tensor<64x2xui32>) -> tensor<64x1xui32> loc(#loc78)
    %3 = stablehlo.reshape %2 : (tensor<64x1xui32>) -> tensor<64xui32> loc(#loc79)
    %4 = stablehlo.iota dim = 0 : tensor<2xui64> loc(#loc102)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<2xui64> loc(#loc102)
    %6 = stablehlo.multiply %5, %4 : tensor<2xui64> loc(#loc102)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<2xui64> loc(#loc102)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<2xui64> loc(#loc102)
    %9 = stablehlo.convert %6 : (tensor<2xui64>) -> tensor<2xui32> loc(#loc102)
    %10 = stablehlo.convert %8 : (tensor<2xui64>) -> tensor<2xui32> loc(#loc102)
    %11 = stablehlo.broadcast_in_dim %10, dims = [1] : (tensor<2xui32>) -> tensor<1x2xui32> loc(#loc103)
    %12 = stablehlo.broadcast_in_dim %9, dims = [1] : (tensor<2xui32>) -> tensor<1x2xui32> loc(#loc103)
    %13 = stablehlo.broadcast_in_dim %1, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc103)
    %14 = stablehlo.broadcast_in_dim %3, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc103)
    %15:2 = call @threefry2x32_5(%13, %14, %11, %12) : (tensor<64x1xui32>, tensor<64x1xui32>, tensor<1x2xui32>, tensor<1x2xui32>) -> (tensor<64x2xui32>, tensor<64x2xui32>) loc(#loc)
    %16 = stablehlo.broadcast_in_dim %15#0, dims = [0, 1] : (tensor<64x2xui32>) -> tensor<64x2x1xui32> loc(#loc104)
    %17 = stablehlo.broadcast_in_dim %15#1, dims = [0, 1] : (tensor<64x2xui32>) -> tensor<64x2x1xui32> loc(#loc104)
    %18 = stablehlo.concatenate %16, %17, dim = 2 : (tensor<64x2x1xui32>, tensor<64x2x1xui32>) -> tensor<64x2x2xui32> loc(#loc104)
    return %18 : tensor<64x2x2xui32> loc(#loc)
  } loc(#loc199)
  func.func private @threefry2x32_5(%arg0: tensor<64x1xui32> loc(unknown), %arg1: tensor<64x1xui32> loc(unknown), %arg2: tensor<1x2xui32> loc(unknown), %arg3: tensor<1x2xui32> loc(unknown)) -> (tensor<64x2xui32>, tensor<64x2xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc197)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc197)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc197)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<64x1xui32> loc(#loc84)
    %1 = stablehlo.broadcast_in_dim %c_2, dims = [] : (tensor<ui32>) -> tensor<64x1xui32> loc(#loc84)
    %2 = stablehlo.xor %0, %1 : tensor<64x1xui32> loc(#loc84)
    %3 = stablehlo.broadcast_in_dim %arg2, dims = [0, 1] : (tensor<1x2xui32>) -> tensor<64x2xui32> loc(#loc77)
    %4 = stablehlo.broadcast_in_dim %arg0, dims = [0, 1] : (tensor<64x1xui32>) -> tensor<64x2xui32> loc(#loc77)
    %5 = stablehlo.add %3, %4 : tensor<64x2xui32> loc(#loc77)
    %6 = stablehlo.broadcast_in_dim %arg3, dims = [0, 1] : (tensor<1x2xui32>) -> tensor<64x2xui32> loc(#loc77)
    %7 = stablehlo.broadcast_in_dim %arg1, dims = [0, 1] : (tensor<64x1xui32>) -> tensor<64x2xui32> loc(#loc77)
    %8 = stablehlo.add %6, %7 : tensor<64x2xui32> loc(#loc77)
