#loc = loc(unknown)
#loc1 = loc("key")
#loc4 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":298:50 to :74)
#loc33 = loc("/Users/noahfarr/reinforcement-learning/.venv/lib/python3.13/site-packages/flax/linen/linear.py":1166:21 to 1171:5)
#loc34 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":84:32 to :49)
#loc35 = loc("/Users/noahfarr/reinforcement-learning/src/networks/networks/network.py":24:12 to :71)
#loc36 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":307:17 to 314:9)
#loc45 = loc("scatter")
#loc100 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":268:20 to :66)
#loc101 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":192:23 to :63)
#loc107 = loc("vmap()")
#loc138 = loc("erf")
#loc142 = loc("RecurrentPPO.init"(#loc4))
#loc171 = loc("Embed.setup"(#loc33))
#loc172 = loc("TokenFeatureExtractor.__call__"(#loc34))
#loc173 = loc("Network.__call__"(#loc35))
#loc174 = loc("RecurrentPPO.init"(#loc36))
#loc183 = loc("scatter:"(#loc45))
#loc229 = loc("RecurrentPPO.update_step"(#loc100))
#loc230 = loc("main.<locals>.train_step"(#loc101))
#loc236 = loc(callsite(#loc173 at #loc174))
#loc247 = loc(callsite(#loc229 at #loc230))
#loc255 = loc(callsite(#loc172 at #loc236))
#loc281 = loc(callsite(#loc171 at #loc255))
module @jit_init attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key")) -> (tensor<i32> {jax.result_info = "result.step"}, tensor<16x5xi32> {jax.result_info = "result.timestep.obs"}, tensor<16xi32> {jax.result_info = "result.timestep.action"}, tensor<16xf32> {jax.result_info = "result.timestep.reward"}, tensor<16xi1> {jax.result_info = "result.timestep.terminated"}, tensor<16xi1> {jax.result_info = "result.timestep.truncated"}, tensor<16xf32> {jax.result_info = "result.timestep.info['fired']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['guess_count']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['illegal_guesses']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['matched_secret']"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.env_state.secret_answer"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.env_state.guess_feedback"}, tensor<16xi1> {jax.result_info = "result.environment_state.env_state.guess_revealed"}, tensor<16xi32> {jax.result_info = "result.environment_state.env_state.guess_count"}, tensor<16xi1> {jax.result_info = "result.environment_state.env_state.matched_secret"}, tensor<16xi1> {jax.result_info = "result.environment_state.active"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.arguments"}, tensor<16xi32> {jax.result_info = "result.environment_state.cursor"}, tensor<16x16xf32> {jax.result_info = "result.carry[1]"}, tensor<33x16xf32> {jax.result_info = "result.params['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.params['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.params['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.params['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['candidate']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['update_gate']['kernel']"}, tensor<i32> {jax.result_info = "result.optimizer_state[1][0].count"}, tensor<33x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['candidate']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['update_gate']['kernel']"}, tensor<33x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['candidate']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['update_gate']['kernel']"}) {
    %c = stablehlo.constant dense<3309781136> : tensor<ui32> loc(#loc248)
    %c_0 = stablehlo.constant dense<1632372854> : tensor<ui32> loc(#loc248)
    %c_1 = stablehlo.constant dense<2875902972> : tensor<ui32> loc(#loc248)
    %c_2 = stablehlo.constant dense<1> : tensor<i32> loc(#loc248)
    %c_3 = stablehlo.constant dense<207500355> : tensor<ui32> loc(#loc248)
    %cst = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %c_4 = stablehlo.constant dense<352107221> : tensor<ui32> loc(#loc248)
    %c_5 = stablehlo.constant dense<-1> : tensor<i32> loc(#loc)
    %c_6 = stablehlo.constant dense<3763648675> : tensor<ui32> loc(#loc248)
    %c_7 = stablehlo.constant dense<2> : tensor<i32> loc(#loc)
    %c_8 = stablehlo.constant dense<-2> : tensor<i32> loc(#loc)
    %cst_9 = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %c_10 = stablehlo.constant dense<1591842985> : tensor<ui32> loc(#loc248)
    %cst_11 = stablehlo.constant dense<6.250000e-02> : tensor<f32> loc(#loc)
    %c_12 = stablehlo.constant dense<3005692971> : tensor<ui32> loc(#loc248)
    %c_13 = stablehlo.constant dense<true> : tensor<i1> loc(#loc248)
    %c_14 = stablehlo.constant dense<28> : tensor<i32> loc(#loc248)
    %cst_15 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c_16 = stablehlo.constant dense<false> : tensor<i1> loc(#loc)
    %c_17 = stablehlo.constant dense<5> : tensor<i32> loc(#loc248)
    %c_18 = stablehlo.constant dense<16> : tensor<i32> loc(#loc)
    %c_19 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_20 = stablehlo.constant dense<[[0, 20, 3, 8, 14], [1, 17, 8, 2, 10], [2, 7, 0, 8, 17], [2, 11, 14, 20, 3], [2, 17, 0, 13, 4], [5, 11, 8, 13, 19], [5, 17, 14, 18, 19], [6, 11, 0, 25, 4], [6, 17, 0, 15, 4], [7, 14, 20, 18, 4], [11, 4, 12, 14, 13], [12, 14, 20, 13, 3], [15, 11, 0, 13, 19], [18, 11, 0, 19, 4], [18, 15, 0, 3, 4], [18, 19, 14, 17, 12]]> : tensor<16x5xi32> loc(#loc248)
    %0 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<3x2xui32> loc(#loc294)
    %1 = stablehlo.slice %0 [0:1, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc273)
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc274)
    %3 = stablehlo.slice %0 [1:2, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc273)
    %4 = stablehlo.reshape %3 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc274)
    %5 = call @_threefry_split_0(%2) : (tensor<2xui32>) -> tensor<16x2xui32> loc(#loc331)
    %6 = stablehlo.broadcast_in_dim %5, dims = [0, 2] : (tensor<16x2xui32>) -> tensor<16x1x2xui32> loc(#loc296)
    %7 = stablehlo.reshape %6 : (tensor<16x1x2xui32>) -> tensor<16x2xui32> loc(#loc297)
    %8 = call @_randint(%7, %c_19, %c_18) : (tensor<16x2xui32>, tensor<i32>, tensor<i32>) -> tensor<16xi32> loc(#loc393)
    %9 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc394)
    %10 = stablehlo.compare LT, %8, %9, SIGNED : (tensor<16xi32>, tensor<16xi32>) -> tensor<16xi1> loc(#loc394)
    %11 = stablehlo.broadcast_in_dim %c_18, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc395)
    %12 = stablehlo.add %8, %11 : tensor<16xi32> loc(#loc395)
    %13 = stablehlo.select %10, %12, %8 : tensor<16xi1>, tensor<16xi32> loc(#loc396)
    %14 = stablehlo.compare LT, %c_19, %c_19, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc394)
    %15 = stablehlo.add %c_19, %c_17 : tensor<i32> loc(#loc395)
    %16 = stablehlo.select %14, %15, %c_19 : tensor<i1>, tensor<i32> loc(#loc396)
    %17 = stablehlo.broadcast_in_dim %13, dims = [0] : (tensor<16xi32>) -> tensor<16x1xi32> loc(#loc397)
    %18 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<i32>) -> tensor<16x1xi32> loc(#loc397)
    %19 = stablehlo.concatenate %17, %18, dim = 1 : (tensor<16x1xi32>, tensor<16x1xi32>) -> tensor<16x2xi32> loc(#loc398)
    %20 = "stablehlo.gather"(%c_20, %19) <{dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 5>}> : (tensor<16x5xi32>, tensor<16x2xi32>) -> tensor<16x1x5xi32> loc(#loc399)
    %21 = stablehlo.reshape %20 : (tensor<16x1x5xi32>) -> tensor<16x5xi32> loc(#loc400)
    %22 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc401)
    %23 = call @_one_hot(%22) : (tensor<5xi32>) -> tensor<5x3xf32> loc(#loc434)
    %24 = stablehlo.reshape %23 : (tensor<5x3xf32>) -> tensor<15xf32> loc(#loc435)
    %25 = call @_where(%c_16, %24, %cst_15) : (tensor<i1>, tensor<15xf32>, tensor<f32>) -> tensor<15xf32> loc(#loc436)
    %26 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc361)
    %27 = stablehlo.broadcast_in_dim %c_14, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc362)
    %28 = stablehlo.broadcast_in_dim %22, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc299)
    %29 = stablehlo.broadcast_in_dim %c_16, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc299)
    %30 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc299)
    %31 = stablehlo.broadcast_in_dim %c_16, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc299)
    %32 = stablehlo.broadcast_in_dim %c_16, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc299)
    %33 = stablehlo.broadcast_in_dim %26, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc299)
    %34 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc299)
    %35 = stablehlo.broadcast_in_dim %27, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc299)
    %36 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc299)
    %37 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc299)
    %38 = stablehlo.broadcast_in_dim %c_13, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc299)
    %39 = stablehlo.broadcast_in_dim %c_16, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc299)
    %40 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc299)
    %41 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc299)
    %42 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc299)
    %43 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc299)
    %44 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc477)
    %45 = stablehlo.broadcast_in_dim %35, dims = [0, 2] : (tensor<16x5xi32>) -> tensor<16x1x5xi32> loc(#loc336)
    %46 = stablehlo.broadcast_in_dim %36, dims = [0] : (tensor<16xi32>) -> tensor<16x1xi32> loc(#loc336)
    %47 = stablehlo.broadcast_in_dim %38, dims = [0] : (tensor<16xi1>) -> tensor<16x1xi1> loc(#loc336)
    %48 = stablehlo.broadcast_in_dim %39, dims = [0] : (tensor<16xi1>) -> tensor<16x1xi1> loc(#loc336)
    %49 = stablehlo.or %47, %48 : tensor<16x1xi1> loc(#loc302)
    %50 = call @_threefry_fold_in(%4, %c_12) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc406)
    %51 = call @_normal(%50) : (tensor<2xui32>) -> tensor<33x16xf32> loc(#loc365)
    %52 = stablehlo.sqrt %cst_11 : tensor<f32> loc(#loc366)
    %53 = stablehlo.broadcast_in_dim %52, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc367)
    %54 = stablehlo.multiply %51, %53 : tensor<33x16xf32> loc(#loc367)
    %55 = call @_take(%54, %46) : (tensor<33x16xf32>, tensor<16x1xi32>) -> tensor<16x1x16xf32> loc(#loc368)
    %56 = stablehlo.broadcast_in_dim %55, dims = [0, 1, 3] : (tensor<16x1x16xf32>) -> tensor<16x1x1x16xf32> loc(#loc339)
    %57 = call @_take_14(%54, %45) : (tensor<33x16xf32>, tensor<16x1x5xi32>) -> tensor<16x1x5x16xf32> loc(#loc369)
    %58 = stablehlo.concatenate %56, %57, dim = 2 : (tensor<16x1x1x16xf32>, tensor<16x1x5x16xf32>) -> tensor<16x1x6x16xf32> loc(#loc341)
    %59 = stablehlo.reshape %58 : (tensor<16x1x6x16xf32>) -> tensor<16x6x16xf32> loc(#loc342)
    %60 = stablehlo.broadcast_in_dim %c_16, dims = [] : (tensor<i1>) -> tensor<16x1x6xi1> loc(#loc343)
    %61 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc344)
    %62 = "stablehlo.scatter"(%60, %61, %49) <{indices_are_sorted = true, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 1], inserted_window_dims = [2], scatter_dims_to_operand_dims = [2]>, unique_indices = true}> ({
    ^bb0(%arg1: tensor<i1> loc("scatter:"(#loc45)), %arg2: tensor<i1> loc("scatter:"(#loc45))):
      stablehlo.return %arg2 : tensor<i1> loc(#loc345)
    }) : (tensor<16x1x6xi1>, tensor<1xi32>, tensor<16x1xi1>) -> tensor<16x1x6xi1> loc(#loc345)
    %63 = stablehlo.reshape %62 : (tensor<16x1x6xi1>) -> tensor<16x6xi1> loc(#loc346)
    %64 = call @_threefry_fold_in(%4, %c_10) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc506)
    %65 = stablehlo.sqrt %cst_11 : tensor<f32> loc(#loc479)
    %66 = stablehlo.divide %65, %cst_9 : tensor<f32> loc(#loc480)
    %67 = call @_truncated_normal(%64, %c_8, %c_7) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc481)
    %68 = stablehlo.broadcast_in_dim %66, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc482)
    %69 = stablehlo.multiply %67, %68 : tensor<16x16xf32> loc(#loc482)
    %70 = call @_threefry_fold_in(%4, %c_6) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc507)
    %71 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc484)
    %72 = stablehlo.dot_general %59, %69, contracting_dims = [2] x [0] : (tensor<16x6x16xf32>, tensor<16x16xf32>) -> tensor<16x6x16xf32> loc(#loc485)
    %73 = stablehlo.reshape %71 : (tensor<16xf32>) -> tensor<1x1x16xf32> loc(#loc486)
    %74 = stablehlo.broadcast_in_dim %73, dims = [0, 1, 2] : (tensor<1x1x16xf32>) -> tensor<16x6x16xf32> loc(#loc487)
    %75 = stablehlo.add %72, %74 : tensor<16x6x16xf32> loc(#loc487)
    %76 = call @relu(%75) : (tensor<16x6x16xf32>) -> tensor<16x6x16xf32> loc(#loc443)
    %77 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc488)
    %78 = call @_threefry_fold_in(%4, %c_4) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc527)
    %79 = stablehlo.sqrt %cst_11 : tensor<f32> loc(#loc509)
    %80 = stablehlo.divide %79, %cst_9 : tensor<f32> loc(#loc510)
    %81 = call @_truncated_normal(%78, %c_8, %c_7) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc511)
    %82 = stablehlo.broadcast_in_dim %80, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc512)
    %83 = stablehlo.multiply %81, %82 : tensor<16x16xf32> loc(#loc512)
    %84 = stablehlo.dot_general %76, %83, contracting_dims = [2] x [0] : (tensor<16x6x16xf32>, tensor<16x16xf32>) -> tensor<16x6x16xf32> loc(#loc513)
    %85 = stablehlo.negate %84 : tensor<16x6x16xf32> loc(#loc514)
    %86 = stablehlo.exponential %85 : tensor<16x6x16xf32> loc(#loc515)
    %87 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<16x6x16xf32> loc(#loc516)
    %88 = stablehlo.add %87, %86 : tensor<16x6x16xf32> loc(#loc516)
    %89 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<16x6x16xf32> loc(#loc517)
    %90 = stablehlo.divide %89, %88 : tensor<16x6x16xf32> loc(#loc517)
    %91 = stablehlo.broadcast_in_dim %cst, dims = [] : (tensor<f32>) -> tensor<16x6x16xf32> loc(#loc492)
    %92 = stablehlo.subtract %91, %90 : tensor<16x6x16xf32> loc(#loc492)
    %93 = call @_threefry_fold_in(%4, %c_3) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc528)
    %94 = stablehlo.sqrt %cst_11 : tensor<f32> loc(#loc519)
    %95 = stablehlo.divide %94, %cst_9 : tensor<f32> loc(#loc520)
    %96 = call @_truncated_normal(%93, %c_8, %c_7) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc521)
    %97 = stablehlo.broadcast_in_dim %95, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc522)
    %98 = stablehlo.multiply %96, %97 : tensor<16x16xf32> loc(#loc522)
    %99 = stablehlo.dot_general %76, %98, contracting_dims = [2] x [0] : (tensor<16x6x16xf32>, tensor<16x16xf32>) -> tensor<16x6x16xf32> loc(#loc523)
    %100 = stablehlo.multiply %90, %99 : tensor<16x6x16xf32> loc(#loc495)
    %101 = stablehlo.reshape %63 : (tensor<16x6xi1>) -> tensor<16x6x1xi1> loc(#loc496)
    %102 = stablehlo.convert %101 : (tensor<16x6x1xi1>) -> tensor<16x6x1xf32> loc(#loc451)
    %103 = stablehlo.broadcast_in_dim %102, dims = [0, 1, 2] : (tensor<16x6x1xf32>) -> tensor<16x6x16xf32> loc(#loc452)
    %104 = stablehlo.multiply %103, %92 : tensor<16x6x16xf32> loc(#loc452)
    %105 = stablehlo.broadcast_in_dim %77, dims = [0, 2] : (tensor<16x16xf32>) -> tensor<16x1x16xf32> loc(#loc453)
    %106 = stablehlo.broadcast_in_dim %105, dims = [0, 1, 2] : (tensor<16x1x16xf32>) -> tensor<16x6x16xf32> loc(#loc454)
    %107 = stablehlo.multiply %104, %106 : tensor<16x6x16xf32> loc(#loc454)
    %108 = stablehlo.add %100, %107 : tensor<16x6x16xf32> loc(#loc455)
    %109 = stablehlo.convert %101 : (tensor<16x6x1xi1>) -> tensor<16x6x1xi32> loc(#loc456)
    %110 = stablehlo.broadcast_in_dim %c_2, dims = [] : (tensor<i32>) -> tensor<16x6x1xi32> loc(#loc457)
    %111 = stablehlo.subtract %110, %109 : tensor<16x6x1xi32> loc(#loc457)
    %112 = stablehlo.convert %111 : (tensor<16x6x1xi32>) -> tensor<16x6x1xf32> loc(#loc458)
    %113 = stablehlo.broadcast_in_dim %112, dims = [0, 1, 2] : (tensor<16x6x1xf32>) -> tensor<16x6x16xf32> loc(#loc459)
    %114 = stablehlo.multiply %113, %92 : tensor<16x6x16xf32> loc(#loc459)
    %115 = stablehlo.slice %114 [0:16, 0:5:2, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x3x16xf32> loc(#loc460)
    %116 = stablehlo.slice %108 [0:16, 0:5:2, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x3x16xf32> loc(#loc460)
    %117 = stablehlo.slice %114 [0:16, 1:6:2, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x3x16xf32> loc(#loc460)
    %118 = stablehlo.slice %108 [0:16, 1:6:2, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x3x16xf32> loc(#loc460)
    %119 = stablehlo.multiply %117, %115 : tensor<16x3x16xf32> loc(#loc497)
    %120 = stablehlo.multiply %117, %116 : tensor<16x3x16xf32> loc(#loc498)
    %121 = stablehlo.add %120, %118 : tensor<16x3x16xf32> loc(#loc499)
    %122 = stablehlo.slice %119 [0:16, 0:2:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %123 = stablehlo.slice %121 [0:16, 0:2:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %124 = stablehlo.slice %119 [0:16, 1:3:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %125 = stablehlo.slice %121 [0:16, 1:3:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %126 = stablehlo.multiply %124, %122 : tensor<16x1x16xf32> loc(#loc497)
    %127 = stablehlo.multiply %124, %123 : tensor<16x1x16xf32> loc(#loc498)
    %128 = stablehlo.add %127, %125 : tensor<16x1x16xf32> loc(#loc499)
    %129 = stablehlo.slice %119 [0:16, 2:3:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %130 = stablehlo.slice %121 [0:16, 2:3:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %131 = stablehlo.multiply %129, %126 : tensor<16x1x16xf32> loc(#loc497)
    %132 = stablehlo.multiply %129, %128 : tensor<16x1x16xf32> loc(#loc498)
    %133 = stablehlo.add %132, %130 : tensor<16x1x16xf32> loc(#loc499)
    %134 = stablehlo.slice %119 [0:16, 0:1, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %135 = stablehlo.concatenate %134, %131, dim = 1 : (tensor<16x1x16xf32>, tensor<16x1x16xf32>) -> tensor<16x2x16xf32> loc(#loc464)
    %136 = stablehlo.slice %121 [0:16, 0:1, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %137 = stablehlo.concatenate %136, %133, dim = 1 : (tensor<16x1x16xf32>, tensor<16x1x16xf32>) -> tensor<16x2x16xf32> loc(#loc464)
    %138 = stablehlo.pad %135, %cst_15, low = [0, 0, 0], high = [0, 0, 0], interior = [0, 1, 0] : (tensor<16x2x16xf32>, tensor<f32>) -> tensor<16x3x16xf32> loc(#loc465)
    %139 = stablehlo.pad %126, %cst_15, low = [0, 1, 0], high = [0, 1, 0], interior = [0, 1, 0] : (tensor<16x1x16xf32>, tensor<f32>) -> tensor<16x3x16xf32> loc(#loc465)
    %140 = stablehlo.add %138, %139 : tensor<16x3x16xf32> loc(#loc466)
    %141 = stablehlo.pad %137, %cst_15, low = [0, 0, 0], high = [0, 0, 0], interior = [0, 1, 0] : (tensor<16x2x16xf32>, tensor<f32>) -> tensor<16x3x16xf32> loc(#loc465)
    %142 = stablehlo.pad %128, %cst_15, low = [0, 1, 0], high = [0, 1, 0], interior = [0, 1, 0] : (tensor<16x1x16xf32>, tensor<f32>) -> tensor<16x3x16xf32> loc(#loc465)
    %143 = stablehlo.add %141, %142 : tensor<16x3x16xf32> loc(#loc466)
    %144 = stablehlo.slice %140 [0:16, 0:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x2x16xf32> loc(#loc460)
    %145 = stablehlo.slice %143 [0:16, 0:2, 0:16] : (tensor<16x3x16xf32>) -> tensor<16x2x16xf32> loc(#loc460)
    %146 = stablehlo.slice %114 [0:16, 2:6:2, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x2x16xf32> loc(#loc460)
    %147 = stablehlo.slice %108 [0:16, 2:6:2, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x2x16xf32> loc(#loc460)
    %148 = stablehlo.multiply %146, %144 : tensor<16x2x16xf32> loc(#loc497)
    %149 = stablehlo.multiply %146, %145 : tensor<16x2x16xf32> loc(#loc498)
    %150 = stablehlo.add %149, %147 : tensor<16x2x16xf32> loc(#loc499)
    %151 = stablehlo.slice %114 [0:16, 0:1, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %152 = stablehlo.concatenate %151, %148, dim = 1 : (tensor<16x1x16xf32>, tensor<16x2x16xf32>) -> tensor<16x3x16xf32> loc(#loc464)
    %153 = stablehlo.slice %108 [0:16, 0:1, 0:16] : (tensor<16x6x16xf32>) -> tensor<16x1x16xf32> loc(#loc460)
    %154 = stablehlo.concatenate %153, %150, dim = 1 : (tensor<16x1x16xf32>, tensor<16x2x16xf32>) -> tensor<16x3x16xf32> loc(#loc464)
    %155 = stablehlo.pad %152, %cst_15, low = [0, 0, 0], high = [0, 1, 0], interior = [0, 1, 0] : (tensor<16x3x16xf32>, tensor<f32>) -> tensor<16x6x16xf32> loc(#loc465)
    %156 = stablehlo.pad %140, %cst_15, low = [0, 1, 0], high = [0, 0, 0], interior = [0, 1, 0] : (tensor<16x3x16xf32>, tensor<f32>) -> tensor<16x6x16xf32> loc(#loc465)
    %157 = stablehlo.add %155, %156 : tensor<16x6x16xf32> loc(#loc466)
    %158 = stablehlo.pad %154, %cst_15, low = [0, 0, 0], high = [0, 1, 0], interior = [0, 1, 0] : (tensor<16x3x16xf32>, tensor<f32>) -> tensor<16x6x16xf32> loc(#loc465)
    %159 = stablehlo.pad %143, %cst_15, low = [0, 1, 0], high = [0, 0, 0], interior = [0, 1, 0] : (tensor<16x3x16xf32>, tensor<f32>) -> tensor<16x6x16xf32> loc(#loc465)
    %160 = stablehlo.add %158, %159 : tensor<16x6x16xf32> loc(#loc466)
    %161 = stablehlo.broadcast_in_dim %44, dims = [0, 2] : (tensor<16x16xf32>) -> tensor<16x1x16xf32> loc(#loc467)
    %162 = stablehlo.broadcast_in_dim %161, dims = [0, 1, 2] : (tensor<16x1x16xf32>) -> tensor<16x6x16xf32> loc(#loc468)
    %163 = stablehlo.multiply %157, %162 : tensor<16x6x16xf32> loc(#loc468)
    %164 = stablehlo.add %160, %163 : tensor<16x6x16xf32> loc(#loc469)
    %165 = call @_take_20(%164, %c_5) : (tensor<16x6x16xf32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc470)
    %166 = call @_threefry_fold_in(%4, %c_1) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc423)
    %167 = stablehlo.sqrt %cst_11 : tensor<f32> loc(#loc373)
    %168 = stablehlo.divide %167, %cst_9 : tensor<f32> loc(#loc374)
    %169 = call @_truncated_normal_22(%166, %c_8, %c_7) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x33xf32> loc(#loc375)
    %170 = stablehlo.broadcast_in_dim %168, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc376)
    %171 = stablehlo.multiply %169, %170 : tensor<16x33xf32> loc(#loc376)
    %172 = call @_threefry_fold_in(%4, %c_0) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc424)
    %173 = stablehlo.sqrt %cst_11 : tensor<f32> loc(#loc378)
    %174 = stablehlo.divide %173, %cst_9 : tensor<f32> loc(#loc379)
    %175 = call @_truncated_normal_27(%172, %c_8, %c_7) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x1xf32> loc(#loc380)
    %176 = stablehlo.broadcast_in_dim %174, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc381)
    %177 = stablehlo.multiply %175, %176 : tensor<16x1xf32> loc(#loc381)
    %178 = call @_threefry_fold_in(%4, %c) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc425)
    %179 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc383)
    %180 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc524)
    %181 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc524)
    %182 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc524)
    %183 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc524)
    %184 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc524)
    %185 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc524)
    %186 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc524)
    %187 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc524)
    %188 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc525)
    %189 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc525)
    %190 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc525)
    %191 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc525)
    %192 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc525)
    %193 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc525)
    %194 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc525)
    %195 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc525)
    return %c_19, %35, %36, %37, %38, %39, %40, %41, %42, %43, %21, %28, %29, %30, %31, %32, %33, %34, %44, %54, %171, %179, %177, %71, %69, %98, %83, %c_19, %180, %181, %182, %183, %184, %185, %186, %187, %188, %189, %190, %191, %192, %193, %194, %195 : tensor<i32>, tensor<16x5xi32>, tensor<16xi32>, tensor<16xf32>, tensor<16xi1>, tensor<16xi1>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16x5xi32>, tensor<16x5xi32>, tensor<16xi1>, tensor<16xi32>, tensor<16xi1>, tensor<16xi1>, tensor<16x5xi32>, tensor<16xi32>, tensor<16x16xf32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<i32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16x16xf32> loc(#loc248)
  } loc(#loc)
  func.func private @_threefry_split(%arg0: tensor<2xui32> loc(unknown)) -> tensor<3x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc239)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc239)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc240)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc241)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc240)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc241)
    %4 = stablehlo.iota dim = 0 : tensor<3xui64> loc(#loc239)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc239)
    %6 = stablehlo.multiply %5, %4 : tensor<3xui64> loc(#loc239)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc239)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<3xui64> loc(#loc239)
    %9 = stablehlo.convert %6 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc239)
    %10 = stablehlo.convert %8 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc239)
    %11:2 = call @threefry2x32(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<3xui32>, tensor<3xui32>) -> (tensor<3xui32>, tensor<3xui32>) loc(#loc142)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc242)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc242)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<3x1xui32>, tensor<3x1xui32>) -> tensor<3x2xui32> loc(#loc242)
    return %14 : tensor<3x2xui32> loc(#loc)
  } loc(#loc259)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg1: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg2: tensor<3xui32> loc("RecurrentPPO.init"(#loc4)), %arg3: tensor<3xui32> loc("RecurrentPPO.init"(#loc4))) -> (tensor<3xui32>, tensor<3xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc228)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc228)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc228)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc243)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc243)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc244)
    %3 = stablehlo.add %arg2, %2 : tensor<3xui32> loc(#loc244)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc244)
    %5 = stablehlo.add %arg3, %4 : tensor<3xui32> loc(#loc244)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc287)
      stablehlo.return %7 : tensor<i1> loc(#loc260)
    } do {
      %7:8 = func.call @closed_call(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc288)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc289)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc260)
    } loc(#loc260)
    return %6#2, %6#3 : tensor<3xui32>, tensor<3xui32> loc(#loc142)
  } loc(#loc142)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<3xui32> loc(unknown), %arg2: tensor<3xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc91)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %3 = stablehlo.add %arg1, %arg2 : tensor<3xui32> loc(#loc91)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<3xui32> loc(#loc94)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc95)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc96)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<3xui32> loc(#loc96)
    %9 = stablehlo.or %5, %8 : tensor<3xui32> loc(#loc97)
    %10 = stablehlo.xor %3, %9 : tensor<3xui32> loc(#loc98)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %13 = stablehlo.add %3, %10 : tensor<3xui32> loc(#loc91)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %15 = stablehlo.shift_left %10, %14 : tensor<3xui32> loc(#loc94)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc95)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc96)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<3xui32> loc(#loc96)
    %19 = stablehlo.or %15, %18 : tensor<3xui32> loc(#loc97)
    %20 = stablehlo.xor %13, %19 : tensor<3xui32> loc(#loc98)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %23 = stablehlo.add %13, %20 : tensor<3xui32> loc(#loc91)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %25 = stablehlo.shift_left %20, %24 : tensor<3xui32> loc(#loc94)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc95)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc96)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<3xui32> loc(#loc96)
    %29 = stablehlo.or %25, %28 : tensor<3xui32> loc(#loc97)
    %30 = stablehlo.xor %23, %29 : tensor<3xui32> loc(#loc98)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %33 = stablehlo.add %23, %30 : tensor<3xui32> loc(#loc91)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %35 = stablehlo.shift_left %30, %34 : tensor<3xui32> loc(#loc94)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc95)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc96)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<3xui32> loc(#loc96)
    %39 = stablehlo.or %35, %38 : tensor<3xui32> loc(#loc97)
    %40 = stablehlo.xor %33, %39 : tensor<3xui32> loc(#loc98)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc91)
    %42 = stablehlo.add %33, %41 : tensor<3xui32> loc(#loc91)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc91)
    %44 = stablehlo.add %40, %43 : tensor<3xui32> loc(#loc91)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc91)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc99)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc91)
    %48 = stablehlo.add %44, %47 : tensor<3xui32> loc(#loc91)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc262)
  func.func private @_threefry_split_0(%arg0: tensor<2xui32> loc(unknown)) -> tensor<16x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc264)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc264)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc265)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc266)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc265)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc266)
    %4 = stablehlo.iota dim = 0 : tensor<16xui64> loc(#loc264)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<16xui64> loc(#loc264)
    %6 = stablehlo.multiply %5, %4 : tensor<16xui64> loc(#loc264)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<16xui64> loc(#loc264)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<16xui64> loc(#loc264)
    %9 = stablehlo.convert %6 : (tensor<16xui64>) -> tensor<16xui32> loc(#loc264)
    %10 = stablehlo.convert %8 : (tensor<16xui64>) -> tensor<16xui32> loc(#loc264)
    %11:2 = call @threefry2x32_1(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<16xui32>, tensor<16xui32>) -> (tensor<16xui32>, tensor<16xui32>) loc(#loc247)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<16xui32>) -> tensor<16x1xui32> loc(#loc267)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<16xui32>) -> tensor<16x1xui32> loc(#loc267)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<16x1xui32>, tensor<16x1xui32>) -> tensor<16x2xui32> loc(#loc267)
    return %14 : tensor<16x2xui32> loc(#loc)
  } loc(#loc290)
  func.func private @threefry2x32_1(%arg0: tensor<ui32> loc(callsite(#loc229 at #loc230)), %arg1: tensor<ui32> loc(callsite(#loc229 at #loc230)), %arg2: tensor<16xui32> loc(callsite(#loc229 at #loc230)), %arg3: tensor<16xui32> loc(callsite(#loc229 at #loc230))) -> (tensor<16xui32>, tensor<16xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc228)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc228)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc228)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc268)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc268)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc269)
    %3 = stablehlo.add %arg2, %2 : tensor<16xui32> loc(#loc269)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc269)
    %5 = stablehlo.add %arg3, %4 : tensor<16xui32> loc(#loc269)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc316)
      stablehlo.return %7 : tensor<i1> loc(#loc291)
    } do {
      %7:8 = func.call @closed_call_2(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc317)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc318)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc291)
    } loc(#loc291)
    return %6#2, %6#3 : tensor<16xui32>, tensor<16xui32> loc(#loc247)
  } loc(#loc247)
  func.func private @closed_call_2(%arg0: tensor<i32> loc(unknown), %arg1: tensor<16xui32> loc(unknown), %arg2: tensor<16xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc91)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %3 = stablehlo.add %arg1, %arg2 : tensor<16xui32> loc(#loc91)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc94)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<16xui32> loc(#loc94)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc95)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc96)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<16xui32> loc(#loc96)
    %9 = stablehlo.or %5, %8 : tensor<16xui32> loc(#loc97)
    %10 = stablehlo.xor %3, %9 : tensor<16xui32> loc(#loc98)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %13 = stablehlo.add %3, %10 : tensor<16xui32> loc(#loc91)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc94)
    %15 = stablehlo.shift_left %10, %14 : tensor<16xui32> loc(#loc94)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc95)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc96)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<16xui32> loc(#loc96)
    %19 = stablehlo.or %15, %18 : tensor<16xui32> loc(#loc97)
    %20 = stablehlo.xor %13, %19 : tensor<16xui32> loc(#loc98)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %23 = stablehlo.add %13, %20 : tensor<16xui32> loc(#loc91)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc94)
    %25 = stablehlo.shift_left %20, %24 : tensor<16xui32> loc(#loc94)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc95)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc96)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<16xui32> loc(#loc96)
    %29 = stablehlo.or %25, %28 : tensor<16xui32> loc(#loc97)
    %30 = stablehlo.xor %23, %29 : tensor<16xui32> loc(#loc98)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc92)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc93)
    %33 = stablehlo.add %23, %30 : tensor<16xui32> loc(#loc91)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc94)
    %35 = stablehlo.shift_left %30, %34 : tensor<16xui32> loc(#loc94)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc95)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc96)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<16xui32> loc(#loc96)
    %39 = stablehlo.or %35, %38 : tensor<16xui32> loc(#loc97)
    %40 = stablehlo.xor %33, %39 : tensor<16xui32> loc(#loc98)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc91)
    %42 = stablehlo.add %33, %41 : tensor<16xui32> loc(#loc91)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc91)
    %44 = stablehlo.add %40, %43 : tensor<16xui32> loc(#loc91)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc91)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc99)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc91)
    %48 = stablehlo.add %44, %47 : tensor<16xui32> loc(#loc91)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc293)
  func.func private @_randint(%arg0: tensor<16x2xui32> loc(unknown), %arg1: tensor<i32> loc(unknown), %arg2: tensor<i32> loc(unknown)) -> tensor<16xi32> {
    %c = stablehlo.constant dense<65536> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<ui32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<ui32> loc(#loc)
    %c_2 = stablehlo.constant dense<2147483647> : tensor<i32> loc(#loc)
    %c_3 = stablehlo.constant dense<-2147483648> : tensor<i32> loc(#loc)
    %0 = call @clip(%c_2, %c_3, %c_2) : (tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<i32> loc(#loc102)
    %1 = stablehlo.compare GT, %arg2, %0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc103)
    %2 = call @clip_3(%arg1, %c_3, %c_2) : (tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<i32> loc(#loc102)
    %3 = stablehlo.convert %2 : tensor<i32> loc(#loc99)
    %4 = call @clip_3(%arg2, %c_3, %c_2) : (tensor<i32>, tensor<i32>, tensor<i32>) -> tensor<i32> loc(#loc102)
    %5 = stablehlo.convert %4 : tensor<i32> loc(#loc99)
    %6 = call @_threefry_split_4(%arg0) : (tensor<16x2xui32>) -> tensor<16x2x2xui32> loc(#loc104)
    %7 = stablehlo.slice %6 [0:16, 0:1, 0:2] : (tensor<16x2x2xui32>) -> tensor<16x1x2xui32> loc(#loc92)
    %8 = stablehlo.reshape %7 : (tensor<16x1x2xui32>) -> tensor<16x2xui32> loc(#loc93)
    %9 = stablehlo.slice %6 [0:16, 1:2, 0:2] : (tensor<16x2x2xui32>) -> tensor<16x1x2xui32> loc(#loc92)
    %10 = stablehlo.reshape %9 : (tensor<16x1x2xui32>) -> tensor<16x2xui32> loc(#loc93)
    %11 = stablehlo.slice %8 [0:16, 0:1] : (tensor<16x2xui32>) -> tensor<16x1xui32> loc(#loc105)
    %12 = stablehlo.reshape %11 : (tensor<16x1xui32>) -> tensor<16xui32> loc(#loc106)
    %13 = stablehlo.slice %8 [0:16, 1:2] : (tensor<16x2xui32>) -> tensor<16x1xui32> loc(#loc105)
    %14 = stablehlo.reshape %13 : (tensor<16x1xui32>) -> tensor<16xui32> loc(#loc106)
    %15:2 = call @threefry2x32_7(%12, %14, %c_1, %c_1) : (tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>) -> (tensor<16xui32>, tensor<16xui32>) loc(#loc107)
    %16 = stablehlo.xor %15#0, %15#1 : tensor<16xui32> loc(#loc108)
    %17 = stablehlo.slice %10 [0:16, 0:1] : (tensor<16x2xui32>) -> tensor<16x1xui32> loc(#loc105)
    %18 = stablehlo.reshape %17 : (tensor<16x1xui32>) -> tensor<16xui32> loc(#loc106)
    %19 = stablehlo.slice %10 [0:16, 1:2] : (tensor<16x2xui32>) -> tensor<16x1xui32> loc(#loc105)
    %20 = stablehlo.reshape %19 : (tensor<16x1xui32>) -> tensor<16xui32> loc(#loc106)
    %21:2 = call @threefry2x32_7(%18, %20, %c_1, %c_1) : (tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>) -> (tensor<16xui32>, tensor<16xui32>) loc(#loc107)
    %22 = stablehlo.xor %21#0, %21#1 : tensor<16xui32> loc(#loc108)
    %23 = stablehlo.subtract %5, %3 : tensor<i32> loc(#loc95)
    %24 = stablehlo.convert %23 : (tensor<i32>) -> tensor<ui32> loc(#loc99)
    %25 = stablehlo.compare LE, %5, %3, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc109)
    %26 = stablehlo.select %25, %c_0, %24 : tensor<i1>, tensor<ui32> loc(#loc110)
    %27 = stablehlo.compare GT, %5, %3, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc103)
    %28 = stablehlo.and %1, %27 : tensor<i1> loc(#loc111)
    %29 = stablehlo.add %26, %c_0 : tensor<ui32> loc(#loc91)
    %30 = stablehlo.select %28, %29, %26 : tensor<i1>, tensor<ui32> loc(#loc110)
    %31 = stablehlo.remainder %c, %30 : tensor<ui32> loc(#loc112)
    %32 = stablehlo.multiply %31, %31 : tensor<ui32> loc(#loc113)
    %33 = stablehlo.remainder %32, %30 : tensor<ui32> loc(#loc112)
