#loc = loc(unknown)
#loc1 = loc("key")
#loc4 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":298:50 to :74)
#loc32 = loc("/Users/noahfarr/reinforcement-learning/.venv/lib/python3.13/site-packages/flax/linen/linear.py":263:13 to 268:5)
#loc33 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":121:24 to :77)
#loc34 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":307:17 to 314:9)
#loc88 = loc("/Users/noahfarr/reinforcement-learning/src/environments/environments/wrappers/vectorize.py":31:15 to :51)
#loc89 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":85:38 to 87:9)
#loc95 = loc("vmap()")
#loc117 = loc("erf")
#loc139 = loc("RecurrentPPO.init"(#loc4))
#loc167 = loc("Dense.__call__"(#loc32))
#loc168 = loc("MaskedActorCriticNetwork.__call__"(#loc33))
#loc169 = loc("RecurrentPPO.init"(#loc34))
#loc214 = loc("Vectorize.step"(#loc88))
#loc215 = loc("RecurrentPPO.rollout"(#loc89))
#loc234 = loc(callsite(#loc168 at #loc169))
#loc245 = loc(callsite(#loc214 at #loc215))
#loc255 = loc(callsite(#loc167 at #loc234))
module @jit_init attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key")) -> (tensor<i32> {jax.result_info = "result.step"}, tensor<64x16xi1> {jax.result_info = "result.timestep.obs['action_mask']"}, tensor<64x15xf32> {jax.result_info = "result.timestep.obs['observation']"}, tensor<64xi32> {jax.result_info = "result.timestep.action"}, tensor<64xf32> {jax.result_info = "result.timestep.reward"}, tensor<64xi1> {jax.result_info = "result.timestep.terminated"}, tensor<64xi1> {jax.result_info = "result.timestep.truncated"}, tensor<64xf32> {jax.result_info = "result.timestep.info['guess_count']"}, tensor<64xf32> {jax.result_info = "result.timestep.info['illegal_guesses']"}, tensor<64xf32> {jax.result_info = "result.timestep.info['matched_secret']"}, tensor<64x5xi32> {jax.result_info = "result.environment_state.secret_answer"}, tensor<64x5xi32> {jax.result_info = "result.environment_state.guess_feedback"}, tensor<64xi1> {jax.result_info = "result.environment_state.guess_revealed"}, tensor<64xi32> {jax.result_info = "result.environment_state.guess_count"}, tensor<64xi1> {jax.result_info = "result.environment_state.matched_secret"}, tensor<64x32xf32> {jax.result_info = "result.carry[1]"}, tensor<32x16xf32> {jax.result_info = "result.params['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.params['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.params['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.params['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['hn']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['hn']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['hr']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['hz']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['in']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['in']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['ir']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['ir']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['iz']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['cell']['iz']['kernel']"}, tensor<i32> {jax.result_info = "result.optimizer_state[1][0].count"}, tensor<32x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['hn']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['hn']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['hr']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['hz']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['in']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['in']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['ir']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['ir']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['iz']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['cell']['iz']['kernel']"}, tensor<32x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['hn']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['hn']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['hr']['kernel']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['hz']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['in']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['in']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['ir']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['ir']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['iz']['bias']"}, tensor<32x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['cell']['iz']['kernel']"}) {
    %c = stablehlo.constant dense<3831938679> : tensor<ui32> loc(#loc248)
    %c_0 = stablehlo.constant dense<3491981184> : tensor<ui32> loc(#loc248)
    %cst = stablehlo.constant dense<-3.40282347E+38> : tensor<f32> loc(#loc248)
    %c_1 = stablehlo.constant dense<2876566538> : tensor<ui32> loc(#loc248)
    %c_2 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_3 = stablehlo.constant dense<667297983> : tensor<ui32> loc(#loc248)
    %c_4 = stablehlo.constant dense<2367511813> : tensor<ui32> loc(#loc248)
    %c_5 = stablehlo.constant dense<2365037529> : tensor<ui32> loc(#loc248)
    %c_6 = stablehlo.constant dense<4088089910> : tensor<ui32> loc(#loc248)
    %c_7 = stablehlo.constant dense<2365977446> : tensor<ui32> loc(#loc248)
    %c_8 = stablehlo.constant dense<600430756> : tensor<ui32> loc(#loc248)
    %c_9 = stablehlo.constant dense<1323703344> : tensor<ui32> loc(#loc248)
    %c_10 = stablehlo.constant dense<2571888726> : tensor<ui32> loc(#loc248)
    %c_11 = stablehlo.constant dense<1015950936> : tensor<ui32> loc(#loc248)
    %cst_12 = stablehlo.constant dense<3.125000e-02> : tensor<f32> loc(#loc)
    %c_13 = stablehlo.constant dense<1784643303> : tensor<ui32> loc(#loc248)
    %c_14 = stablehlo.constant dense<3178254832> : tensor<ui32> loc(#loc248)
    %cst_15 = stablehlo.constant dense<0.020833334> : tensor<f32> loc(#loc248)
    %c_16 = stablehlo.constant dense<1157806390> : tensor<ui32> loc(#loc248)
    %c_17 = stablehlo.constant dense<3085490160> : tensor<ui32> loc(#loc248)
    %c_18 = stablehlo.constant dense<2> : tensor<i32> loc(#loc)
    %c_19 = stablehlo.constant dense<-2> : tensor<i32> loc(#loc)
    %cst_20 = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %cst_21 = stablehlo.constant dense<0.0666666701> : tensor<f32> loc(#loc248)
    %c_22 = stablehlo.constant dense<2075703144> : tensor<ui32> loc(#loc248)
    %c_23 = stablehlo.constant dense<true> : tensor<i1> loc(#loc)
    %cst_24 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c_25 = stablehlo.constant dense<false> : tensor<i1> loc(#loc)
    %c_26 = stablehlo.constant dense<5> : tensor<i32> loc(#loc248)
    %c_27 = stablehlo.constant dense<16> : tensor<i32> loc(#loc)
    %c_28 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_29 = stablehlo.constant dense<[[0, 20, 3, 8, 14], [1, 17, 8, 2, 10], [2, 7, 0, 8, 17], [2, 11, 14, 20, 3], [2, 17, 0, 13, 4], [5, 11, 8, 13, 19], [5, 17, 14, 18, 19], [6, 11, 0, 25, 4], [6, 17, 0, 15, 4], [7, 14, 20, 18, 4], [11, 4, 12, 14, 13], [12, 14, 20, 13, 3], [15, 11, 0, 13, 19], [18, 11, 0, 19, 4], [18, 15, 0, 3, 4], [18, 19, 14, 17, 12]]> : tensor<16x5xi32> loc(#loc248)
    %0 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<3x2xui32> loc(#loc355)
    %1 = stablehlo.slice %0 [0:1, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc291)
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc292)
    %3 = stablehlo.slice %0 [1:2, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc291)
    %4 = stablehlo.reshape %3 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc292)
    %5 = call @_threefry_split_0(%2) : (tensor<2xui32>) -> tensor<64x2xui32> loc(#loc414)
    %6 = stablehlo.broadcast_in_dim %5, dims = [0, 2] : (tensor<64x2xui32>) -> tensor<64x1x2xui32> loc(#loc357)
    %7 = stablehlo.reshape %6 : (tensor<64x1x2xui32>) -> tensor<64x2xui32> loc(#loc358)
    %8 = call @_randint(%7, %c_28, %c_27) : (tensor<64x2xui32>, tensor<i32>, tensor<i32>) -> tensor<64xi32> loc(#loc477)
    %9 = stablehlo.broadcast_in_dim %c_28, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc478)
    %10 = stablehlo.compare LT, %8, %9, SIGNED : (tensor<64xi32>, tensor<64xi32>) -> tensor<64xi1> loc(#loc478)
    %11 = stablehlo.broadcast_in_dim %c_27, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc479)
    %12 = stablehlo.add %8, %11 : tensor<64xi32> loc(#loc479)
    %13 = stablehlo.select %10, %12, %8 : tensor<64xi1>, tensor<64xi32> loc(#loc480)
    %14 = stablehlo.compare LT, %c_28, %c_28, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc478)
    %15 = stablehlo.add %c_28, %c_26 : tensor<i32> loc(#loc479)
    %16 = stablehlo.select %14, %15, %c_28 : tensor<i1>, tensor<i32> loc(#loc480)
    %17 = stablehlo.broadcast_in_dim %13, dims = [0] : (tensor<64xi32>) -> tensor<64x1xi32> loc(#loc481)
    %18 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<i32>) -> tensor<64x1xi32> loc(#loc481)
    %19 = stablehlo.concatenate %17, %18, dim = 1 : (tensor<64x1xi32>, tensor<64x1xi32>) -> tensor<64x2xi32> loc(#loc482)
    %20 = "stablehlo.gather"(%c_29, %19) <{dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 5>}> : (tensor<16x5xi32>, tensor<64x2xi32>) -> tensor<64x1x5xi32> loc(#loc483)
    %21 = stablehlo.reshape %20 : (tensor<64x1x5xi32>) -> tensor<64x5xi32> loc(#loc484)
    %22 = stablehlo.broadcast_in_dim %c_28, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc485)
    %23 = call @_one_hot(%22) : (tensor<5xi32>) -> tensor<5x3xf32> loc(#loc507)
    %24 = stablehlo.reshape %23 : (tensor<5x3xf32>) -> tensor<15xf32> loc(#loc508)
    %25 = call @_where(%c_25, %24, %cst_24) : (tensor<i1>, tensor<15xf32>, tensor<f32>) -> tensor<15xf32> loc(#loc509)
    %26 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc489)
    %27 = stablehlo.broadcast_in_dim %22, dims = [1] : (tensor<5xi32>) -> tensor<64x5xi32> loc(#loc360)
    %28 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc360)
    %29 = stablehlo.broadcast_in_dim %c_28, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc360)
    %30 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc360)
    %31 = stablehlo.broadcast_in_dim %26, dims = [1] : (tensor<16xi1>) -> tensor<64x16xi1> loc(#loc360)
    %32 = stablehlo.broadcast_in_dim %25, dims = [1] : (tensor<15xf32>) -> tensor<64x15xf32> loc(#loc360)
    %33 = stablehlo.broadcast_in_dim %c_28, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc360)
    %34 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc360)
    %35 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc360)
    %36 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc360)
    %37 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc360)
    %38 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc360)
    %39 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc360)
    %40 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<64x32xf32> loc(#loc510)
    %41 = stablehlo.broadcast_in_dim %31, dims = [0, 2] : (tensor<64x16xi1>) -> tensor<64x1x16xi1> loc(#loc418)
    %42 = stablehlo.broadcast_in_dim %32, dims = [0, 2] : (tensor<64x15xf32>) -> tensor<64x1x15xf32> loc(#loc418)
    %43 = stablehlo.broadcast_in_dim %33, dims = [0] : (tensor<64xi32>) -> tensor<64x1xi32> loc(#loc418)
    %44 = stablehlo.broadcast_in_dim %35, dims = [0] : (tensor<64xi1>) -> tensor<64x1xi1> loc(#loc418)
    %45 = stablehlo.broadcast_in_dim %36, dims = [0] : (tensor<64xi1>) -> tensor<64x1xi1> loc(#loc418)
    %46 = stablehlo.or %44, %45 : tensor<64x1xi1> loc(#loc363)
    %47 = call @_threefry_fold_in(%4, %c_22) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc461)
    %48 = stablehlo.sqrt %cst_21 : tensor<f32> loc(#loc420)
    %49 = stablehlo.divide %48, %cst_20 : tensor<f32> loc(#loc421)
    %50 = call @_truncated_normal(%47, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<15x32xf32> loc(#loc422)
    %51 = stablehlo.broadcast_in_dim %49, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc423)
    %52 = stablehlo.multiply %50, %51 : tensor<15x32xf32> loc(#loc423)
    %53 = call @_threefry_fold_in(%4, %c_17) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc462)
    %54 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc425)
    %55 = stablehlo.dot_general %42, %52, contracting_dims = [2] x [0] : (tensor<64x1x15xf32>, tensor<15x32xf32>) -> tensor<64x1x32xf32> loc(#loc426)
    %56 = stablehlo.reshape %54 : (tensor<32xf32>) -> tensor<1x1x32xf32> loc(#loc427)
    %57 = stablehlo.broadcast_in_dim %56, dims = [0, 1, 2] : (tensor<1x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc428)
    %58 = stablehlo.add %55, %57 : tensor<64x1x32xf32> loc(#loc428)
    %59 = call @relu(%58) : (tensor<64x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc369)
    %60 = call @_one_hot_14(%43) : (tensor<64x1xi32>) -> tensor<64x1x16xf32> loc(#loc370)
    %61 = stablehlo.concatenate %59, %60, dim = 2 : (tensor<64x1x32xf32>, tensor<64x1x16xf32>) -> tensor<64x1x48xf32> loc(#loc371)
    %62 = call @_threefry_fold_in(%4, %c_16) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc533)
    %63 = stablehlo.sqrt %cst_15 : tensor<f32> loc(#loc512)
    %64 = stablehlo.divide %63, %cst_20 : tensor<f32> loc(#loc513)
    %65 = call @_truncated_normal_15(%62, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<48x32xf32> loc(#loc514)
    %66 = stablehlo.broadcast_in_dim %64, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc515)
    %67 = stablehlo.multiply %65, %66 : tensor<48x32xf32> loc(#loc515)
    %68 = call @_threefry_fold_in(%4, %c_14) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc534)
    %69 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc517)
    %70 = stablehlo.dot_general %61, %67, contracting_dims = [2] x [0] : (tensor<64x1x48xf32>, tensor<48x32xf32>) -> tensor<64x1x32xf32> loc(#loc518)
    %71 = stablehlo.reshape %69 : (tensor<32xf32>) -> tensor<1x1x32xf32> loc(#loc519)
    %72 = stablehlo.broadcast_in_dim %71, dims = [0, 1, 2] : (tensor<1x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc520)
    %73 = stablehlo.add %70, %72 : tensor<64x1x32xf32> loc(#loc520)
    %74 = call @relu(%73) : (tensor<64x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc496)
    %75 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<64x32xf32> loc(#loc521)
    %76 = stablehlo.transpose %74, dims = [1, 0, 2] : (tensor<64x1x32xf32>) -> tensor<1x64x32xf32> loc(#loc551)
    %77 = stablehlo.transpose %46, dims = [1, 0] : (tensor<64x1xi1>) -> tensor<1x64xi1> loc(#loc551)
    call @_where_20(%75) : (tensor<64x32xf32>) -> () loc(#loc573)
    %78 = call @_threefry_fold_in(%4, %c_13) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc614)
    %79 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc575)
    %80 = stablehlo.divide %79, %cst_20 : tensor<f32> loc(#loc576)
    %81 = call @_truncated_normal_21(%78, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc577)
    %82 = stablehlo.broadcast_in_dim %80, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc578)
    %83 = stablehlo.multiply %81, %82 : tensor<32x32xf32> loc(#loc578)
    %84 = call @_threefry_fold_in(%4, %c_11) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc615)
    %85 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc580)
    %86 = call @_threefry_fold_in(%4, %c_10) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc616)
    %87 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc582)
    %88 = stablehlo.divide %87, %cst_20 : tensor<f32> loc(#loc583)
    %89 = call @_truncated_normal_21(%86, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc584)
    %90 = stablehlo.broadcast_in_dim %88, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc585)
    %91 = stablehlo.multiply %89, %90 : tensor<32x32xf32> loc(#loc585)
    %92 = call @_threefry_fold_in(%4, %c_9) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc617)
    %93 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc587)
    %94 = stablehlo.divide %93, %cst_20 : tensor<f32> loc(#loc588)
    %95 = call @_truncated_normal_21(%92, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc589)
    %96 = stablehlo.broadcast_in_dim %94, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc590)
    %97 = stablehlo.multiply %95, %96 : tensor<32x32xf32> loc(#loc590)
    %98 = call @_threefry_fold_in(%4, %c_8) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc618)
    %99 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc592)
    %100 = call @_threefry_fold_in(%4, %c_7) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc619)
    %101 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc594)
    %102 = stablehlo.divide %101, %cst_20 : tensor<f32> loc(#loc595)
    %103 = call @_truncated_normal_21(%100, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc596)
    %104 = stablehlo.broadcast_in_dim %102, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc597)
    %105 = stablehlo.multiply %103, %104 : tensor<32x32xf32> loc(#loc597)
    %106 = call @_threefry_fold_in(%4, %c_6) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc620)
    %107 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc599)
    %108 = stablehlo.divide %107, %cst_20 : tensor<f32> loc(#loc600)
    %109 = call @_truncated_normal_21(%106, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc601)
    %110 = stablehlo.broadcast_in_dim %108, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc602)
    %111 = stablehlo.multiply %109, %110 : tensor<32x32xf32> loc(#loc602)
    %112 = call @_threefry_fold_in(%4, %c_5) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc621)
    %113 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc604)
    %114 = call @_threefry_fold_in(%4, %c_4) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc622)
    %115 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc606)
    %116 = stablehlo.divide %115, %cst_20 : tensor<f32> loc(#loc607)
    %117 = call @_truncated_normal_21(%114, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc608)
    %118 = stablehlo.broadcast_in_dim %116, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc609)
    %119 = stablehlo.multiply %117, %118 : tensor<32x32xf32> loc(#loc609)
    %120 = call @_threefry_fold_in(%4, %c_3) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc623)
    %121 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc611)
    %122 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<1x64x32xf32> loc(#loc538)
    %123:16 = stablehlo.while(%iterArg = %76, %iterArg_30 = %77, %iterArg_31 = %75, %iterArg_32 = %83, %iterArg_33 = %85, %iterArg_34 = %91, %iterArg_35 = %97, %iterArg_36 = %99, %iterArg_37 = %105, %iterArg_38 = %111, %iterArg_39 = %113, %iterArg_40 = %119, %iterArg_41 = %121, %iterArg_42 = %c_28, %iterArg_43 = %40, %iterArg_44 = %122) : tensor<1x64x32xf32>, tensor<1x64xi1>, tensor<64x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<i32>, tensor<64x32xf32>, tensor<1x64x32xf32>
    cond {
      %175 = stablehlo.compare LT, %iterArg_42, %c_2, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc540)
      stablehlo.return %175 : tensor<i1> loc(#loc539)
    } do {
      %175 = func.call @dynamic_index_in_dim(%iterArg, %iterArg_42) : (tensor<1x64x32xf32>, tensor<i32>) -> tensor<64x32xf32> loc(#loc541)
      %176 = func.call @dynamic_index_in_dim_26(%iterArg_30, %iterArg_42) : (tensor<1x64xi1>, tensor<i32>) -> tensor<64xi1> loc(#loc541)
      %177:2 = func.call @closed_call_27(%iterArg_31, %iterArg_32, %iterArg_33, %iterArg_34, %iterArg_35, %iterArg_36, %iterArg_37, %iterArg_38, %iterArg_39, %iterArg_40, %iterArg_41, %iterArg_43, %175, %176) : (tensor<64x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<64x32xf32>, tensor<64x32xf32>, tensor<64xi1>) -> (tensor<64x32xf32>, tensor<64x32xf32>) loc(#loc542)
      %178 = func.call @dynamic_update_index_in_dim(%iterArg_44, %177#1, %iterArg_42) : (tensor<1x64x32xf32>, tensor<64x32xf32>, tensor<i32>) -> tensor<1x64x32xf32> loc(#loc543)
      %179 = stablehlo.add %iterArg_42, %c_2 : tensor<i32> loc(#loc544)
      stablehlo.return %iterArg, %iterArg_30, %iterArg_31, %iterArg_32, %iterArg_33, %iterArg_34, %iterArg_35, %iterArg_36, %iterArg_37, %iterArg_38, %iterArg_39, %iterArg_40, %iterArg_41, %179, %177#0, %178 : tensor<1x64x32xf32>, tensor<1x64xi1>, tensor<64x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<i32>, tensor<64x32xf32>, tensor<1x64x32xf32> loc(#loc539)
    } loc(#loc539)
    %124 = stablehlo.transpose %123#15, dims = [1, 0, 2] : (tensor<1x64x32xf32>) -> tensor<64x1x32xf32> loc(#loc559)
    %125 = call @_threefry_fold_in(%4, %c_1) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc468)
    %126 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc432)
    %127 = stablehlo.divide %126, %cst_20 : tensor<f32> loc(#loc433)
    %128 = call @_truncated_normal_29(%125, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x16xf32> loc(#loc434)
    %129 = stablehlo.broadcast_in_dim %127, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc435)
    %130 = stablehlo.multiply %128, %129 : tensor<32x16xf32> loc(#loc435)
    %131 = stablehlo.dot_general %124, %130, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x16xf32>) -> tensor<64x1x16xf32> loc(#loc436)
    %132 = call @_where_34(%41, %131, %cst) : (tensor<64x1x16xi1>, tensor<64x1x16xf32>, tensor<f32>) -> tensor<64x1x16xf32> loc(#loc376)
    %133 = call @_threefry_fold_in(%4, %c_0) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc469)
    %134 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc438)
    %135 = stablehlo.divide %134, %cst_20 : tensor<f32> loc(#loc439)
    %136 = call @_truncated_normal_35(%133, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x1xf32> loc(#loc440)
    %137 = stablehlo.broadcast_in_dim %135, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc441)
    %138 = stablehlo.multiply %136, %137 : tensor<32x1xf32> loc(#loc441)
    %139 = call @_threefry_fold_in(%4, %c) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc470)
    %140 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc443)
    %141 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc560)
    %142 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc560)
    %143 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc560)
    %144 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc560)
    %145 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc560)
    %146 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc560)
    %147 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc560)
    %148 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc560)
    %149 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc560)
    %150 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc560)
    %151 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc560)
    %152 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc560)
    %153 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc560)
    %154 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc560)
    %155 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc560)
    %156 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc560)
    %157 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc560)
    %158 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc561)
    %159 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc561)
    %160 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc561)
    %161 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc561)
    %162 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc561)
    %163 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc561)
    %164 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc561)
    %165 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc561)
    %166 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc561)
    %167 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc561)
    %168 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc561)
    %169 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc561)
    %170 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc561)
    %171 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc561)
    %172 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc561)
    %173 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc561)
    %174 = stablehlo.broadcast_in_dim %cst_24, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc561)
    return %c_28, %31, %32, %33, %34, %35, %36, %37, %38, %39, %21, %27, %28, %29, %30, %40, %130, %140, %138, %54, %52, %69, %67, %121, %119, %91, %105, %113, %111, %85, %83, %99, %97, %c_28, %141, %142, %143, %144, %145, %146, %147, %148, %149, %150, %151, %152, %153, %154, %155, %156, %157, %158, %159, %160, %161, %162, %163, %164, %165, %166, %167, %168, %169, %170, %171, %172, %173, %174 : tensor<i32>, tensor<64x16xi1>, tensor<64x15xf32>, tensor<64xi32>, tensor<64xf32>, tensor<64xi1>, tensor<64xi1>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64x5xi32>, tensor<64x5xi32>, tensor<64xi1>, tensor<64xi32>, tensor<64xi1>, tensor<64x32xf32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<i32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32>, tensor<32xf32>, tensor<32x32xf32> loc(#loc248)
  } loc(#loc)
  func.func private @_threefry_split(%arg0: tensor<2xui32> loc(unknown)) -> tensor<3x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc237)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc237)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc238)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc239)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc238)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc239)
    %4 = stablehlo.iota dim = 0 : tensor<3xui64> loc(#loc237)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc237)
    %6 = stablehlo.multiply %5, %4 : tensor<3xui64> loc(#loc237)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc237)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<3xui64> loc(#loc237)
    %9 = stablehlo.convert %6 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc237)
    %10 = stablehlo.convert %8 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc237)
    %11:2 = call @threefry2x32(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<3xui32>, tensor<3xui32>) -> (tensor<3xui32>, tensor<3xui32>) loc(#loc139)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc240)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc240)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<3x1xui32>, tensor<3x1xui32>) -> tensor<3x2xui32> loc(#loc240)
    return %14 : tensor<3x2xui32> loc(#loc)
  } loc(#loc259)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg1: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg2: tensor<3xui32> loc("RecurrentPPO.init"(#loc4)), %arg3: tensor<3xui32> loc("RecurrentPPO.init"(#loc4))) -> (tensor<3xui32>, tensor<3xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc213)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc213)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc213)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc241)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc241)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc242)
    %3 = stablehlo.add %arg2, %2 : tensor<3xui32> loc(#loc242)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc242)
    %5 = stablehlo.add %arg3, %4 : tensor<3xui32> loc(#loc242)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc309)
      stablehlo.return %7 : tensor<i1> loc(#loc260)
    } do {
      %7:8 = func.call @closed_call(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc310)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc311)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc260)
    } loc(#loc260)
    return %6#2, %6#3 : tensor<3xui32>, tensor<3xui32> loc(#loc139)
  } loc(#loc139)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<3xui32> loc(unknown), %arg2: tensor<3xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc79)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %3 = stablehlo.add %arg1, %arg2 : tensor<3xui32> loc(#loc79)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<3xui32> loc(#loc82)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc83)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc84)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<3xui32> loc(#loc84)
    %9 = stablehlo.or %5, %8 : tensor<3xui32> loc(#loc85)
    %10 = stablehlo.xor %3, %9 : tensor<3xui32> loc(#loc86)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %13 = stablehlo.add %3, %10 : tensor<3xui32> loc(#loc79)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %15 = stablehlo.shift_left %10, %14 : tensor<3xui32> loc(#loc82)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc83)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc84)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<3xui32> loc(#loc84)
    %19 = stablehlo.or %15, %18 : tensor<3xui32> loc(#loc85)
    %20 = stablehlo.xor %13, %19 : tensor<3xui32> loc(#loc86)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %23 = stablehlo.add %13, %20 : tensor<3xui32> loc(#loc79)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %25 = stablehlo.shift_left %20, %24 : tensor<3xui32> loc(#loc82)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc83)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc84)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<3xui32> loc(#loc84)
    %29 = stablehlo.or %25, %28 : tensor<3xui32> loc(#loc85)
    %30 = stablehlo.xor %23, %29 : tensor<3xui32> loc(#loc86)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %33 = stablehlo.add %23, %30 : tensor<3xui32> loc(#loc79)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc82)
    %35 = stablehlo.shift_left %30, %34 : tensor<3xui32> loc(#loc82)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc83)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc84)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<3xui32> loc(#loc84)
    %39 = stablehlo.or %35, %38 : tensor<3xui32> loc(#loc85)
    %40 = stablehlo.xor %33, %39 : tensor<3xui32> loc(#loc86)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc79)
    %42 = stablehlo.add %33, %41 : tensor<3xui32> loc(#loc79)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc79)
    %44 = stablehlo.add %40, %43 : tensor<3xui32> loc(#loc79)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc79)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc87)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc79)
    %48 = stablehlo.add %44, %47 : tensor<3xui32> loc(#loc79)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc262)
  func.func private @_threefry_split_0(%arg0: tensor<2xui32> loc(unknown)) -> tensor<64x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc264)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc264)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc265)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc266)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc265)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc266)
    %4 = stablehlo.iota dim = 0 : tensor<64xui64> loc(#loc264)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<64xui64> loc(#loc264)
    %6 = stablehlo.multiply %5, %4 : tensor<64xui64> loc(#loc264)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<64xui64> loc(#loc264)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<64xui64> loc(#loc264)
    %9 = stablehlo.convert %6 : (tensor<64xui64>) -> tensor<64xui32> loc(#loc264)
    %10 = stablehlo.convert %8 : (tensor<64xui64>) -> tensor<64xui32> loc(#loc264)
    %11:2 = call @threefry2x32_1(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<64xui32>, tensor<64xui32>) -> (tensor<64xui32>, tensor<64xui32>) loc(#loc245)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc267)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc267)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<64x1xui32>, tensor<64x1xui32>) -> tensor<64x2xui32> loc(#loc267)
    return %14 : tensor<64x2xui32> loc(#loc)
  } loc(#loc312)
  func.func private @threefry2x32_1(%arg0: tensor<ui32> loc(callsite(#loc214 at #loc215)), %arg1: tensor<ui32> loc(callsite(#loc214 at #loc215)), %arg2: tensor<64xui32> loc(callsite(#loc214 at #loc215)), %arg3: tensor<64xui32> loc(callsite(#loc214 at #loc215))) -> (tensor<64xui32>, tensor<64xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc213)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc213)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc213)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc268)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc268)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc269)
    %3 = stablehlo.add %arg2, %2 : tensor<64xui32> loc(#loc269)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc269)
    %5 = stablehlo.add %arg3, %4 : tensor<64xui32> loc(#loc269)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc380)
      stablehlo.return %7 : tensor<i1> loc(#loc313)
    } do {
      %7:8 = func.call @closed_call_2(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc381)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc382)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc313)
    } loc(#loc313)
    return %6#2, %6#3 : tensor<64xui32>, tensor<64xui32> loc(#loc245)
  } loc(#loc245)
  func.func private @closed_call_2(%arg0: tensor<i32> loc(unknown), %arg1: tensor<64xui32> loc(unknown), %arg2: tensor<64xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc79)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %3 = stablehlo.add %arg1, %arg2 : tensor<64xui32> loc(#loc79)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<64xui32> loc(#loc82)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc83)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc84)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<64xui32> loc(#loc84)
    %9 = stablehlo.or %5, %8 : tensor<64xui32> loc(#loc85)
    %10 = stablehlo.xor %3, %9 : tensor<64xui32> loc(#loc86)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %13 = stablehlo.add %3, %10 : tensor<64xui32> loc(#loc79)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %15 = stablehlo.shift_left %10, %14 : tensor<64xui32> loc(#loc82)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc83)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc84)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<64xui32> loc(#loc84)
    %19 = stablehlo.or %15, %18 : tensor<64xui32> loc(#loc85)
    %20 = stablehlo.xor %13, %19 : tensor<64xui32> loc(#loc86)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %23 = stablehlo.add %13, %20 : tensor<64xui32> loc(#loc79)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %25 = stablehlo.shift_left %20, %24 : tensor<64xui32> loc(#loc82)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc83)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc84)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<64xui32> loc(#loc84)
    %29 = stablehlo.or %25, %28 : tensor<64xui32> loc(#loc85)
    %30 = stablehlo.xor %23, %29 : tensor<64xui32> loc(#loc86)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc80)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc81)
    %33 = stablehlo.add %23, %30 : tensor<64xui32> loc(#loc79)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc82)
    %35 = stablehlo.shift_left %30, %34 : tensor<64xui32> loc(#loc82)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc83)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc84)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<64xui32> loc(#loc84)
    %39 = stablehlo.or %35, %38 : tensor<64xui32> loc(#loc85)
    %40 = stablehlo.xor %33, %39 : tensor<64xui32> loc(#loc86)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc79)
    %42 = stablehlo.add %33, %41 : tensor<64xui32> loc(#loc79)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc79)
    %44 = stablehlo.add %40, %43 : tensor<64xui32> loc(#loc79)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc79)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc87)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc79)
    %48 = stablehlo.add %44, %47 : tensor<64xui32> loc(#loc79)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc315)
  func.func private @_randint(%arg0: tensor<64x2xui32> loc(unknown), %arg1: tensor<i32> loc(unknown), %arg2: tensor<i32> loc(unknown)) -> tensor<64xi32> {
    %c = stablehlo.constant dense<65536> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<ui32> loc(#loc)
