#loc = loc(unknown)
#loc1 = loc("key")
#loc4 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":298:50 to :74)
#loc33 = loc("/Users/noahfarr/reinforcement-learning/.venv/lib/python3.13/site-packages/flax/linen/linear.py":1166:21 to 1171:5)
#loc34 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":84:32 to :49)
#loc35 = loc("/Users/noahfarr/reinforcement-learning/src/networks/networks/network.py":24:12 to :71)
#loc36 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":307:17 to 314:9)
#loc45 = loc("scatter")
#loc95 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":268:20 to :66)
#loc96 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":192:23 to :63)
#loc102 = loc("vmap()")
#loc133 = loc("erf")
#loc152 = loc("RecurrentPPO.init"(#loc4))
#loc181 = loc("Embed.setup"(#loc33))
#loc182 = loc("TokenFeatureExtractor.__call__"(#loc34))
#loc183 = loc("Network.__call__"(#loc35))
#loc184 = loc("RecurrentPPO.init"(#loc36))
#loc193 = loc("scatter:"(#loc45))
#loc234 = loc("RecurrentPPO.update_step"(#loc95))
#loc235 = loc("main.<locals>.train_step"(#loc96))
#loc254 = loc(callsite(#loc183 at #loc184))
#loc265 = loc(callsite(#loc234 at #loc235))
#loc275 = loc(callsite(#loc182 at #loc254))
#loc319 = loc(callsite(#loc181 at #loc275))
module @jit_init attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key")) -> (tensor<i32> {jax.result_info = "result.step"}, tensor<16x5xi32> {jax.result_info = "result.timestep.obs"}, tensor<16xi32> {jax.result_info = "result.timestep.action"}, tensor<16xf32> {jax.result_info = "result.timestep.reward"}, tensor<16xi1> {jax.result_info = "result.timestep.terminated"}, tensor<16xi1> {jax.result_info = "result.timestep.truncated"}, tensor<16xf32> {jax.result_info = "result.timestep.info['fired']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['guess_count']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['illegal_guesses']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['matched_secret']"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.env_state.secret_answer"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.env_state.guess_feedback"}, tensor<16xi1> {jax.result_info = "result.environment_state.env_state.guess_revealed"}, tensor<16xi32> {jax.result_info = "result.environment_state.env_state.guess_count"}, tensor<16xi1> {jax.result_info = "result.environment_state.env_state.matched_secret"}, tensor<16xi1> {jax.result_info = "result.environment_state.active"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.arguments"}, tensor<16xi32> {jax.result_info = "result.environment_state.cursor"}, tensor<16x16xf32> {jax.result_info = "result.carry[1]"}, tensor<33x16xf32> {jax.result_info = "result.params['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.params['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.params['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.params['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['hn']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['hn']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['hr']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['hz']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['in']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['in']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['ir']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['ir']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['iz']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['cell']['iz']['kernel']"}, tensor<i32> {jax.result_info = "result.optimizer_state[1][0].count"}, tensor<33x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['hn']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['hn']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['hr']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['hz']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['in']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['in']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['ir']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['ir']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['iz']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['cell']['iz']['kernel']"}, tensor<33x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['hn']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['hn']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['hr']['kernel']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['hz']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['in']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['in']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['ir']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['ir']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['iz']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['cell']['iz']['kernel']"}) {
    %c = stablehlo.constant dense<3309781136> : tensor<ui32> loc(#loc268)
    %c_0 = stablehlo.constant dense<1632372854> : tensor<ui32> loc(#loc268)
    %c_1 = stablehlo.constant dense<2875902972> : tensor<ui32> loc(#loc268)
    %c_2 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_3 = stablehlo.constant dense<6> : tensor<i32> loc(#loc)
    %c_4 = stablehlo.constant dense<2048461400> : tensor<ui32> loc(#loc268)
    %c_5 = stablehlo.constant dense<2218040706> : tensor<ui32> loc(#loc268)
    %c_6 = stablehlo.constant dense<844053399> : tensor<ui32> loc(#loc268)
    %c_7 = stablehlo.constant dense<2202832691> : tensor<ui32> loc(#loc268)
    %c_8 = stablehlo.constant dense<1572179623> : tensor<ui32> loc(#loc268)
    %c_9 = stablehlo.constant dense<2146539145> : tensor<ui32> loc(#loc268)
    %c_10 = stablehlo.constant dense<2821373726> : tensor<ui32> loc(#loc268)
    %c_11 = stablehlo.constant dense<2511747036> : tensor<ui32> loc(#loc268)
    %c_12 = stablehlo.constant dense<3515350182> : tensor<ui32> loc(#loc268)
    %c_13 = stablehlo.constant dense<111433393> : tensor<ui32> loc(#loc268)
    %c_14 = stablehlo.constant dense<3763648675> : tensor<ui32> loc(#loc268)
    %c_15 = stablehlo.constant dense<2> : tensor<i32> loc(#loc)
    %c_16 = stablehlo.constant dense<-2> : tensor<i32> loc(#loc)
    %cst = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %c_17 = stablehlo.constant dense<1591842985> : tensor<ui32> loc(#loc268)
    %cst_18 = stablehlo.constant dense<6.250000e-02> : tensor<f32> loc(#loc)
    %c_19 = stablehlo.constant dense<3005692971> : tensor<ui32> loc(#loc268)
    %c_20 = stablehlo.constant dense<true> : tensor<i1> loc(#loc268)
    %c_21 = stablehlo.constant dense<28> : tensor<i32> loc(#loc268)
    %cst_22 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c_23 = stablehlo.constant dense<false> : tensor<i1> loc(#loc)
    %c_24 = stablehlo.constant dense<5> : tensor<i32> loc(#loc268)
    %c_25 = stablehlo.constant dense<16> : tensor<i32> loc(#loc)
    %c_26 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_27 = stablehlo.constant dense<[[0, 20, 3, 8, 14], [1, 17, 8, 2, 10], [2, 7, 0, 8, 17], [2, 11, 14, 20, 3], [2, 17, 0, 13, 4], [5, 11, 8, 13, 19], [5, 17, 14, 18, 19], [6, 11, 0, 25, 4], [6, 17, 0, 15, 4], [7, 14, 20, 18, 4], [11, 4, 12, 14, 13], [12, 14, 20, 13, 3], [15, 11, 0, 13, 19], [18, 11, 0, 19, 4], [18, 15, 0, 3, 4], [18, 19, 14, 17, 12]]> : tensor<16x5xi32> loc(#loc268)
    %0 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<3x2xui32> loc(#loc359)
    %1 = stablehlo.slice %0 [0:1, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc311)
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc312)
    %3 = stablehlo.slice %0 [1:2, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc311)
    %4 = stablehlo.reshape %3 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc312)
    %5 = call @_threefry_split_0(%2) : (tensor<2xui32>) -> tensor<16x2xui32> loc(#loc421)
    %6 = stablehlo.broadcast_in_dim %5, dims = [0, 2] : (tensor<16x2xui32>) -> tensor<16x1x2xui32> loc(#loc361)
    %7 = stablehlo.reshape %6 : (tensor<16x1x2xui32>) -> tensor<16x2xui32> loc(#loc362)
    %8 = call @_randint(%7, %c_26, %c_25) : (tensor<16x2xui32>, tensor<i32>, tensor<i32>) -> tensor<16xi32> loc(#loc485)
    %9 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc486)
    %10 = stablehlo.compare LT, %8, %9, SIGNED : (tensor<16xi32>, tensor<16xi32>) -> tensor<16xi1> loc(#loc486)
    %11 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc487)
    %12 = stablehlo.add %8, %11 : tensor<16xi32> loc(#loc487)
    %13 = stablehlo.select %10, %12, %8 : tensor<16xi1>, tensor<16xi32> loc(#loc488)
    %14 = stablehlo.compare LT, %c_26, %c_26, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc486)
    %15 = stablehlo.add %c_26, %c_24 : tensor<i32> loc(#loc487)
    %16 = stablehlo.select %14, %15, %c_26 : tensor<i1>, tensor<i32> loc(#loc488)
    %17 = stablehlo.broadcast_in_dim %13, dims = [0] : (tensor<16xi32>) -> tensor<16x1xi32> loc(#loc489)
    %18 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<i32>) -> tensor<16x1xi32> loc(#loc489)
    %19 = stablehlo.concatenate %17, %18, dim = 1 : (tensor<16x1xi32>, tensor<16x1xi32>) -> tensor<16x2xi32> loc(#loc490)
    %20 = "stablehlo.gather"(%c_27, %19) <{dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 5>}> : (tensor<16x5xi32>, tensor<16x2xi32>) -> tensor<16x1x5xi32> loc(#loc491)
    %21 = stablehlo.reshape %20 : (tensor<16x1x5xi32>) -> tensor<16x5xi32> loc(#loc492)
    %22 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc493)
    %23 = call @_one_hot(%22) : (tensor<5xi32>) -> tensor<5x3xf32> loc(#loc517)
    %24 = stablehlo.reshape %23 : (tensor<5x3xf32>) -> tensor<15xf32> loc(#loc518)
    %25 = call @_where(%c_23, %24, %cst_22) : (tensor<i1>, tensor<15xf32>, tensor<f32>) -> tensor<15xf32> loc(#loc519)
    %26 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc453)
    %27 = stablehlo.broadcast_in_dim %c_21, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc454)
    %28 = stablehlo.broadcast_in_dim %22, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc364)
    %29 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc364)
    %30 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc364)
    %31 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc364)
    %32 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc364)
    %33 = stablehlo.broadcast_in_dim %26, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc364)
    %34 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc364)
    %35 = stablehlo.broadcast_in_dim %27, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc364)
    %36 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc364)
    %37 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc364)
    %38 = stablehlo.broadcast_in_dim %c_20, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc364)
    %39 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc364)
    %40 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc364)
    %41 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc364)
    %42 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc364)
    %43 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc364)
    %44 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc538)
    %45 = stablehlo.broadcast_in_dim %35, dims = [0, 2] : (tensor<16x5xi32>) -> tensor<16x1x5xi32> loc(#loc426)
    %46 = stablehlo.broadcast_in_dim %36, dims = [0] : (tensor<16xi32>) -> tensor<16x1xi32> loc(#loc426)
    %47 = stablehlo.broadcast_in_dim %38, dims = [0] : (tensor<16xi1>) -> tensor<16x1xi1> loc(#loc426)
    %48 = stablehlo.broadcast_in_dim %39, dims = [0] : (tensor<16xi1>) -> tensor<16x1xi1> loc(#loc426)
    %49 = stablehlo.or %47, %48 : tensor<16x1xi1> loc(#loc367)
    %50 = call @_threefry_fold_in(%4, %c_19) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc498)
    %51 = call @_normal(%50) : (tensor<2xui32>) -> tensor<33x16xf32> loc(#loc457)
    %52 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc458)
    %53 = stablehlo.broadcast_in_dim %52, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc459)
    %54 = stablehlo.multiply %51, %53 : tensor<33x16xf32> loc(#loc459)
    %55 = call @_take(%54, %46) : (tensor<33x16xf32>, tensor<16x1xi32>) -> tensor<16x1x16xf32> loc(#loc460)
    %56 = stablehlo.broadcast_in_dim %55, dims = [0, 1, 3] : (tensor<16x1x16xf32>) -> tensor<16x1x1x16xf32> loc(#loc429)
    %57 = call @_take_14(%54, %45) : (tensor<33x16xf32>, tensor<16x1x5xi32>) -> tensor<16x1x5x16xf32> loc(#loc461)
    %58 = stablehlo.concatenate %56, %57, dim = 2 : (tensor<16x1x1x16xf32>, tensor<16x1x5x16xf32>) -> tensor<16x1x6x16xf32> loc(#loc431)
    %59 = stablehlo.reshape %58 : (tensor<16x1x6x16xf32>) -> tensor<16x6x16xf32> loc(#loc432)
    %60 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i1>) -> tensor<16x1x6xi1> loc(#loc433)
    %61 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc434)
    %62 = "stablehlo.scatter"(%60, %61, %49) <{indices_are_sorted = true, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 1], inserted_window_dims = [2], scatter_dims_to_operand_dims = [2]>, unique_indices = true}> ({
    ^bb0(%arg1: tensor<i1> loc("scatter:"(#loc45)), %arg2: tensor<i1> loc("scatter:"(#loc45))):
      stablehlo.return %arg2 : tensor<i1> loc(#loc435)
    }) : (tensor<16x1x6xi1>, tensor<1xi32>, tensor<16x1xi1>) -> tensor<16x1x6xi1> loc(#loc435)
    %63 = stablehlo.reshape %62 : (tensor<16x1x6xi1>) -> tensor<16x6xi1> loc(#loc436)
    %64 = call @_threefry_fold_in(%4, %c_17) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc559)
    %65 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc540)
    %66 = stablehlo.divide %65, %cst : tensor<f32> loc(#loc541)
    %67 = call @_truncated_normal(%64, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc542)
    %68 = stablehlo.broadcast_in_dim %66, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc543)
    %69 = stablehlo.multiply %67, %68 : tensor<16x16xf32> loc(#loc543)
    %70 = call @_threefry_fold_in(%4, %c_14) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc560)
    %71 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc545)
    %72 = stablehlo.dot_general %59, %69, contracting_dims = [2] x [0] : (tensor<16x6x16xf32>, tensor<16x16xf32>) -> tensor<16x6x16xf32> loc(#loc546)
    %73 = stablehlo.reshape %71 : (tensor<16xf32>) -> tensor<1x1x16xf32> loc(#loc547)
    %74 = stablehlo.broadcast_in_dim %73, dims = [0, 1, 2] : (tensor<1x1x16xf32>) -> tensor<16x6x16xf32> loc(#loc548)
    %75 = stablehlo.add %72, %74 : tensor<16x6x16xf32> loc(#loc548)
    %76 = call @relu(%75) : (tensor<16x6x16xf32>) -> tensor<16x6x16xf32> loc(#loc526)
    %77 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc549)
    %78 = stablehlo.transpose %76, dims = [1, 0, 2] : (tensor<16x6x16xf32>) -> tensor<6x16x16xf32> loc(#loc574)
    %79 = stablehlo.transpose %63, dims = [1, 0] : (tensor<16x6xi1>) -> tensor<6x16xi1> loc(#loc574)
    call @_where_20(%77) : (tensor<16x16xf32>) -> () loc(#loc593)
    %80 = call @_threefry_fold_in(%4, %c_13) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc634)
    %81 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc595)
    %82 = stablehlo.divide %81, %cst : tensor<f32> loc(#loc596)
    %83 = call @_truncated_normal_21(%80, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc597)
    %84 = stablehlo.broadcast_in_dim %82, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc598)
    %85 = stablehlo.multiply %83, %84 : tensor<16x16xf32> loc(#loc598)
    %86 = call @_threefry_fold_in(%4, %c_12) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc635)
    %87 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc600)
    %88 = call @_threefry_fold_in(%4, %c_11) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc636)
    %89 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc602)
    %90 = stablehlo.divide %89, %cst : tensor<f32> loc(#loc603)
    %91 = call @_truncated_normal_21(%88, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc604)
    %92 = stablehlo.broadcast_in_dim %90, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc605)
    %93 = stablehlo.multiply %91, %92 : tensor<16x16xf32> loc(#loc605)
    %94 = call @_threefry_fold_in(%4, %c_10) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc637)
    %95 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc607)
    %96 = stablehlo.divide %95, %cst : tensor<f32> loc(#loc608)
    %97 = call @_truncated_normal_21(%94, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc609)
    %98 = stablehlo.broadcast_in_dim %96, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc610)
    %99 = stablehlo.multiply %97, %98 : tensor<16x16xf32> loc(#loc610)
    %100 = call @_threefry_fold_in(%4, %c_9) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc638)
    %101 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc612)
    %102 = call @_threefry_fold_in(%4, %c_8) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc639)
    %103 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc614)
    %104 = stablehlo.divide %103, %cst : tensor<f32> loc(#loc615)
    %105 = call @_truncated_normal_21(%102, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc616)
    %106 = stablehlo.broadcast_in_dim %104, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc617)
    %107 = stablehlo.multiply %105, %106 : tensor<16x16xf32> loc(#loc617)
    %108 = call @_threefry_fold_in(%4, %c_7) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc640)
    %109 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc619)
    %110 = stablehlo.divide %109, %cst : tensor<f32> loc(#loc620)
    %111 = call @_truncated_normal_21(%108, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc621)
    %112 = stablehlo.broadcast_in_dim %110, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc622)
    %113 = stablehlo.multiply %111, %112 : tensor<16x16xf32> loc(#loc622)
    %114 = call @_threefry_fold_in(%4, %c_6) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc641)
    %115 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc624)
    %116 = call @_threefry_fold_in(%4, %c_5) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc642)
    %117 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc626)
    %118 = stablehlo.divide %117, %cst : tensor<f32> loc(#loc627)
    %119 = call @_truncated_normal_21(%116, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc628)
    %120 = stablehlo.broadcast_in_dim %118, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc629)
    %121 = stablehlo.multiply %119, %120 : tensor<16x16xf32> loc(#loc629)
    %122 = call @_threefry_fold_in(%4, %c_4) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc643)
    %123 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc631)
    %124 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<6x16x16xf32> loc(#loc564)
    %125:16 = stablehlo.while(%iterArg = %78, %iterArg_28 = %79, %iterArg_29 = %77, %iterArg_30 = %85, %iterArg_31 = %87, %iterArg_32 = %93, %iterArg_33 = %99, %iterArg_34 = %101, %iterArg_35 = %107, %iterArg_36 = %113, %iterArg_37 = %115, %iterArg_38 = %121, %iterArg_39 = %123, %iterArg_40 = %c_26, %iterArg_41 = %44, %iterArg_42 = %124) : tensor<6x16x16xf32>, tensor<6x16xi1>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<i32>, tensor<16x16xf32>, tensor<6x16x16xf32>
    cond {
      %172 = stablehlo.compare LT, %iterArg_40, %c_3, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc566)
      stablehlo.return %172 : tensor<i1> loc(#loc565)
    } do {
      %172 = func.call @dynamic_index_in_dim(%iterArg, %iterArg_40) : (tensor<6x16x16xf32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc567)
      %173 = func.call @dynamic_index_in_dim_24(%iterArg_28, %iterArg_40) : (tensor<6x16xi1>, tensor<i32>) -> tensor<16xi1> loc(#loc567)
      %174:2 = func.call @closed_call_25(%iterArg_29, %iterArg_30, %iterArg_31, %iterArg_32, %iterArg_33, %iterArg_34, %iterArg_35, %iterArg_36, %iterArg_37, %iterArg_38, %iterArg_39, %iterArg_41, %172, %173) : (tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xi1>) -> (tensor<16x16xf32>, tensor<16x16xf32>) loc(#loc568)
      %175 = func.call @dynamic_update_index_in_dim(%iterArg_42, %174#1, %iterArg_40) : (tensor<6x16x16xf32>, tensor<16x16xf32>, tensor<i32>) -> tensor<6x16x16xf32> loc(#loc569)
      %176 = stablehlo.add %iterArg_40, %c_2 : tensor<i32> loc(#loc570)
      stablehlo.return %iterArg, %iterArg_28, %iterArg_29, %iterArg_30, %iterArg_31, %iterArg_32, %iterArg_33, %iterArg_34, %iterArg_35, %iterArg_36, %iterArg_37, %iterArg_38, %iterArg_39, %176, %174#0, %175 : tensor<6x16x16xf32>, tensor<6x16xi1>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<i32>, tensor<16x16xf32>, tensor<6x16x16xf32> loc(#loc565)
    } loc(#loc565)
    %126 = call @_threefry_fold_in(%4, %c_1) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc504)
    %127 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc465)
    %128 = stablehlo.divide %127, %cst : tensor<f32> loc(#loc466)
    %129 = call @_truncated_normal_27(%126, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x33xf32> loc(#loc467)
    %130 = stablehlo.broadcast_in_dim %128, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc468)
    %131 = stablehlo.multiply %129, %130 : tensor<16x33xf32> loc(#loc468)
    %132 = call @_threefry_fold_in(%4, %c_0) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc505)
    %133 = stablehlo.sqrt %cst_18 : tensor<f32> loc(#loc470)
    %134 = stablehlo.divide %133, %cst : tensor<f32> loc(#loc471)
    %135 = call @_truncated_normal_32(%132, %c_16, %c_15) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x1xf32> loc(#loc472)
    %136 = stablehlo.broadcast_in_dim %134, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc473)
    %137 = stablehlo.multiply %135, %136 : tensor<16x1xf32> loc(#loc473)
    %138 = call @_threefry_fold_in(%4, %c) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc506)
    %139 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc475)
    %140 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc571)
    %141 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc571)
    %142 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc571)
    %143 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc571)
    %144 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc571)
    %145 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc571)
    %146 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc571)
    %147 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc571)
    %148 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc571)
    %149 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc571)
    %150 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc571)
    %151 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc571)
    %152 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc571)
    %153 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc571)
    %154 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc571)
    %155 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc571)
    %156 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc572)
    %157 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc572)
    %158 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc572)
    %159 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc572)
    %160 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc572)
    %161 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc572)
    %162 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc572)
    %163 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc572)
    %164 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc572)
    %165 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc572)
    %166 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc572)
    %167 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc572)
    %168 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc572)
    %169 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc572)
    %170 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc572)
    %171 = stablehlo.broadcast_in_dim %cst_22, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc572)
    return %c_26, %35, %36, %37, %38, %39, %40, %41, %42, %43, %21, %28, %29, %30, %31, %32, %33, %34, %44, %54, %131, %139, %137, %71, %69, %123, %121, %93, %107, %115, %113, %87, %85, %101, %99, %c_26, %140, %141, %142, %143, %144, %145, %146, %147, %148, %149, %150, %151, %152, %153, %154, %155, %156, %157, %158, %159, %160, %161, %162, %163, %164, %165, %166, %167, %168, %169, %170, %171 : tensor<i32>, tensor<16x5xi32>, tensor<16xi32>, tensor<16xf32>, tensor<16xi1>, tensor<16xi1>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16x5xi32>, tensor<16x5xi32>, tensor<16xi1>, tensor<16xi32>, tensor<16xi1>, tensor<16xi1>, tensor<16x5xi32>, tensor<16xi32>, tensor<16x16xf32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<i32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<16xf32>, tensor<16x16xf32> loc(#loc268)
  } loc(#loc)
  func.func private @_threefry_split(%arg0: tensor<2xui32> loc(unknown)) -> tensor<3x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc257)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc257)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc258)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc259)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc258)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc259)
    %4 = stablehlo.iota dim = 0 : tensor<3xui64> loc(#loc257)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc257)
    %6 = stablehlo.multiply %5, %4 : tensor<3xui64> loc(#loc257)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc257)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<3xui64> loc(#loc257)
    %9 = stablehlo.convert %6 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc257)
    %10 = stablehlo.convert %8 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc257)
    %11:2 = call @threefry2x32(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<3xui32>, tensor<3xui32>) -> (tensor<3xui32>, tensor<3xui32>) loc(#loc152)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc260)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc260)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<3x1xui32>, tensor<3x1xui32>) -> tensor<3x2xui32> loc(#loc260)
    return %14 : tensor<3x2xui32> loc(#loc)
  } loc(#loc279)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg1: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg2: tensor<3xui32> loc("RecurrentPPO.init"(#loc4)), %arg3: tensor<3xui32> loc("RecurrentPPO.init"(#loc4))) -> (tensor<3xui32>, tensor<3xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc233)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc233)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc233)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc261)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc261)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc262)
    %3 = stablehlo.add %arg2, %2 : tensor<3xui32> loc(#loc262)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc262)
    %5 = stablehlo.add %arg3, %4 : tensor<3xui32> loc(#loc262)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc325)
      stablehlo.return %7 : tensor<i1> loc(#loc280)
    } do {
      %7:8 = func.call @closed_call(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc326)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc327)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc280)
    } loc(#loc280)
    return %6#2, %6#3 : tensor<3xui32>, tensor<3xui32> loc(#loc152)
  } loc(#loc152)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<3xui32> loc(unknown), %arg2: tensor<3xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc86)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %3 = stablehlo.add %arg1, %arg2 : tensor<3xui32> loc(#loc86)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc89)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<3xui32> loc(#loc89)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc90)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc91)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<3xui32> loc(#loc91)
    %9 = stablehlo.or %5, %8 : tensor<3xui32> loc(#loc92)
    %10 = stablehlo.xor %3, %9 : tensor<3xui32> loc(#loc93)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %13 = stablehlo.add %3, %10 : tensor<3xui32> loc(#loc86)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc89)
    %15 = stablehlo.shift_left %10, %14 : tensor<3xui32> loc(#loc89)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc90)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc91)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<3xui32> loc(#loc91)
    %19 = stablehlo.or %15, %18 : tensor<3xui32> loc(#loc92)
    %20 = stablehlo.xor %13, %19 : tensor<3xui32> loc(#loc93)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %23 = stablehlo.add %13, %20 : tensor<3xui32> loc(#loc86)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc89)
    %25 = stablehlo.shift_left %20, %24 : tensor<3xui32> loc(#loc89)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc90)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc91)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<3xui32> loc(#loc91)
    %29 = stablehlo.or %25, %28 : tensor<3xui32> loc(#loc92)
    %30 = stablehlo.xor %23, %29 : tensor<3xui32> loc(#loc93)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %33 = stablehlo.add %23, %30 : tensor<3xui32> loc(#loc86)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc89)
    %35 = stablehlo.shift_left %30, %34 : tensor<3xui32> loc(#loc89)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc90)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc91)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<3xui32> loc(#loc91)
    %39 = stablehlo.or %35, %38 : tensor<3xui32> loc(#loc92)
    %40 = stablehlo.xor %33, %39 : tensor<3xui32> loc(#loc93)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc86)
    %42 = stablehlo.add %33, %41 : tensor<3xui32> loc(#loc86)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc86)
    %44 = stablehlo.add %40, %43 : tensor<3xui32> loc(#loc86)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc86)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc94)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc86)
    %48 = stablehlo.add %44, %47 : tensor<3xui32> loc(#loc86)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc282)
  func.func private @_threefry_split_0(%arg0: tensor<2xui32> loc(unknown)) -> tensor<16x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc284)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc284)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc285)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc286)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc285)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc286)
    %4 = stablehlo.iota dim = 0 : tensor<16xui64> loc(#loc284)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<16xui64> loc(#loc284)
    %6 = stablehlo.multiply %5, %4 : tensor<16xui64> loc(#loc284)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<16xui64> loc(#loc284)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<16xui64> loc(#loc284)
    %9 = stablehlo.convert %6 : (tensor<16xui64>) -> tensor<16xui32> loc(#loc284)
    %10 = stablehlo.convert %8 : (tensor<16xui64>) -> tensor<16xui32> loc(#loc284)
    %11:2 = call @threefry2x32_1(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<16xui32>, tensor<16xui32>) -> (tensor<16xui32>, tensor<16xui32>) loc(#loc265)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<16xui32>) -> tensor<16x1xui32> loc(#loc287)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<16xui32>) -> tensor<16x1xui32> loc(#loc287)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<16x1xui32>, tensor<16x1xui32>) -> tensor<16x2xui32> loc(#loc287)
    return %14 : tensor<16x2xui32> loc(#loc)
  } loc(#loc328)
  func.func private @threefry2x32_1(%arg0: tensor<ui32> loc(callsite(#loc234 at #loc235)), %arg1: tensor<ui32> loc(callsite(#loc234 at #loc235)), %arg2: tensor<16xui32> loc(callsite(#loc234 at #loc235)), %arg3: tensor<16xui32> loc(callsite(#loc234 at #loc235))) -> (tensor<16xui32>, tensor<16xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc233)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc233)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc233)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc288)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc288)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc289)
    %3 = stablehlo.add %arg2, %2 : tensor<16xui32> loc(#loc289)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc289)
    %5 = stablehlo.add %arg3, %4 : tensor<16xui32> loc(#loc289)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc381)
      stablehlo.return %7 : tensor<i1> loc(#loc329)
    } do {
      %7:8 = func.call @closed_call_2(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc382)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc383)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc329)
    } loc(#loc329)
    return %6#2, %6#3 : tensor<16xui32>, tensor<16xui32> loc(#loc265)
  } loc(#loc265)
  func.func private @closed_call_2(%arg0: tensor<i32> loc(unknown), %arg1: tensor<16xui32> loc(unknown), %arg2: tensor<16xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc86)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %3 = stablehlo.add %arg1, %arg2 : tensor<16xui32> loc(#loc86)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc89)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<16xui32> loc(#loc89)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc90)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc91)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<16xui32> loc(#loc91)
    %9 = stablehlo.or %5, %8 : tensor<16xui32> loc(#loc92)
    %10 = stablehlo.xor %3, %9 : tensor<16xui32> loc(#loc93)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %13 = stablehlo.add %3, %10 : tensor<16xui32> loc(#loc86)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc89)
    %15 = stablehlo.shift_left %10, %14 : tensor<16xui32> loc(#loc89)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc90)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc91)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<16xui32> loc(#loc91)
    %19 = stablehlo.or %15, %18 : tensor<16xui32> loc(#loc92)
    %20 = stablehlo.xor %13, %19 : tensor<16xui32> loc(#loc93)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %23 = stablehlo.add %13, %20 : tensor<16xui32> loc(#loc86)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc89)
    %25 = stablehlo.shift_left %20, %24 : tensor<16xui32> loc(#loc89)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc90)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc91)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<16xui32> loc(#loc91)
    %29 = stablehlo.or %25, %28 : tensor<16xui32> loc(#loc92)
    %30 = stablehlo.xor %23, %29 : tensor<16xui32> loc(#loc93)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc87)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc88)
    %33 = stablehlo.add %23, %30 : tensor<16xui32> loc(#loc86)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc89)
    %35 = stablehlo.shift_left %30, %34 : tensor<16xui32> loc(#loc89)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc90)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc91)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<16xui32> loc(#loc91)
    %39 = stablehlo.or %35, %38 : tensor<16xui32> loc(#loc92)
    %40 = stablehlo.xor %33, %39 : tensor<16xui32> loc(#loc93)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc86)
    %42 = stablehlo.add %33, %41 : tensor<16xui32> loc(#loc86)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc86)
    %44 = stablehlo.add %40, %43 : tensor<16xui32> loc(#loc86)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc86)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc94)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc86)
    %48 = stablehlo.add %44, %47 : tensor<16xui32> loc(#loc86)
