#loc = loc(unknown)
#loc1 = loc("key")
#loc2 = loc("state.current_player")
#loc3 = loc("state.observation")
#loc4 = loc("state.rewards")
#loc5 = loc("state.terminated")
#loc6 = loc("state.truncated")
#loc7 = loc("state.legal_action_mask")
#loc8 = loc("state._step_count")
#loc9 = loc("state._x.color")
#loc10 = loc("state._x.board")
#loc11 = loc("state._x.winner")
#loc67 = loc("/home/farr/mcts/mcts/mcts.py":141:22 to :43)
#loc70 = loc("/home/farr/mcts/mcts/mcts.py":30:13 to :45)
#loc71 = loc("/home/farr/mcts/mcts/mcts.py":143:34 to :77)
#loc90 = loc("/home/farr/mcts/mcts/action_selection.py":35:11 to :29)
#loc116 = loc("scatter")
#loc213 = loc("reduce")
#loc259 = loc("search.<locals>.body_fun"(#loc67))
#loc262 = loc("selection"(#loc70))
#loc263 = loc("search.<locals>.body_fun"(#loc71))
#loc282 = loc("uct"(#loc90))
#loc308 = loc("scatter:"(#loc116))
#loc403 = loc("reduce:"(#loc213))
#loc410 = loc(callsite(#loc262 at #loc263))
#loc546 = loc(callsite(#loc282 at #loc410))
module @jit_pick_move attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key"), %arg1: tensor<i32> loc("state.current_player"), %arg2: tensor<3x3x2xi1> loc("state.observation"), %arg3: tensor<2xf32> loc("state.rewards"), %arg4: tensor<i1> loc("state.terminated"), %arg5: tensor<i1> loc("state.truncated"), %arg6: tensor<9xi1> loc("state.legal_action_mask"), %arg7: tensor<i32> loc("state._step_count"), %arg8: tensor<i32> loc("state._x.color"), %arg9: tensor<9xi32> loc("state._x.board"), %arg10: tensor<i32> loc("state._x.winner")) -> (tensor<i32> {jax.result_info = "result[0]"}, tensor<9xi32> {jax.result_info = "result[1]"}, tensor<401xf32> {jax.result_info = "result[2]"}, tensor<401xi32> {jax.result_info = "result[3]"}) {
    %cst = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc517)
    %c = stablehlo.constant dense<false> : tensor<i1> loc(#loc1114)
    %c_0 = stablehlo.constant dense<9> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<401> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<400> : tensor<i32> loc(#loc)
    %c_3 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %cst_4 = stablehlo.constant dense<5.000000e-01> : tensor<f32> loc(#loc517)
    %c_5 = stablehlo.constant dense<32> : tensor<i32> loc(#loc1115)
    %c_6 = stablehlo.constant dense<-1> : tensor<i32> loc(#loc)
    %cst_7 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c_8 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_9 = stablehlo.constant dense<[0, 1]> : tensor<2xi32> loc(#loc)
    %c_10 = stablehlo.constant dense<[1, 0]> : tensor<2xi32> loc(#loc)
    %cst_11 = stablehlo.constant dense<9.99999993E-9> : tensor<f32> loc(#loc517)
    %cst_12 = stablehlo.constant dense<1.41421354> : tensor<f32> loc(#loc517)
    %c_13 = stablehlo.constant dense<[[0, 1, 2], [3, 4, 5], [6, 7, 8], [0, 3, 6], [1, 4, 7], [2, 5, 8], [0, 4, 8], [2, 4, 6]]> : tensor<8x3xi32> loc(#loc)
    %cst_14 = stablehlo.constant dense<-1.000000e+00> : tensor<2xf32> loc(#loc)
    %c_15 = stablehlo.constant dense<true> : tensor<i1> loc(#loc517)
    %0 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc1116)
    %1 = stablehlo.broadcast_in_dim %0, dims = [0] : (tensor<1xi32>) -> tensor<1x401xi32> loc(#loc1117)
    %2 = stablehlo.reshape %1 : (tensor<1x401xi32>) -> tensor<401xi32> loc(#loc1118)
    %3 = stablehlo.broadcast_in_dim %arg2, dims = [1, 2, 3] : (tensor<3x3x2xi1>) -> tensor<1x3x3x2xi1> loc(#loc1116)
    %4 = stablehlo.broadcast_in_dim %3, dims = [0, 2, 3, 4] : (tensor<1x3x3x2xi1>) -> tensor<1x401x3x3x2xi1> loc(#loc1117)
    %5 = stablehlo.reshape %4 : (tensor<1x401x3x3x2xi1>) -> tensor<401x3x3x2xi1> loc(#loc1118)
    %6 = stablehlo.broadcast_in_dim %arg3, dims = [1] : (tensor<2xf32>) -> tensor<1x2xf32> loc(#loc1116)
    %7 = stablehlo.broadcast_in_dim %6, dims = [0, 2] : (tensor<1x2xf32>) -> tensor<1x401x2xf32> loc(#loc1117)
    %8 = stablehlo.reshape %7 : (tensor<1x401x2xf32>) -> tensor<401x2xf32> loc(#loc1118)
    %9 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<i1>) -> tensor<1xi1> loc(#loc1116)
    %10 = stablehlo.broadcast_in_dim %9, dims = [0] : (tensor<1xi1>) -> tensor<1x401xi1> loc(#loc1117)
    %11 = stablehlo.reshape %10 : (tensor<1x401xi1>) -> tensor<401xi1> loc(#loc1118)
    %12 = stablehlo.broadcast_in_dim %arg5, dims = [] : (tensor<i1>) -> tensor<1xi1> loc(#loc1116)
    %13 = stablehlo.broadcast_in_dim %12, dims = [0] : (tensor<1xi1>) -> tensor<1x401xi1> loc(#loc1117)
    %14 = stablehlo.reshape %13 : (tensor<1x401xi1>) -> tensor<401xi1> loc(#loc1118)
    %15 = stablehlo.broadcast_in_dim %arg6, dims = [1] : (tensor<9xi1>) -> tensor<1x9xi1> loc(#loc1116)
    %16 = stablehlo.broadcast_in_dim %15, dims = [0, 2] : (tensor<1x9xi1>) -> tensor<1x401x9xi1> loc(#loc1117)
    %17 = stablehlo.reshape %16 : (tensor<1x401x9xi1>) -> tensor<401x9xi1> loc(#loc1118)
    %18 = stablehlo.broadcast_in_dim %arg7, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc1116)
    %19 = stablehlo.broadcast_in_dim %18, dims = [0] : (tensor<1xi32>) -> tensor<1x401xi32> loc(#loc1117)
    %20 = stablehlo.reshape %19 : (tensor<1x401xi32>) -> tensor<401xi32> loc(#loc1118)
    %21 = stablehlo.broadcast_in_dim %arg8, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc1116)
    %22 = stablehlo.broadcast_in_dim %21, dims = [0] : (tensor<1xi32>) -> tensor<1x401xi32> loc(#loc1117)
    %23 = stablehlo.reshape %22 : (tensor<1x401xi32>) -> tensor<401xi32> loc(#loc1118)
    %24 = stablehlo.broadcast_in_dim %arg9, dims = [1] : (tensor<9xi32>) -> tensor<1x9xi32> loc(#loc1116)
    %25 = stablehlo.broadcast_in_dim %24, dims = [0, 2] : (tensor<1x9xi32>) -> tensor<1x401x9xi32> loc(#loc1117)
    %26 = stablehlo.reshape %25 : (tensor<1x401x9xi32>) -> tensor<401x9xi32> loc(#loc1118)
    %27 = stablehlo.broadcast_in_dim %arg10, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc1116)
    %28 = stablehlo.broadcast_in_dim %27, dims = [0] : (tensor<1xi32>) -> tensor<1x401xi32> loc(#loc1117)
    %29 = stablehlo.reshape %28 : (tensor<1x401xi32>) -> tensor<401xi32> loc(#loc1118)
    %30 = stablehlo.broadcast_in_dim %cst_7, dims = [] : (tensor<f32>) -> tensor<401xf32> loc(#loc970)
    %31 = stablehlo.broadcast_in_dim %cst_7, dims = [] : (tensor<f32>) -> tensor<401x2xf32> loc(#loc971)
    %32 = stablehlo.broadcast_in_dim %cst_7, dims = [] : (tensor<f32>) -> tensor<401x2xf32> loc(#loc972)
    %33 = stablehlo.broadcast_in_dim %c_6, dims = [] : (tensor<i32>) -> tensor<401xi32> loc(#loc973)
    %34 = stablehlo.broadcast_in_dim %c_6, dims = [] : (tensor<i32>) -> tensor<401xi32> loc(#loc974)
    %35 = stablehlo.shift_right_logical %c_8, %c_5 : tensor<i32> loc(#loc1265)
    %36 = stablehlo.convert %35 : (tensor<i32>) -> tensor<ui32> loc(#loc1266)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc1267)
    %38 = stablehlo.and %c_8, %c_6 : tensor<i32> loc(#loc1268)
    %39 = stablehlo.convert %38 : (tensor<i32>) -> tensor<ui32> loc(#loc1266)
    %40 = stablehlo.broadcast_in_dim %39, dims = [] : (tensor<ui32>) -> tensor<1xui32> loc(#loc1267)
    %41 = stablehlo.concatenate %37, %40, dim = 0 : (tensor<1xui32>, tensor<1xui32>) -> tensor<2xui32> loc(#loc1269)
    %42 = call @_bernoulli(%41, %cst_4) : (tensor<2xui32>, tensor<f32>) -> tensor<i1> loc(#loc1287)
    %43 = stablehlo.broadcast_in_dim %c_6, dims = [] : (tensor<i32>) -> tensor<401x9xi32> loc(#loc976)
    %44:32 = stablehlo.while(%iterArg = %c_8, %iterArg_16 = %cst_11, %iterArg_17 = %cst_12, %iterArg_18 = %c_3, %iterArg_19 = %c_13, %iterArg_20 = %cst_14, %iterArg_21 = %c_15, %iterArg_22 = %c_9, %iterArg_23 = %c_10, %iterArg_24 = %c_13, %iterArg_25 = %cst_14, %iterArg_26 = %c_9, %iterArg_27 = %c_10, %iterArg_28 = %c_8, %iterArg_29 = %c_8, %iterArg_30 = %arg0, %iterArg_31 = %34, %iterArg_32 = %43, %iterArg_33 = %33, %iterArg_34 = %31, %iterArg_35 = %2, %iterArg_36 = %5, %iterArg_37 = %8, %iterArg_38 = %11, %iterArg_39 = %14, %iterArg_40 = %17, %iterArg_41 = %20, %iterArg_42 = %23, %iterArg_43 = %26, %iterArg_44 = %29, %iterArg_45 = %32, %iterArg_46 = %30) : tensor<i32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<8x3xi32>, tensor<2xf32>, tensor<i1>, tensor<2xi32>, tensor<2xi32>, tensor<8x3xi32>, tensor<2xf32>, tensor<2xi32>, tensor<2xi32>, tensor<i32>, tensor<i32>, tensor<2xui32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xi32>, tensor<401x3x3x2xi1>, tensor<401x2xf32>, tensor<401xi1>, tensor<401xi1>, tensor<401x9xi1>, tensor<401xi32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xf32>
    cond {
      %81 = stablehlo.compare LT, %iterArg_28, %c_2, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1122)
      stablehlo.return %81 : tensor<i1> loc(#loc1121)
    } do {
      %81:18 = func.call @closed_call_0(%iterArg, %iterArg_16, %iterArg_17, %iterArg_18, %iterArg_19, %iterArg_20, %iterArg_21, %iterArg_22, %iterArg_23, %iterArg_24, %iterArg_25, %iterArg_26, %iterArg_27, %iterArg_29, %iterArg_30, %iterArg_31, %iterArg_32, %iterArg_33, %iterArg_34, %iterArg_35, %iterArg_36, %iterArg_37, %iterArg_38, %iterArg_39, %iterArg_40, %iterArg_41, %iterArg_42, %iterArg_43, %iterArg_44, %iterArg_45, %iterArg_46) : (tensor<i32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<8x3xi32>, tensor<2xf32>, tensor<i1>, tensor<2xi32>, tensor<2xi32>, tensor<8x3xi32>, tensor<2xf32>, tensor<2xi32>, tensor<2xi32>, tensor<i32>, tensor<2xui32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xi32>, tensor<401x3x3x2xi1>, tensor<401x2xf32>, tensor<401xi1>, tensor<401xi1>, tensor<401x9xi1>, tensor<401xi32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xf32>) -> (tensor<i32>, tensor<2xui32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xi32>, tensor<401x3x3x2xi1>, tensor<401x2xf32>, tensor<401xi1>, tensor<401xi1>, tensor<401x9xi1>, tensor<401xi32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xf32>) loc(#loc1123)
      %82 = stablehlo.add %iterArg_28, %c_3 : tensor<i32> loc(#loc1124)
      stablehlo.return %iterArg, %iterArg_16, %iterArg_17, %iterArg_18, %iterArg_19, %iterArg_20, %iterArg_21, %iterArg_22, %iterArg_23, %iterArg_24, %iterArg_25, %iterArg_26, %iterArg_27, %82, %81#0, %81#1, %81#2, %81#3, %81#4, %81#5, %81#6, %81#7, %81#8, %81#9, %81#10, %81#11, %81#12, %81#13, %81#14, %81#15, %81#16, %81#17 : tensor<i32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<8x3xi32>, tensor<2xf32>, tensor<i1>, tensor<2xi32>, tensor<2xi32>, tensor<8x3xi32>, tensor<2xf32>, tensor<2xi32>, tensor<2xi32>, tensor<i32>, tensor<i32>, tensor<2xui32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xi32>, tensor<401x3x3x2xi1>, tensor<401x2xf32>, tensor<401xi1>, tensor<401xi1>, tensor<401x9xi1>, tensor<401xi32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xf32> loc(#loc1121)
    } loc(#loc1121)
    %45 = stablehlo.compare LT, %c_8, %c_8, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1125)
    %46 = stablehlo.add %c_8, %c_1 : tensor<i32> loc(#loc1126)
    %47 = stablehlo.select %45, %46, %c_8 : tensor<i1>, tensor<i32> loc(#loc1127)
    %48 = stablehlo.compare LT, %c_8, %c_8, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1125)
    %49 = stablehlo.add %c_8, %c_0 : tensor<i32> loc(#loc1126)
    %50 = stablehlo.select %48, %49, %c_8 : tensor<i1>, tensor<i32> loc(#loc1127)
    %51 = stablehlo.dynamic_slice %44#17, %47, %50, sizes = [1, 9] : (tensor<401x9xi32>, tensor<i32>, tensor<i32>) -> tensor<1x9xi32> loc(#loc1128)
    %52 = stablehlo.reshape %51 : (tensor<1x9xi32>) -> tensor<9xi32> loc(#loc1129)
    %53 = stablehlo.broadcast_in_dim %c_6, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc1130)
    %54 = stablehlo.compare NE, %52, %53, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc1130)
    %55 = call @_where(%54, %52, %c_8) : (tensor<9xi1>, tensor<9xi32>, tensor<i32>) -> tensor<9xi32> loc(#loc1131)
    %56 = stablehlo.compare LT, %c_8, %c_8, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1288)
    %57 = stablehlo.add %c_8, %c_1 : tensor<i32> loc(#loc1289)
    %58 = stablehlo.select %56, %57, %c_8 : tensor<i1>, tensor<i32> loc(#loc1290)
    %59 = stablehlo.compare LT, %c_8, %c_8, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1288)
    %60 = stablehlo.add %c_8, %c_0 : tensor<i32> loc(#loc1289)
    %61 = stablehlo.select %59, %60, %c_8 : tensor<i1>, tensor<i32> loc(#loc1290)
    %62 = stablehlo.dynamic_slice %44#25, %58, %61, sizes = [1, 9] : (tensor<401x9xi1>, tensor<i32>, tensor<i32>) -> tensor<1x9xi1> loc(#loc1291)
    %63 = stablehlo.reshape %62 : (tensor<1x9xi1>) -> tensor<9xi1> loc(#loc1292)
    %64 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<i1>) -> tensor<9xi1> loc(#loc1114)
    %65 = stablehlo.compare NE, %54, %64, UNSIGNED : (tensor<9xi1>, tensor<9xi1>) -> tensor<9xi1> loc(#loc1114)
    %66 = stablehlo.convert %65 : tensor<9xi1> loc(#loc1114)
    %67 = stablehlo.and %63, %66 : tensor<9xi1> loc(#loc1133)
    %68 = stablehlo.broadcast_in_dim %c_8, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc1134)
    %69 = stablehlo.compare LT, %55, %68, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc1134)
    %70 = stablehlo.broadcast_in_dim %c_1, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc1135)
    %71 = stablehlo.add %55, %70 : tensor<9xi32> loc(#loc1135)
    %72 = stablehlo.select %69, %71, %55 : tensor<9xi1>, tensor<9xi32> loc(#loc1136)
    %73 = stablehlo.broadcast_in_dim %72, dims = [0] : (tensor<9xi32>) -> tensor<9x1xi32> loc(#loc1137)
    %74 = "stablehlo.gather"(%44#31, %73) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, slice_sizes = array<i64: 1>}> : (tensor<401xf32>, tensor<9x1xi32>) -> tensor<9xf32> loc(#loc1138)
    %75 = call @_where_8(%67, %74, %cst) : (tensor<9xi1>, tensor<9xf32>, tensor<f32>) -> tensor<9xf32> loc(#loc1139)
    %76 = call @argmax(%75) : (tensor<9xf32>) -> tensor<i32> loc(#loc1140)
    %77 = stablehlo.slice %44#17 [0:1, 0:9] : (tensor<401x9xi32>) -> tensor<1x9xi32> loc(#loc700)
    %78 = stablehlo.reshape %77 : (tensor<1x9xi32>) -> tensor<9xi32> loc(#loc701)
    %79 = stablehlo.convert %78 : tensor<9xi32> loc(#loc702)
    %80 = stablehlo.convert %44#18 : tensor<401xi32> loc(#loc703)
    return %76, %79, %44#31, %80 : tensor<i32>, tensor<9xi32>, tensor<401xf32>, tensor<401xi32> loc(#loc517)
  } loc(#loc)
  func.func private @_bernoulli(%arg0: tensor<2xui32> loc(unknown), %arg1: tensor<f32> loc(unknown)) -> tensor<i1> {
    %cst = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %0 = call @_uniform(%arg0, %cst, %cst_0) : (tensor<2xui32>, tensor<f32>, tensor<f32>) -> tensor<f32> loc(#loc45)
    %1 = stablehlo.compare LT, %0, %arg1, FLOAT : (tensor<f32>, tensor<f32>) -> tensor<i1> loc(#loc46)
    return %1 : tensor<i1> loc(#loc)
  } loc(#loc1303)
  func.func private @_uniform(%arg0: tensor<2xui32> loc(unknown), %arg1: tensor<f32> loc(unknown), %arg2: tensor<f32> loc(unknown)) -> tensor<f32> {
    %cst = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %c = stablehlo.constant dense<1065353216> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<9> : tensor<ui32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<ui32> loc(#loc)
    %0 = stablehlo.convert %arg1 : tensor<f32> loc(#loc48)
    %1 = stablehlo.convert %arg2 : tensor<f32> loc(#loc48)
    %2 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc49)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc50)
    %4 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc49)
    %5 = stablehlo.reshape %4 : (tensor<1xui32>) -> tensor<ui32> loc(#loc50)
    %6:2 = call @threefry2x32(%3, %5, %c_1, %c_1) : (tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>) -> (tensor<ui32>, tensor<ui32>) loc(#loc51)
    %7 = stablehlo.xor %6#0, %6#1 : tensor<ui32> loc(#loc52)
    %8 = stablehlo.shift_right_logical %7, %c_0 : tensor<ui32> loc(#loc53)
    %9 = stablehlo.or %8, %c : tensor<ui32> loc(#loc54)
    %10 = stablehlo.bitcast_convert %9 : (tensor<ui32>) -> tensor<f32> loc(#loc55)
    %11 = stablehlo.subtract %10, %cst : tensor<f32> loc(#loc56)
    %12 = stablehlo.subtract %1, %0 : tensor<f32> loc(#loc56)
    %13 = stablehlo.multiply %11, %12 : tensor<f32> loc(#loc57)
    %14 = stablehlo.add %13, %0 : tensor<f32> loc(#loc58)
    %15 = stablehlo.reshape %14 : (tensor<f32>) -> tensor<f32> loc(#loc59)
    %16 = stablehlo.maximum %0, %15 : tensor<f32> loc(#loc60)
    return %16 : tensor<f32> loc(#loc)
  } loc(#loc256)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc(unknown), %arg1: tensor<ui32> loc(unknown), %arg2: tensor<ui32> loc(unknown), %arg3: tensor<ui32> loc(unknown)) -> (tensor<ui32>, tensor<ui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc257)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc257)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc257)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc52)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc52)
    %2 = stablehlo.add %arg2, %arg0 : tensor<ui32> loc(#loc58)
    %3 = stablehlo.add %arg3, %arg1 : tensor<ui32> loc(#loc58)
    %4:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %2, %iterArg_7 = %3, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %5 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc63)
      stablehlo.return %5 : tensor<i1> loc(#loc62)
    } do {
      %5:8 = func.call @closed_call(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc64)
      %6 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc65)
      stablehlo.return %6, %5#0, %5#1, %5#2, %5#3, %5#4, %5#5, %5#6, %5#7 : tensor<i32>, tensor<i32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc62)
    } loc(#loc62)
    return %4#2, %4#3 : tensor<ui32>, tensor<ui32> loc(#loc)
  } loc(#loc)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<ui32> loc(unknown), %arg2: tensor<ui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc58)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc49)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc50)
    %3 = stablehlo.add %arg1, %arg2 : tensor<ui32> loc(#loc58)
    %4 = stablehlo.shift_left %arg2, %2 : tensor<ui32> loc(#loc66)
    %5 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc56)
    %6 = stablehlo.shift_right_logical %arg2, %5 : tensor<ui32> loc(#loc53)
    %7 = stablehlo.or %4, %6 : tensor<ui32> loc(#loc54)
    %8 = stablehlo.xor %3, %7 : tensor<ui32> loc(#loc52)
    %9 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc49)
    %10 = stablehlo.reshape %9 : (tensor<1xui32>) -> tensor<ui32> loc(#loc50)
    %11 = stablehlo.add %3, %8 : tensor<ui32> loc(#loc58)
    %12 = stablehlo.shift_left %8, %10 : tensor<ui32> loc(#loc66)
    %13 = stablehlo.subtract %c, %10 : tensor<ui32> loc(#loc56)
    %14 = stablehlo.shift_right_logical %8, %13 : tensor<ui32> loc(#loc53)
    %15 = stablehlo.or %12, %14 : tensor<ui32> loc(#loc54)
    %16 = stablehlo.xor %11, %15 : tensor<ui32> loc(#loc52)
    %17 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc49)
    %18 = stablehlo.reshape %17 : (tensor<1xui32>) -> tensor<ui32> loc(#loc50)
    %19 = stablehlo.add %11, %16 : tensor<ui32> loc(#loc58)
    %20 = stablehlo.shift_left %16, %18 : tensor<ui32> loc(#loc66)
    %21 = stablehlo.subtract %c, %18 : tensor<ui32> loc(#loc56)
    %22 = stablehlo.shift_right_logical %16, %21 : tensor<ui32> loc(#loc53)
    %23 = stablehlo.or %20, %22 : tensor<ui32> loc(#loc54)
    %24 = stablehlo.xor %19, %23 : tensor<ui32> loc(#loc52)
    %25 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc49)
    %26 = stablehlo.reshape %25 : (tensor<1xui32>) -> tensor<ui32> loc(#loc50)
    %27 = stablehlo.add %19, %24 : tensor<ui32> loc(#loc58)
    %28 = stablehlo.shift_left %24, %26 : tensor<ui32> loc(#loc66)
    %29 = stablehlo.subtract %c, %26 : tensor<ui32> loc(#loc56)
    %30 = stablehlo.shift_right_logical %24, %29 : tensor<ui32> loc(#loc53)
    %31 = stablehlo.or %28, %30 : tensor<ui32> loc(#loc54)
    %32 = stablehlo.xor %27, %31 : tensor<ui32> loc(#loc52)
    %33 = stablehlo.add %27, %arg3 : tensor<ui32> loc(#loc58)
    %34 = stablehlo.add %32, %arg4 : tensor<ui32> loc(#loc58)
    %35 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc58)
    %36 = stablehlo.convert %35 : (tensor<i32>) -> tensor<ui32> loc(#loc48)
    %37 = stablehlo.add %34, %36 : tensor<ui32> loc(#loc58)
    return %0, %33, %37, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc258)
  func.func private @closed_call_0(%arg0: tensor<i32> loc(unknown), %arg1: tensor<f32> loc(unknown), %arg2: tensor<f32> loc(unknown), %arg3: tensor<i32> loc(unknown), %arg4: tensor<8x3xi32> loc(unknown), %arg5: tensor<2xf32> loc(unknown), %arg6: tensor<i1> loc(unknown), %arg7: tensor<2xi32> loc(unknown), %arg8: tensor<2xi32> loc(unknown), %arg9: tensor<8x3xi32> loc(unknown), %arg10: tensor<2xf32> loc(unknown), %arg11: tensor<2xi32> loc(unknown), %arg12: tensor<2xi32> loc(unknown), %arg13: tensor<i32> loc(unknown), %arg14: tensor<2xui32> loc(unknown), %arg15: tensor<401xi32> loc(unknown), %arg16: tensor<401x9xi32> loc(unknown), %arg17: tensor<401xi32> loc(unknown), %arg18: tensor<401x2xf32> loc(unknown), %arg19: tensor<401xi32> loc(unknown), %arg20: tensor<401x3x3x2xi1> loc(unknown), %arg21: tensor<401x2xf32> loc(unknown), %arg22: tensor<401xi1> loc(unknown), %arg23: tensor<401xi1> loc(unknown), %arg24: tensor<401x9xi1> loc(unknown), %arg25: tensor<401xi32> loc(unknown), %arg26: tensor<401xi32> loc(unknown), %arg27: tensor<401x9xi32> loc(unknown), %arg28: tensor<401xi32> loc(unknown), %arg29: tensor<401x2xf32> loc(unknown), %arg30: tensor<401xf32> loc(unknown)) -> (tensor<i32>, tensor<2xui32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xi32>, tensor<401x3x3x2xi1>, tensor<401x2xf32>, tensor<401xi1>, tensor<401xi1>, tensor<401x9xi1>, tensor<401xi32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xf32>) {
    %cst = stablehlo.constant dense<-3.40282347E+38> : tensor<f32> loc(#loc)
    %cst_0 = stablehlo.constant dense<-1.000000e+00> : tensor<f32> loc(#loc)
    %cst_1 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c = stablehlo.constant dense<true> : tensor<i1> loc(#loc)
    %cst_2 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %cst_3 = stablehlo.constant dense<0x7F800000> : tensor<f32> loc(#loc)
    %c_4 = stablehlo.constant dense<false> : tensor<i1> loc(#loc)
    %cst_5 = stablehlo.constant dense<1.000000e+00> : tensor<f32> loc(#loc)
    %c_6 = stablehlo.constant dense<-1> : tensor<i32> loc(#loc)
    %c_7 = stablehlo.constant dense<2> : tensor<i32> loc(#loc)
    %c_8 = stablehlo.constant dense<3> : tensor<i32> loc(#loc)
    %c_9 = stablehlo.constant dense<9> : tensor<i32> loc(#loc)
    %c_10 = stablehlo.constant dense<401> : tensor<i32> loc(#loc)
    %c_11 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_12 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg13, %c_12 : tensor<i32> loc(#loc58)
    %1 = call @_threefry_split(%arg14) : (tensor<2xui32>) -> tensor<2x2xui32> loc(#loc526)
    %2 = stablehlo.slice %1 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32> loc(#loc408)
    %3 = stablehlo.reshape %2 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc409)
    %4 = stablehlo.slice %1 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32> loc(#loc408)
    %5 = stablehlo.reshape %4 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc409)
    %6 = stablehlo.compare LT, %arg0, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc705)
    %7 = stablehlo.add %arg0, %c_10 : tensor<i32> loc(#loc706)
    %8 = stablehlo.select %6, %7, %arg0 : tensor<i1>, tensor<i32> loc(#loc707)
    %9 = stablehlo.compare LT, %c_11, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc705)
    %10 = stablehlo.add %c_11, %c_9 : tensor<i32> loc(#loc706)
    %11 = stablehlo.select %9, %10, %c_11 : tensor<i1>, tensor<i32> loc(#loc707)
    %12 = stablehlo.dynamic_slice %arg16, %8, %11, sizes = [1, 9] : (tensor<401x9xi32>, tensor<i32>, tensor<i32>) -> tensor<1x9xi32> loc(#loc708)
    %13 = stablehlo.reshape %12 : (tensor<1x9xi32>) -> tensor<9xi32> loc(#loc709)
    %14 = stablehlo.compare LT, %arg0, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1141)
    %15 = stablehlo.add %arg0, %c_10 : tensor<i32> loc(#loc1142)
    %16 = stablehlo.select %14, %15, %arg0 : tensor<i1>, tensor<i32> loc(#loc1143)
    %17 = stablehlo.dynamic_slice %arg19, %16, sizes = [1] : (tensor<401xi32>, tensor<i32>) -> tensor<1xi32> loc(#loc1144)
    %18 = stablehlo.reshape %17 : (tensor<1xi32>) -> tensor<i32> loc(#loc1145)
    %19 = stablehlo.compare LT, %arg0, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1141)
    %20 = stablehlo.add %arg0, %c_10 : tensor<i32> loc(#loc1142)
    %21 = stablehlo.select %19, %20, %arg0 : tensor<i1>, tensor<i32> loc(#loc1143)
    %22 = stablehlo.compare LT, %c_11, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1141)
    %23 = stablehlo.add %c_11, %c_9 : tensor<i32> loc(#loc1142)
    %24 = stablehlo.select %22, %23, %c_11 : tensor<i1>, tensor<i32> loc(#loc1143)
    %25 = stablehlo.dynamic_slice %arg24, %21, %24, sizes = [1, 9] : (tensor<401x9xi1>, tensor<i32>, tensor<i32>) -> tensor<1x9xi1> loc(#loc1144)
    %26 = stablehlo.reshape %25 : (tensor<1x9xi1>) -> tensor<9xi1> loc(#loc1145)
    %27 = stablehlo.broadcast_in_dim %c_6, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc711)
    %28 = stablehlo.compare NE, %13, %27, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc711)
    %29 = call @_where(%28, %13, %c_11) : (tensor<9xi1>, tensor<9xi32>, tensor<i32>) -> tensor<9xi32> loc(#loc712)
    %30 = stablehlo.broadcast_in_dim %c_11, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc713)
    %31 = stablehlo.compare LT, %29, %30, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc713)
    %32 = stablehlo.broadcast_in_dim %c_10, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc714)
    %33 = stablehlo.add %29, %32 : tensor<9xi32> loc(#loc714)
    %34 = stablehlo.select %31, %33, %29 : tensor<9xi1>, tensor<9xi32> loc(#loc715)
    %35 = stablehlo.compare LT, %18, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc713)
    %36 = stablehlo.add %18, %c_7 : tensor<i32> loc(#loc714)
    %37 = stablehlo.select %35, %36, %18 : tensor<i1>, tensor<i32> loc(#loc715)
    %38 = stablehlo.broadcast_in_dim %37, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc716)
    %39 = stablehlo.broadcast_in_dim %34, dims = [0] : (tensor<9xi32>) -> tensor<9x1xi32> loc(#loc716)
    %40 = stablehlo.broadcast_in_dim %38, dims = [0] : (tensor<9xi32>) -> tensor<9x1xi32> loc(#loc716)
    %41 = stablehlo.concatenate %39, %40, dim = 1 : (tensor<9x1xi32>, tensor<9x1xi32>) -> tensor<9x2xi32> loc(#loc717)
    %42 = "stablehlo.gather"(%arg29, %41) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 1>}> : (tensor<401x2xf32>, tensor<9x2xi32>) -> tensor<9xf32> loc(#loc718)
    %43 = stablehlo.compare LT, %arg0, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc719)
    %44 = stablehlo.add %arg0, %c_10 : tensor<i32> loc(#loc720)
    %45 = stablehlo.select %43, %44, %arg0 : tensor<i1>, tensor<i32> loc(#loc721)
    %46 = stablehlo.dynamic_slice %arg30, %45, sizes = [1] : (tensor<401xf32>, tensor<i32>) -> tensor<1xf32> loc(#loc722)
    %47 = stablehlo.reshape %46 : (tensor<1xf32>) -> tensor<f32> loc(#loc723)
    %48 = stablehlo.add %47, %cst_5 : tensor<f32> loc(#loc724)
    %49 = stablehlo.log %48 : tensor<f32> loc(#loc725)
    %50 = stablehlo.broadcast_in_dim %c_11, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc726)
    %51 = stablehlo.compare LT, %29, %50, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc726)
    %52 = stablehlo.broadcast_in_dim %c_10, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc727)
    %53 = stablehlo.add %29, %52 : tensor<9xi32> loc(#loc727)
    %54 = stablehlo.select %51, %53, %29 : tensor<9xi1>, tensor<9xi32> loc(#loc728)
    %55 = stablehlo.broadcast_in_dim %54, dims = [0] : (tensor<9xi32>) -> tensor<9x1xi32> loc(#loc729)
    %56 = "stablehlo.gather"(%arg30, %55) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, slice_sizes = array<i64: 1>}> : (tensor<401xf32>, tensor<9x1xi32>) -> tensor<9xf32> loc(#loc730)
    %57 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<f32>) -> tensor<9xf32> loc(#loc731)
    %58 = stablehlo.add %56, %57 : tensor<9xf32> loc(#loc731)
    %59 = stablehlo.broadcast_in_dim %49, dims = [] : (tensor<f32>) -> tensor<9xf32> loc(#loc732)
    %60 = stablehlo.divide %59, %58 : tensor<9xf32> loc(#loc732)
    %61 = stablehlo.sqrt %60 : tensor<9xf32> loc(#loc733)
    %62 = stablehlo.convert %arg2 : tensor<f32> loc(#loc734)
    %63 = stablehlo.broadcast_in_dim %62, dims = [] : (tensor<f32>) -> tensor<9xf32> loc(#loc735)
    %64 = stablehlo.multiply %63, %61 : tensor<9xf32> loc(#loc735)
    %65 = stablehlo.add %42, %64 : tensor<9xf32> loc(#loc736)
    %66 = stablehlo.not %28 : tensor<9xi1> loc(#loc737)
    %67 = stablehlo.broadcast_in_dim %c_4, dims = [] : (tensor<i1>) -> tensor<9xi1> loc(#loc738)
    %68 = stablehlo.compare NE, %66, %67, UNSIGNED : (tensor<9xi1>, tensor<9xi1>) -> tensor<9xi1> loc(#loc738)
    %69 = stablehlo.convert %68 : tensor<9xi1> loc(#loc738)
    %70 = stablehlo.and %26, %69 : tensor<9xi1> loc(#loc739)
    %71 = call @_where_3(%70, %cst_3, %65) : (tensor<9xi1>, tensor<f32>, tensor<9xf32>) -> tensor<9xf32> loc(#loc740)
    %72 = stablehlo.not %26 : tensor<9xi1> loc(#loc741)
    %73 = call @_where_3(%72, %cst_2, %71) : (tensor<9xi1>, tensor<f32>, tensor<9xf32>) -> tensor<9xf32> loc(#loc742)
    %74 = call @argmax(%73) : (tensor<9xf32>) -> tensor<i32> loc(#loc546)
    %75 = stablehlo.compare LT, %arg0, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc547)
    %76 = stablehlo.add %arg0, %c_10 : tensor<i32> loc(#loc548)
    %77 = stablehlo.select %75, %76, %arg0 : tensor<i1>, tensor<i32> loc(#loc549)
    %78 = stablehlo.compare LT, %74, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc547)
    %79 = stablehlo.add %74, %c_9 : tensor<i32> loc(#loc548)
    %80 = stablehlo.select %78, %79, %74 : tensor<i1>, tensor<i32> loc(#loc549)
    %81 = stablehlo.dynamic_slice %arg16, %77, %80, sizes = [1, 1] : (tensor<401x9xi32>, tensor<i32>, tensor<i32>) -> tensor<1x1xi32> loc(#loc550)
    %82 = stablehlo.reshape %81 : (tensor<1x1xi32>) -> tensor<i32> loc(#loc551)
    %83:18 = stablehlo.while(%iterArg = %arg16, %iterArg_13 = %arg19, %iterArg_14 = %arg20, %iterArg_15 = %arg21, %iterArg_16 = %arg22, %iterArg_17 = %arg23, %iterArg_18 = %arg24, %iterArg_19 = %arg25, %iterArg_20 = %arg26, %iterArg_21 = %arg27, %iterArg_22 = %arg28, %iterArg_23 = %arg29, %iterArg_24 = %arg30, %iterArg_25 = %arg1, %iterArg_26 = %arg2, %iterArg_27 = %arg0, %iterArg_28 = %74, %iterArg_29 = %82) : tensor<401x9xi32>, tensor<401xi32>, tensor<401x3x3x2xi1>, tensor<401x2xf32>, tensor<401xi1>, tensor<401xi1>, tensor<401x9xi1>, tensor<401xi32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xf32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<i32>, tensor<i32>
    cond {
      %228 = stablehlo.compare NE, %iterArg_29, %c_6, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc743)
      stablehlo.return %228 : tensor<i1> loc(#loc552)
    } do {
      %228 = stablehlo.convert %iterArg_29 : tensor<i32> loc(#loc744)
      %229 = stablehlo.compare LT, %228, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc745)
      %230 = stablehlo.add %228, %c_10 : tensor<i32> loc(#loc746)
      %231 = stablehlo.select %229, %230, %228 : tensor<i1>, tensor<i32> loc(#loc747)
      %232 = stablehlo.compare LT, %c_11, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc745)
      %233 = stablehlo.add %c_11, %c_9 : tensor<i32> loc(#loc746)
      %234 = stablehlo.select %232, %233, %c_11 : tensor<i1>, tensor<i32> loc(#loc747)
      %235 = stablehlo.dynamic_slice %iterArg, %231, %234, sizes = [1, 9] : (tensor<401x9xi32>, tensor<i32>, tensor<i32>) -> tensor<1x9xi32> loc(#loc748)
      %236 = stablehlo.reshape %235 : (tensor<1x9xi32>) -> tensor<9xi32> loc(#loc749)
      %237 = stablehlo.compare LT, %iterArg_29, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1146)
      %238 = stablehlo.convert %iterArg_29 : tensor<i32> loc(#loc1147)
      %239 = stablehlo.add %238, %c_10 : tensor<i32> loc(#loc1148)
      %240 = stablehlo.select %237, %239, %iterArg_29 : tensor<i1>, tensor<i32> loc(#loc1149)
      %241 = stablehlo.dynamic_slice %iterArg_13, %240, sizes = [1] : (tensor<401xi32>, tensor<i32>) -> tensor<1xi32> loc(#loc1150)
      %242 = stablehlo.reshape %241 : (tensor<1xi32>) -> tensor<i32> loc(#loc1151)
      %243 = stablehlo.convert %iterArg_29 : tensor<i32> loc(#loc1147)
      %244 = stablehlo.compare LT, %243, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1146)
      %245 = stablehlo.add %243, %c_10 : tensor<i32> loc(#loc1148)
      %246 = stablehlo.select %244, %245, %243 : tensor<i1>, tensor<i32> loc(#loc1149)
      %247 = stablehlo.compare LT, %c_11, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1146)
      %248 = stablehlo.add %c_11, %c_9 : tensor<i32> loc(#loc1148)
      %249 = stablehlo.select %247, %248, %c_11 : tensor<i1>, tensor<i32> loc(#loc1149)
      %250 = stablehlo.dynamic_slice %iterArg_18, %246, %249, sizes = [1, 9] : (tensor<401x9xi1>, tensor<i32>, tensor<i32>) -> tensor<1x9xi1> loc(#loc1150)
      %251 = stablehlo.reshape %250 : (tensor<1x9xi1>) -> tensor<9xi1> loc(#loc1151)
      %252 = stablehlo.broadcast_in_dim %c_6, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc751)
      %253 = stablehlo.compare NE, %236, %252, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc751)
      %254 = func.call @_where(%253, %236, %c_11) : (tensor<9xi1>, tensor<9xi32>, tensor<i32>) -> tensor<9xi32> loc(#loc752)
      %255 = stablehlo.broadcast_in_dim %c_11, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc753)
      %256 = stablehlo.compare LT, %254, %255, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc753)
      %257 = stablehlo.broadcast_in_dim %c_10, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc754)
      %258 = stablehlo.add %254, %257 : tensor<9xi32> loc(#loc754)
      %259 = stablehlo.select %256, %258, %254 : tensor<9xi1>, tensor<9xi32> loc(#loc755)
      %260 = stablehlo.compare LT, %242, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc753)
      %261 = stablehlo.add %242, %c_7 : tensor<i32> loc(#loc754)
      %262 = stablehlo.select %260, %261, %242 : tensor<i1>, tensor<i32> loc(#loc755)
      %263 = stablehlo.broadcast_in_dim %262, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc756)
      %264 = stablehlo.broadcast_in_dim %259, dims = [0] : (tensor<9xi32>) -> tensor<9x1xi32> loc(#loc756)
      %265 = stablehlo.broadcast_in_dim %263, dims = [0] : (tensor<9xi32>) -> tensor<9x1xi32> loc(#loc756)
      %266 = stablehlo.concatenate %264, %265, dim = 1 : (tensor<9x1xi32>, tensor<9x1xi32>) -> tensor<9x2xi32> loc(#loc757)
      %267 = "stablehlo.gather"(%iterArg_23, %266) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0, 1], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 1>}> : (tensor<401x2xf32>, tensor<9x2xi32>) -> tensor<9xf32> loc(#loc758)
      %268 = stablehlo.compare LT, %iterArg_29, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc759)
      %269 = stablehlo.convert %iterArg_29 : tensor<i32> loc(#loc760)
      %270 = stablehlo.add %269, %c_10 : tensor<i32> loc(#loc761)
      %271 = stablehlo.select %268, %270, %iterArg_29 : tensor<i1>, tensor<i32> loc(#loc762)
      %272 = stablehlo.dynamic_slice %iterArg_24, %271, sizes = [1] : (tensor<401xf32>, tensor<i32>) -> tensor<1xf32> loc(#loc763)
      %273 = stablehlo.reshape %272 : (tensor<1xf32>) -> tensor<f32> loc(#loc764)
      %274 = stablehlo.add %273, %cst_5 : tensor<f32> loc(#loc765)
      %275 = stablehlo.log %274 : tensor<f32> loc(#loc766)
      %276 = stablehlo.broadcast_in_dim %c_11, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc767)
      %277 = stablehlo.compare LT, %254, %276, SIGNED : (tensor<9xi32>, tensor<9xi32>) -> tensor<9xi1> loc(#loc767)
      %278 = stablehlo.broadcast_in_dim %c_10, dims = [] : (tensor<i32>) -> tensor<9xi32> loc(#loc768)
      %279 = stablehlo.add %254, %278 : tensor<9xi32> loc(#loc768)
      %280 = stablehlo.select %277, %279, %254 : tensor<9xi1>, tensor<9xi32> loc(#loc769)
      %281 = stablehlo.broadcast_in_dim %280, dims = [0] : (tensor<9xi32>) -> tensor<9x1xi32> loc(#loc770)
      %282 = "stablehlo.gather"(%iterArg_24, %281) <{dimension_numbers = #stablehlo.gather<collapsed_slice_dims = [0], start_index_map = [0], index_vector_dim = 1>, slice_sizes = array<i64: 1>}> : (tensor<401xf32>, tensor<9x1xi32>) -> tensor<9xf32> loc(#loc771)
      %283 = stablehlo.broadcast_in_dim %iterArg_25, dims = [] : (tensor<f32>) -> tensor<9xf32> loc(#loc772)
      %284 = stablehlo.add %282, %283 : tensor<9xf32> loc(#loc772)
      %285 = stablehlo.broadcast_in_dim %275, dims = [] : (tensor<f32>) -> tensor<9xf32> loc(#loc773)
      %286 = stablehlo.divide %285, %284 : tensor<9xf32> loc(#loc773)
      %287 = stablehlo.sqrt %286 : tensor<9xf32> loc(#loc774)
      %288 = stablehlo.convert %iterArg_26 : tensor<f32> loc(#loc775)
      %289 = stablehlo.broadcast_in_dim %288, dims = [] : (tensor<f32>) -> tensor<9xf32> loc(#loc776)
      %290 = stablehlo.multiply %289, %287 : tensor<9xf32> loc(#loc776)
      %291 = stablehlo.add %267, %290 : tensor<9xf32> loc(#loc777)
      %292 = stablehlo.not %253 : tensor<9xi1> loc(#loc778)
      %293 = stablehlo.broadcast_in_dim %c_4, dims = [] : (tensor<i1>) -> tensor<9xi1> loc(#loc779)
      %294 = stablehlo.compare NE, %292, %293, UNSIGNED : (tensor<9xi1>, tensor<9xi1>) -> tensor<9xi1> loc(#loc779)
      %295 = stablehlo.convert %294 : tensor<9xi1> loc(#loc779)
      %296 = stablehlo.and %251, %295 : tensor<9xi1> loc(#loc780)
      %297 = func.call @_where_3(%296, %cst_3, %291) : (tensor<9xi1>, tensor<f32>, tensor<9xf32>) -> tensor<9xf32> loc(#loc781)
      %298 = stablehlo.not %251 : tensor<9xi1> loc(#loc782)
      %299 = func.call @_where_3(%298, %cst_2, %297) : (tensor<9xi1>, tensor<f32>, tensor<9xf32>) -> tensor<9xf32> loc(#loc783)
      %300 = func.call @argmax(%299) : (tensor<9xf32>) -> tensor<i32> loc(#loc784)
      %301 = stablehlo.convert %iterArg_29 : tensor<i32> loc(#loc785)
      %302 = stablehlo.compare LT, %301, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc786)
      %303 = stablehlo.add %301, %c_10 : tensor<i32> loc(#loc787)
      %304 = stablehlo.select %302, %303, %301 : tensor<i1>, tensor<i32> loc(#loc788)
      %305 = stablehlo.compare LT, %300, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc786)
      %306 = stablehlo.add %300, %c_9 : tensor<i32> loc(#loc787)
      %307 = stablehlo.select %305, %306, %300 : tensor<i1>, tensor<i32> loc(#loc788)
      %308 = stablehlo.dynamic_slice %iterArg, %304, %307, sizes = [1, 1] : (tensor<401x9xi32>, tensor<i32>, tensor<i32>) -> tensor<1x1xi32> loc(#loc789)
      %309 = stablehlo.reshape %308 : (tensor<1x1xi32>) -> tensor<i32> loc(#loc790)
      stablehlo.return %iterArg, %iterArg_13, %iterArg_14, %iterArg_15, %iterArg_16, %iterArg_17, %iterArg_18, %iterArg_19, %iterArg_20, %iterArg_21, %iterArg_22, %iterArg_23, %iterArg_24, %iterArg_25, %iterArg_26, %iterArg_29, %300, %309 : tensor<401x9xi32>, tensor<401xi32>, tensor<401x3x3x2xi1>, tensor<401x2xf32>, tensor<401xi1>, tensor<401xi1>, tensor<401x9xi1>, tensor<401xi32>, tensor<401xi32>, tensor<401x9xi32>, tensor<401xi32>, tensor<401x2xf32>, tensor<401xf32>, tensor<f32>, tensor<f32>, tensor<i32>, tensor<i32>, tensor<i32> loc(#loc552)
    } loc(#loc552)
    %84 = stablehlo.compare EQ, %83#17, %c_6, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc433)
    %85 = stablehlo.convert %arg13 : tensor<i32> loc(#loc434)
    %86 = stablehlo.add %arg3, %85 : tensor<i32> loc(#loc435)
    %87 = stablehlo.select %84, %86, %83#17 : tensor<i1>, tensor<i32> loc(#loc436)
    %88 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc437)
    %89 = stablehlo.convert %83#15 : tensor<i32> loc(#loc438)
    %90 = stablehlo.add %89, %c_10 : tensor<i32> loc(#loc439)
    %91 = stablehlo.select %88, %90, %83#15 : tensor<i1>, tensor<i32> loc(#loc440)
    %92 = stablehlo.dynamic_slice %arg22, %91, sizes = [1] : (tensor<401xi1>, tensor<i32>) -> tensor<1xi1> loc(#loc441)
    %93 = stablehlo.reshape %92 : (tensor<1xi1>) -> tensor<i1> loc(#loc442)
    %94 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc443)
    %95 = stablehlo.convert %83#15 : tensor<i32> loc(#loc444)
    %96 = stablehlo.add %95, %c_10 : tensor<i32> loc(#loc445)
    %97 = stablehlo.select %94, %96, %83#15 : tensor<i1>, tensor<i32> loc(#loc446)
    %98 = stablehlo.dynamic_slice %arg23, %97, sizes = [1] : (tensor<401xi1>, tensor<i32>) -> tensor<1xi1> loc(#loc447)
    %99 = stablehlo.reshape %98 : (tensor<1xi1>) -> tensor<i1> loc(#loc448)
    %100 = stablehlo.or %93, %99 : tensor<i1> loc(#loc449)
    %101 = stablehlo.convert %100 : (tensor<i1>) -> tensor<i32> loc(#loc450)
    %102:14 = "stablehlo.case"(%101) ({
      %228 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %229 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %230 = stablehlo.add %229, %c_10 : tensor<i32> loc(#loc1154)
      %231 = stablehlo.select %228, %230, %83#15 : tensor<i1>, tensor<i32> loc(#loc1155)
      %232 = stablehlo.dynamic_slice %arg19, %231, sizes = [1] : (tensor<401xi32>, tensor<i32>) -> tensor<1xi32> loc(#loc1156)
      %233 = stablehlo.reshape %232 : (tensor<1xi32>) -> tensor<i32> loc(#loc1157)
      %234 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %235 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %236 = stablehlo.add %235, %c_10 : tensor<i32> loc(#loc1154)
      %237 = stablehlo.select %234, %236, %83#15 : tensor<i1>, tensor<i32> loc(#loc1155)
      %238 = stablehlo.dynamic_slice %arg22, %237, sizes = [1] : (tensor<401xi1>, tensor<i32>) -> tensor<1xi1> loc(#loc1156)
      %239 = stablehlo.reshape %238 : (tensor<1xi1>) -> tensor<i1> loc(#loc1157)
      %240 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %241 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %242 = stablehlo.add %241, %c_10 : tensor<i32> loc(#loc1154)
      %243 = stablehlo.select %240, %242, %83#15 : tensor<i1>, tensor<i32> loc(#loc1155)
      %244 = stablehlo.dynamic_slice %arg23, %243, sizes = [1] : (tensor<401xi1>, tensor<i32>) -> tensor<1xi1> loc(#loc1156)
      %245 = stablehlo.reshape %244 : (tensor<1xi1>) -> tensor<i1> loc(#loc1157)
      %246 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %247 = stablehlo.compare LT, %246, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %248 = stablehlo.add %246, %c_10 : tensor<i32> loc(#loc1154)
      %249 = stablehlo.select %247, %248, %246 : tensor<i1>, tensor<i32> loc(#loc1155)
      %250 = stablehlo.compare LT, %c_11, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %251 = stablehlo.add %c_11, %c_9 : tensor<i32> loc(#loc1154)
      %252 = stablehlo.select %250, %251, %c_11 : tensor<i1>, tensor<i32> loc(#loc1155)
      %253 = stablehlo.dynamic_slice %arg24, %249, %252, sizes = [1, 9] : (tensor<401x9xi1>, tensor<i32>, tensor<i32>) -> tensor<1x9xi1> loc(#loc1156)
      %254 = stablehlo.reshape %253 : (tensor<1x9xi1>) -> tensor<9xi1> loc(#loc1157)
      %255 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %256 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %257 = stablehlo.add %256, %c_10 : tensor<i32> loc(#loc1154)
      %258 = stablehlo.select %255, %257, %83#15 : tensor<i1>, tensor<i32> loc(#loc1155)
      %259 = stablehlo.dynamic_slice %arg25, %258, sizes = [1] : (tensor<401xi32>, tensor<i32>) -> tensor<1xi32> loc(#loc1156)
      %260 = stablehlo.reshape %259 : (tensor<1xi32>) -> tensor<i32> loc(#loc1157)
      %261 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %262 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %263 = stablehlo.add %262, %c_10 : tensor<i32> loc(#loc1154)
      %264 = stablehlo.select %261, %263, %83#15 : tensor<i1>, tensor<i32> loc(#loc1155)
      %265 = stablehlo.dynamic_slice %arg26, %264, sizes = [1] : (tensor<401xi32>, tensor<i32>) -> tensor<1xi32> loc(#loc1156)
      %266 = stablehlo.reshape %265 : (tensor<1xi32>) -> tensor<i32> loc(#loc1157)
      %267 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %268 = stablehlo.compare LT, %267, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %269 = stablehlo.add %267, %c_10 : tensor<i32> loc(#loc1154)
      %270 = stablehlo.select %268, %269, %267 : tensor<i1>, tensor<i32> loc(#loc1155)
      %271 = stablehlo.compare LT, %c_11, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %272 = stablehlo.add %c_11, %c_9 : tensor<i32> loc(#loc1154)
      %273 = stablehlo.select %271, %272, %c_11 : tensor<i1>, tensor<i32> loc(#loc1155)
      %274 = stablehlo.dynamic_slice %arg27, %270, %273, sizes = [1, 9] : (tensor<401x9xi32>, tensor<i32>, tensor<i32>) -> tensor<1x9xi32> loc(#loc1156)
      %275 = stablehlo.reshape %274 : (tensor<1x9xi32>) -> tensor<9xi32> loc(#loc1157)
      %276 = stablehlo.compare LT, %83#15, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1152)
      %277 = stablehlo.convert %83#15 : tensor<i32> loc(#loc1153)
      %278 = stablehlo.add %277, %c_10 : tensor<i32> loc(#loc1154)
      %279 = stablehlo.select %276, %278, %83#15 : tensor<i1>, tensor<i32> loc(#loc1155)
      %280 = stablehlo.dynamic_slice %arg28, %279, sizes = [1] : (tensor<401xi32>, tensor<i32>) -> tensor<1xi32> loc(#loc1156)
      %281 = stablehlo.reshape %280 : (tensor<1xi32>) -> tensor<i32> loc(#loc1157)
      %282 = stablehlo.compare LT, %83#16, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc989)
      %283 = stablehlo.add %83#16, %c_9 : tensor<i32> loc(#loc990)
      %284 = stablehlo.select %282, %283, %83#16 : tensor<i1>, tensor<i32> loc(#loc991)
      %285 = stablehlo.dynamic_slice %254, %284, sizes = [1] : (tensor<9xi1>, tensor<i32>) -> tensor<1xi1> loc(#loc992)
      %286 = stablehlo.reshape %285 : (tensor<1xi1>) -> tensor<i1> loc(#loc993)
      %287 = stablehlo.not %286 : tensor<i1> loc(#loc994)
      %288 = stablehlo.or %239, %245 : tensor<i1> loc(#loc995)
      %289 = stablehlo.convert %288 : (tensor<i1>) -> tensor<i32> loc(#loc996)
      %290:8 = "stablehlo.case"(%289) ({
        %384 = stablehlo.add %260, %c_12 : tensor<i32> loc(#loc1158)
        %385 = stablehlo.add %233, %c_12 : tensor<i32> loc(#loc1159)
        %386 = func.call @remainder(%385, %c_7) : (tensor<i32>, tensor<i32>) -> tensor<i32> loc(#loc1160)
        %387 = stablehlo.compare LT, %83#16, %c_11, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc1161)
        %388 = stablehlo.add %83#16, %c_9 : tensor<i32> loc(#loc1162)
        %389 = stablehlo.select %387, %388, %83#16 : tensor<i1>, tensor<i32> loc(#loc1163)
        %390 = stablehlo.broadcast_in_dim %389, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc1164)
