#loc = loc(unknown)
#loc1 = loc("key")
#loc4 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":298:50 to :74)
#loc34 = loc("/Users/noahfarr/reinforcement-learning/.venv/lib/python3.13/site-packages/flax/linen/linear.py":1166:21 to 1171:5)
#loc35 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":84:32 to :49)
#loc36 = loc("/Users/noahfarr/reinforcement-learning/src/networks/networks/network.py":24:12 to :71)
#loc37 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":307:17 to 314:9)
#loc46 = loc("scatter")
#loc106 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":268:20 to :66)
#loc107 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":192:23 to :63)
#loc113 = loc("vmap()")
#loc144 = loc("erf")
#loc146 = loc("reduce_window_sum")
#loc150 = loc("RecurrentPPO.init"(#loc4))
#loc180 = loc("Embed.setup"(#loc34))
#loc181 = loc("TokenFeatureExtractor.__call__"(#loc35))
#loc182 = loc("Network.__call__"(#loc36))
#loc183 = loc("RecurrentPPO.init"(#loc37))
#loc192 = loc("scatter:"(#loc46))
#loc243 = loc("RecurrentPPO.update_step"(#loc106))
#loc244 = loc("main.<locals>.train_step"(#loc107))
#loc248 = loc("reduce_window_sum:"(#loc146))
#loc251 = loc(callsite(#loc182 at #loc183))
#loc261 = loc(callsite(#loc243 at #loc244))
#loc269 = loc(callsite(#loc181 at #loc251))
#loc294 = loc(callsite(#loc180 at #loc269))
module @jit_init attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key")) -> (tensor<i32> {jax.result_info = "result.step"}, tensor<16x5xi32> {jax.result_info = "result.timestep.obs"}, tensor<16xi32> {jax.result_info = "result.timestep.action"}, tensor<16xf32> {jax.result_info = "result.timestep.reward"}, tensor<16xi1> {jax.result_info = "result.timestep.terminated"}, tensor<16xi1> {jax.result_info = "result.timestep.truncated"}, tensor<16xf32> {jax.result_info = "result.timestep.info['fired']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['guess_count']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['illegal_guesses']"}, tensor<16xf32> {jax.result_info = "result.timestep.info['matched_secret']"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.env_state.secret_answer"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.env_state.guess_feedback"}, tensor<16xi1> {jax.result_info = "result.environment_state.env_state.guess_revealed"}, tensor<16xi32> {jax.result_info = "result.environment_state.env_state.guess_count"}, tensor<16xi1> {jax.result_info = "result.environment_state.env_state.matched_secret"}, tensor<16xi1> {jax.result_info = "result.environment_state.active"}, tensor<16x5xi32> {jax.result_info = "result.environment_state.arguments"}, tensor<16xi32> {jax.result_info = "result.environment_state.cursor"}, tensor<16x96xi32> {jax.result_info = "result.carry[1].done"}, tensor<16x96x2x8xf32> {jax.result_info = "result.carry[1].key"}, tensor<16x96x2x8xf32> {jax.result_info = "result.carry[1].value"}, tensor<33x16xf32> {jax.result_info = "result.params['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.params['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.params['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.params['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['key']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['key']['kernel']"}, tensor<16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['output_projection']['bias']"}, tensor<2x8x16xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['output_projection']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['query']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['query']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['value']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.params['params']['torso']['block']['blocks_1']['value']['kernel']"}, tensor<i32> {jax.result_info = "result.optimizer_state[1][0].count"}, tensor<33x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['key']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['key']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['output_projection']['bias']"}, tensor<2x8x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['output_projection']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['query']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['query']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['value']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['block']['blocks_1']['value']['kernel']"}, tensor<33x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['feature_extractor']['token_embedding']['embedding']"}, tensor<16x33xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['critic']['bias']"}, tensor<16x1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['head']['critic']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_0']['Dense_0']['bias']"}, tensor<16x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_0']['Dense_0']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['key']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['key']['kernel']"}, tensor<16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['output_projection']['bias']"}, tensor<2x8x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['output_projection']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['query']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['query']['kernel']"}, tensor<2x8xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['value']['bias']"}, tensor<16x2x8xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['block']['blocks_1']['value']['kernel']"}) {
    %c = stablehlo.constant dense<3309781136> : tensor<ui32> loc(#loc262)
    %c_0 = stablehlo.constant dense<1632372854> : tensor<ui32> loc(#loc262)
    %c_1 = stablehlo.constant dense<2875902972> : tensor<ui32> loc(#loc262)
    %c_2 = stablehlo.constant dense<238560947> : tensor<ui32> loc(#loc262)
    %c_3 = stablehlo.constant dense<3753537410> : tensor<ui32> loc(#loc262)
    %cst = stablehlo.constant dense<-2.38197633E+38> : tensor<f32> loc(#loc262)
    %cst_4 = stablehlo.constant dense<0.353553385> : tensor<f32> loc(#loc262)
    %c_5 = stablehlo.constant dense<4044478262> : tensor<ui32> loc(#loc262)
    %c_6 = stablehlo.constant dense<88467544> : tensor<ui32> loc(#loc262)
    %c_7 = stablehlo.constant dense<3258985632> : tensor<ui32> loc(#loc262)
    %c_8 = stablehlo.constant dense<2428260558> : tensor<ui32> loc(#loc262)
    %c_9 = stablehlo.constant dense<2212064455> : tensor<ui32> loc(#loc262)
    %c_10 = stablehlo.constant dense<507466494> : tensor<ui32> loc(#loc262)
    %c_11 = stablehlo.constant dense<3763648675> : tensor<ui32> loc(#loc262)
    %c_12 = stablehlo.constant dense<2> : tensor<i32> loc(#loc)
    %c_13 = stablehlo.constant dense<-2> : tensor<i32> loc(#loc)
    %cst_14 = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %c_15 = stablehlo.constant dense<1591842985> : tensor<ui32> loc(#loc262)
    %cst_16 = stablehlo.constant dense<6.250000e-02> : tensor<f32> loc(#loc)
    %c_17 = stablehlo.constant dense<3005692971> : tensor<ui32> loc(#loc262)
    %c_18 = stablehlo.constant dense<1> : tensor<i32> loc(#loc262)
    %c_19 = stablehlo.constant dense<true> : tensor<i1> loc(#loc)
    %c_20 = stablehlo.constant dense<28> : tensor<i32> loc(#loc262)
    %cst_21 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c_22 = stablehlo.constant dense<false> : tensor<i1> loc(#loc)
    %c_23 = stablehlo.constant dense<5> : tensor<i32> loc(#loc262)
    %c_24 = stablehlo.constant dense<16> : tensor<i32> loc(#loc)
    %c_25 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_26 = stablehlo.constant dense<[[0, 20, 3, 8, 14], [1, 17, 8, 2, 10], [2, 7, 0, 8, 17], [2, 11, 14, 20, 3], [2, 17, 0, 13, 4], [5, 11, 8, 13, 19], [5, 17, 14, 18, 19], [6, 11, 0, 25, 4], [6, 17, 0, 15, 4], [7, 14, 20, 18, 4], [11, 4, 12, 14, 13], [12, 14, 20, 13, 3], [15, 11, 0, 13, 19], [18, 11, 0, 19, 4], [18, 15, 0, 3, 4], [18, 19, 14, 17, 12]]> : tensor<16x5xi32> loc(#loc262)
    %0 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<3x2xui32> loc(#loc306)
    %1 = stablehlo.slice %0 [0:1, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc286)
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc287)
    %3 = stablehlo.slice %0 [1:2, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc286)
    %4 = stablehlo.reshape %3 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc287)
    %5 = call @_threefry_split_0(%2) : (tensor<2xui32>) -> tensor<16x2xui32> loc(#loc342)
    %6 = stablehlo.broadcast_in_dim %5, dims = [0, 2] : (tensor<16x2xui32>) -> tensor<16x1x2xui32> loc(#loc308)
    %7 = stablehlo.reshape %6 : (tensor<16x1x2xui32>) -> tensor<16x2xui32> loc(#loc309)
    %8 = call @_randint(%7, %c_25, %c_24) : (tensor<16x2xui32>, tensor<i32>, tensor<i32>) -> tensor<16xi32> loc(#loc402)
    %9 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc403)
    %10 = stablehlo.compare LT, %8, %9, SIGNED : (tensor<16xi32>, tensor<16xi32>) -> tensor<16xi1> loc(#loc403)
    %11 = stablehlo.broadcast_in_dim %c_24, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc404)
    %12 = stablehlo.add %8, %11 : tensor<16xi32> loc(#loc404)
    %13 = stablehlo.select %10, %12, %8 : tensor<16xi1>, tensor<16xi32> loc(#loc405)
    %14 = stablehlo.compare LT, %c_25, %c_25, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc403)
    %15 = stablehlo.add %c_25, %c_23 : tensor<i32> loc(#loc404)
    %16 = stablehlo.select %14, %15, %c_25 : tensor<i1>, tensor<i32> loc(#loc405)
    %17 = stablehlo.broadcast_in_dim %13, dims = [0] : (tensor<16xi32>) -> tensor<16x1xi32> loc(#loc406)
    %18 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<i32>) -> tensor<16x1xi32> loc(#loc406)
    %19 = stablehlo.concatenate %17, %18, dim = 1 : (tensor<16x1xi32>, tensor<16x1xi32>) -> tensor<16x2xi32> loc(#loc407)
    %20 = "stablehlo.gather"(%c_26, %19) <{dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 5>}> : (tensor<16x5xi32>, tensor<16x2xi32>) -> tensor<16x1x5xi32> loc(#loc408)
    %21 = stablehlo.reshape %20 : (tensor<16x1x5xi32>) -> tensor<16x5xi32> loc(#loc409)
    %22 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc410)
    %23 = call @_one_hot(%22) : (tensor<5xi32>) -> tensor<5x3xf32> loc(#loc439)
    %24 = stablehlo.reshape %23 : (tensor<5x3xf32>) -> tensor<15xf32> loc(#loc440)
    %25 = call @_where(%c_22, %24, %cst_21) : (tensor<i1>, tensor<15xf32>, tensor<f32>) -> tensor<15xf32> loc(#loc441)
    %26 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc371)
    %27 = stablehlo.broadcast_in_dim %c_20, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc372)
    %28 = stablehlo.broadcast_in_dim %22, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc311)
    %29 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc311)
    %30 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc311)
    %31 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc311)
    %32 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc311)
    %33 = stablehlo.broadcast_in_dim %26, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc311)
    %34 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc311)
    %35 = stablehlo.broadcast_in_dim %27, dims = [1] : (tensor<5xi32>) -> tensor<16x5xi32> loc(#loc311)
    %36 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<16xi32> loc(#loc311)
    %37 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc311)
    %38 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc311)
    %39 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc311)
    %40 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc311)
    %41 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc311)
    %42 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc311)
    %43 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc311)
    %44 = stablehlo.broadcast_in_dim %c_18, dims = [] : (tensor<i32>) -> tensor<16x96xi32> loc(#loc442)
    %45 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x96x2x8xf32> loc(#loc443)
    %46 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x96x2x8xf32> loc(#loc444)
    %47 = stablehlo.broadcast_in_dim %35, dims = [0, 2] : (tensor<16x5xi32>) -> tensor<16x1x5xi32> loc(#loc347)
    %48 = stablehlo.broadcast_in_dim %36, dims = [0] : (tensor<16xi32>) -> tensor<16x1xi32> loc(#loc347)
    %49 = stablehlo.broadcast_in_dim %38, dims = [0] : (tensor<16xi1>) -> tensor<16x1xi1> loc(#loc347)
    %50 = stablehlo.broadcast_in_dim %39, dims = [0] : (tensor<16xi1>) -> tensor<16x1xi1> loc(#loc347)
    %51 = stablehlo.or %49, %50 : tensor<16x1xi1> loc(#loc314)
    %52 = call @_threefry_fold_in(%4, %c_17) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc417)
    %53 = call @_normal(%52) : (tensor<2xui32>) -> tensor<33x16xf32> loc(#loc375)
    %54 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc376)
    %55 = stablehlo.broadcast_in_dim %54, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc377)
    %56 = stablehlo.multiply %53, %55 : tensor<33x16xf32> loc(#loc377)
    %57 = call @_take(%56, %48) : (tensor<33x16xf32>, tensor<16x1xi32>) -> tensor<16x1x16xf32> loc(#loc378)
    %58 = stablehlo.broadcast_in_dim %57, dims = [0, 1, 3] : (tensor<16x1x16xf32>) -> tensor<16x1x1x16xf32> loc(#loc350)
    %59 = call @_take_14(%56, %47) : (tensor<33x16xf32>, tensor<16x1x5xi32>) -> tensor<16x1x5x16xf32> loc(#loc379)
    %60 = stablehlo.concatenate %58, %59, dim = 2 : (tensor<16x1x1x16xf32>, tensor<16x1x5x16xf32>) -> tensor<16x1x6x16xf32> loc(#loc352)
    %61 = stablehlo.reshape %60 : (tensor<16x1x6x16xf32>) -> tensor<16x6x16xf32> loc(#loc353)
    %62 = stablehlo.broadcast_in_dim %c_22, dims = [] : (tensor<i1>) -> tensor<16x1x6xi1> loc(#loc354)
    %63 = stablehlo.broadcast_in_dim %c_25, dims = [] : (tensor<i32>) -> tensor<1xi32> loc(#loc355)
    %64 = "stablehlo.scatter"(%62, %63, %51) <{indices_are_sorted = true, scatter_dimension_numbers = #stablehlo.scatter<update_window_dims = [0, 1], inserted_window_dims = [2], scatter_dims_to_operand_dims = [2]>, unique_indices = true}> ({
    ^bb0(%arg1: tensor<i1> loc("scatter:"(#loc46)), %arg2: tensor<i1> loc("scatter:"(#loc46))):
      stablehlo.return %arg2 : tensor<i1> loc(#loc356)
    }) : (tensor<16x1x6xi1>, tensor<1xi32>, tensor<16x1xi1>) -> tensor<16x1x6xi1> loc(#loc356)
    %65 = stablehlo.reshape %64 : (tensor<16x1x6xi1>) -> tensor<16x6xi1> loc(#loc357)
    %66 = call @_threefry_fold_in(%4, %c_15) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc555)
    %67 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc493)
    %68 = stablehlo.divide %67, %cst_14 : tensor<f32> loc(#loc494)
    %69 = call @_truncated_normal(%66, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc495)
    %70 = stablehlo.broadcast_in_dim %68, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc496)
    %71 = stablehlo.multiply %69, %70 : tensor<16x16xf32> loc(#loc496)
    %72 = call @_threefry_fold_in(%4, %c_11) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc556)
    %73 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc498)
    %74 = stablehlo.dot_general %61, %71, contracting_dims = [2] x [0] : (tensor<16x6x16xf32>, tensor<16x16xf32>) -> tensor<16x6x16xf32> loc(#loc499)
    %75 = stablehlo.reshape %73 : (tensor<16xf32>) -> tensor<1x1x16xf32> loc(#loc500)
    %76 = stablehlo.broadcast_in_dim %75, dims = [0, 1, 2] : (tensor<1x1x16xf32>) -> tensor<16x6x16xf32> loc(#loc501)
    %77 = stablehlo.add %74, %76 : tensor<16x6x16xf32> loc(#loc501)
    %78 = call @relu(%77) : (tensor<16x6x16xf32>) -> tensor<16x6x16xf32> loc(#loc450)
    %79 = call @_threefry_fold_in(%4, %c_10) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc557)
    %80 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc558)
    %81 = stablehlo.divide %80, %cst_14 : tensor<f32> loc(#loc559)
    %82 = call @_truncated_normal(%79, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc560)
    %83 = stablehlo.broadcast_in_dim %81, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc561)
    %84 = stablehlo.multiply %82, %83 : tensor<16x16xf32> loc(#loc561)
    %85 = stablehlo.reshape %84 : (tensor<16x16xf32>) -> tensor<16x2x8xf32> loc(#loc562)
    %86 = call @_threefry_fold_in(%4, %c_9) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc563)
    %87 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc564)
    %88 = stablehlo.reshape %87 : (tensor<16xf32>) -> tensor<2x8xf32> loc(#loc565)
    %89 = stablehlo.dot_general %78, %85, contracting_dims = [2] x [0] : (tensor<16x6x16xf32>, tensor<16x2x8xf32>) -> tensor<16x6x2x8xf32> loc(#loc508)
    %90 = stablehlo.reshape %88 : (tensor<2x8xf32>) -> tensor<1x1x2x8xf32> loc(#loc509)
    %91 = stablehlo.broadcast_in_dim %90, dims = [0, 1, 2, 3] : (tensor<1x1x2x8xf32>) -> tensor<16x6x2x8xf32> loc(#loc510)
    %92 = stablehlo.add %89, %91 : tensor<16x6x2x8xf32> loc(#loc510)
    %93 = call @_threefry_fold_in(%4, %c_8) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc566)
    %94 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc567)
    %95 = stablehlo.divide %94, %cst_14 : tensor<f32> loc(#loc568)
    %96 = call @_truncated_normal(%93, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc569)
    %97 = stablehlo.broadcast_in_dim %95, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc570)
    %98 = stablehlo.multiply %96, %97 : tensor<16x16xf32> loc(#loc570)
    %99 = stablehlo.reshape %98 : (tensor<16x16xf32>) -> tensor<16x2x8xf32> loc(#loc571)
    %100 = call @_threefry_fold_in(%4, %c_7) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc572)
    %101 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc573)
    %102 = stablehlo.reshape %101 : (tensor<16xf32>) -> tensor<2x8xf32> loc(#loc574)
    %103 = stablehlo.dot_general %78, %99, contracting_dims = [2] x [0] : (tensor<16x6x16xf32>, tensor<16x2x8xf32>) -> tensor<16x6x2x8xf32> loc(#loc517)
    %104 = stablehlo.reshape %102 : (tensor<2x8xf32>) -> tensor<1x1x2x8xf32> loc(#loc518)
    %105 = stablehlo.broadcast_in_dim %104, dims = [0, 1, 2, 3] : (tensor<1x1x2x8xf32>) -> tensor<16x6x2x8xf32> loc(#loc519)
    %106 = stablehlo.add %103, %105 : tensor<16x6x2x8xf32> loc(#loc519)
    %107 = stablehlo.concatenate %45, %106, dim = 1 : (tensor<16x96x2x8xf32>, tensor<16x6x2x8xf32>) -> tensor<16x102x2x8xf32> loc(#loc461)
    %108 = stablehlo.slice %107 [0:16, 6:102, 0:2, 0:8] : (tensor<16x102x2x8xf32>) -> tensor<16x96x2x8xf32> loc(#loc462)
    %109 = call @_threefry_fold_in(%4, %c_6) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc575)
    %110 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc576)
    %111 = stablehlo.divide %110, %cst_14 : tensor<f32> loc(#loc577)
    %112 = call @_truncated_normal(%109, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc578)
    %113 = stablehlo.broadcast_in_dim %111, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc579)
    %114 = stablehlo.multiply %112, %113 : tensor<16x16xf32> loc(#loc579)
    %115 = stablehlo.reshape %114 : (tensor<16x16xf32>) -> tensor<16x2x8xf32> loc(#loc580)
    %116 = call @_threefry_fold_in(%4, %c_5) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc581)
    %117 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc582)
    %118 = stablehlo.reshape %117 : (tensor<16xf32>) -> tensor<2x8xf32> loc(#loc583)
    %119 = stablehlo.convert %65 : (tensor<16x6xi1>) -> tensor<16x6xi32> loc(#loc526)
    %120 = stablehlo.concatenate %44, %119, dim = 1 : (tensor<16x96xi32>, tensor<16x6xi32>) -> tensor<16x102xi32> loc(#loc527)
    %121 = call @cumsum(%120) : (tensor<16x102xi32>) -> tensor<16x102xi32> loc(#loc528)
    %122 = stablehlo.slice %121 [0:16, 96:102] : (tensor<16x102xi32>) -> tensor<16x6xi32> loc(#loc529)
    %123 = stablehlo.broadcast_in_dim %122, dims = [0, 1] : (tensor<16x6xi32>) -> tensor<16x6x1xi32> loc(#loc530)
    %124 = stablehlo.slice %121 [0:16, 6:102] : (tensor<16x102xi32>) -> tensor<16x96xi32> loc(#loc531)
    %125 = stablehlo.broadcast_in_dim %124, dims = [0, 2] : (tensor<16x96xi32>) -> tensor<16x1x96xi32> loc(#loc532)
    %126 = stablehlo.broadcast_in_dim %123, dims = [0, 1, 2] : (tensor<16x6x1xi32>) -> tensor<16x6x96xi32> loc(#loc533)
    %127 = stablehlo.broadcast_in_dim %125, dims = [0, 1, 2] : (tensor<16x1x96xi32>) -> tensor<16x6x96xi32> loc(#loc533)
    %128 = stablehlo.compare EQ, %126, %127, SIGNED : (tensor<16x6x96xi32>, tensor<16x6x96xi32>) -> tensor<16x6x96xi1> loc(#loc533)
    %129 = stablehlo.iota dim = 0 : tensor<102xi32> loc(#loc534)
    %130 = stablehlo.slice %129 [96:102] : (tensor<102xi32>) -> tensor<6xi32> loc(#loc535)
    %131 = stablehlo.broadcast_in_dim %130, dims = [0] : (tensor<6xi32>) -> tensor<6x1xi32> loc(#loc536)
    %132 = stablehlo.slice %129 [6:102] : (tensor<102xi32>) -> tensor<96xi32> loc(#loc537)
    %133 = stablehlo.broadcast_in_dim %132, dims = [1] : (tensor<96xi32>) -> tensor<1x96xi32> loc(#loc538)
    %134 = stablehlo.broadcast_in_dim %131, dims = [0, 1] : (tensor<6x1xi32>) -> tensor<6x96xi32> loc(#loc539)
    %135 = stablehlo.broadcast_in_dim %133, dims = [0, 1] : (tensor<1x96xi32>) -> tensor<6x96xi32> loc(#loc539)
    %136 = stablehlo.compare GE, %134, %135, SIGNED : (tensor<6x96xi32>, tensor<6x96xi32>) -> tensor<6x96xi1> loc(#loc539)
    %137 = stablehlo.broadcast_in_dim %136, dims = [1, 2] : (tensor<6x96xi1>) -> tensor<1x6x96xi1> loc(#loc540)
    %138 = stablehlo.broadcast_in_dim %137, dims = [0, 1, 2] : (tensor<1x6x96xi1>) -> tensor<16x6x96xi1> loc(#loc541)
    %139 = stablehlo.and %128, %138 : tensor<16x6x96xi1> loc(#loc541)
    %140 = stablehlo.broadcast_in_dim %139, dims = [0, 2, 3] : (tensor<16x6x96xi1>) -> tensor<16x1x6x96xi1> loc(#loc542)
    %141 = stablehlo.reshape %92 : (tensor<16x6x2x8xf32>) -> tensor<16x6x2x1x8xf32> loc(#loc476)
    %142 = stablehlo.broadcast_in_dim %140, dims = [0, 1, 3, 4] : (tensor<16x1x6x96xi1>) -> tensor<16x1x1x6x96xi1> loc(#loc477)
    %143 = stablehlo.dot_general %141, %108, batching_dims = [0, 2] x [0, 2], contracting_dims = [4] x [3] : (tensor<16x6x2x1x8xf32>, tensor<16x96x2x8xf32>) -> tensor<16x2x6x1x96xf32> loc(#loc478)
    %144 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<16x2x6x1x96xf32> loc(#loc479)
    %145 = stablehlo.multiply %143, %144 : tensor<16x2x6x1x96xf32> loc(#loc479)
    %146 = stablehlo.broadcast_in_dim %c_19, dims = [] : (tensor<i1>) -> tensor<16x2x6x96xi1> loc(#loc480)
    %147 = stablehlo.broadcast_in_dim %146, dims = [1, 2, 3, 4] : (tensor<16x2x6x96xi1>) -> tensor<1x16x2x6x96xi1> loc(#loc480)
    %148 = stablehlo.transpose %142, dims = [2, 0, 1, 3, 4] : (tensor<16x1x1x6x96xi1>) -> tensor<1x16x1x6x96xi1> loc(#loc481)
    %149 = stablehlo.broadcast_in_dim %148, dims = [0, 1, 2, 3, 4] : (tensor<1x16x1x6x96xi1>) -> tensor<1x16x2x6x96xi1> loc(#loc482)
    %150 = stablehlo.and %147, %149 : tensor<1x16x2x6x96xi1> loc(#loc482)
    %151 = call @_where_21(%150, %145, %cst) : (tensor<1x16x2x6x96xi1>, tensor<16x2x6x1x96xf32>, tensor<f32>) -> tensor<1x16x2x6x96xf32> loc(#loc483)
    %152 = call @_threefry_fold_in(%4, %c_3) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc584)
    %153 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc585)
    %154 = stablehlo.divide %153, %cst_14 : tensor<f32> loc(#loc586)
    %155 = call @_truncated_normal(%152, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x16xf32> loc(#loc587)
    %156 = stablehlo.broadcast_in_dim %154, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc588)
    %157 = stablehlo.multiply %155, %156 : tensor<16x16xf32> loc(#loc588)
    %158 = stablehlo.reshape %157 : (tensor<16x16xf32>) -> tensor<2x8x16xf32> loc(#loc589)
    %159 = call @_threefry_fold_in(%4, %c_2) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc590)
    %160 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc591)
    %161 = call @_threefry_fold_in(%4, %c_1) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc428)
    %162 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc382)
    %163 = stablehlo.divide %162, %cst_14 : tensor<f32> loc(#loc383)
    %164 = call @_truncated_normal_22(%161, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x33xf32> loc(#loc384)
    %165 = stablehlo.broadcast_in_dim %163, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc385)
    %166 = stablehlo.multiply %164, %165 : tensor<16x33xf32> loc(#loc385)
    %167 = call @_threefry_fold_in(%4, %c_0) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc429)
    %168 = stablehlo.sqrt %cst_16 : tensor<f32> loc(#loc387)
    %169 = stablehlo.divide %168, %cst_14 : tensor<f32> loc(#loc388)
    %170 = call @_truncated_normal_27(%167, %c_13, %c_12) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<16x1xf32> loc(#loc389)
    %171 = stablehlo.broadcast_in_dim %169, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc390)
    %172 = stablehlo.multiply %170, %171 : tensor<16x1xf32> loc(#loc390)
    %173 = call @_threefry_fold_in(%4, %c) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc430)
    %174 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc392)
    %175 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc592)
    %176 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc592)
    %177 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc592)
    %178 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc592)
    %179 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc592)
    %180 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc592)
    %181 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8xf32> loc(#loc592)
    %182 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x2x8xf32> loc(#loc592)
    %183 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc592)
    %184 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8x16xf32> loc(#loc592)
    %185 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8xf32> loc(#loc592)
    %186 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x2x8xf32> loc(#loc592)
    %187 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8xf32> loc(#loc592)
    %188 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x2x8xf32> loc(#loc592)
    %189 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<33x16xf32> loc(#loc593)
    %190 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x33xf32> loc(#loc593)
    %191 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc593)
    %192 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x1xf32> loc(#loc593)
    %193 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc593)
    %194 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x16xf32> loc(#loc593)
    %195 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8xf32> loc(#loc593)
    %196 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x2x8xf32> loc(#loc593)
    %197 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16xf32> loc(#loc593)
    %198 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8x16xf32> loc(#loc593)
    %199 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8xf32> loc(#loc593)
    %200 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x2x8xf32> loc(#loc593)
    %201 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<2x8xf32> loc(#loc593)
    %202 = stablehlo.broadcast_in_dim %cst_21, dims = [] : (tensor<f32>) -> tensor<16x2x8xf32> loc(#loc593)
    return %c_25, %35, %36, %37, %38, %39, %40, %41, %42, %43, %21, %28, %29, %30, %31, %32, %33, %34, %44, %45, %46, %56, %166, %174, %172, %73, %71, %102, %99, %160, %158, %88, %85, %118, %115, %c_25, %175, %176, %177, %178, %179, %180, %181, %182, %183, %184, %185, %186, %187, %188, %189, %190, %191, %192, %193, %194, %195, %196, %197, %198, %199, %200, %201, %202 : tensor<i32>, tensor<16x5xi32>, tensor<16xi32>, tensor<16xf32>, tensor<16xi1>, tensor<16xi1>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16xf32>, tensor<16x5xi32>, tensor<16x5xi32>, tensor<16xi1>, tensor<16xi32>, tensor<16xi1>, tensor<16xi1>, tensor<16x5xi32>, tensor<16xi32>, tensor<16x96xi32>, tensor<16x96x2x8xf32>, tensor<16x96x2x8xf32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<16xf32>, tensor<2x8x16xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<i32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<16xf32>, tensor<2x8x16xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<33x16xf32>, tensor<16x33xf32>, tensor<1xf32>, tensor<16x1xf32>, tensor<16xf32>, tensor<16x16xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<16xf32>, tensor<2x8x16xf32>, tensor<2x8xf32>, tensor<16x2x8xf32>, tensor<2x8xf32>, tensor<16x2x8xf32> loc(#loc262)
  } loc(#loc)
  func.func private @_threefry_split(%arg0: tensor<2xui32> loc(unknown)) -> tensor<3x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc253)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc253)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc254)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc255)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc254)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc255)
    %4 = stablehlo.iota dim = 0 : tensor<3xui64> loc(#loc253)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc253)
    %6 = stablehlo.multiply %5, %4 : tensor<3xui64> loc(#loc253)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc253)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<3xui64> loc(#loc253)
    %9 = stablehlo.convert %6 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc253)
    %10 = stablehlo.convert %8 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc253)
    %11:2 = call @threefry2x32(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<3xui32>, tensor<3xui32>) -> (tensor<3xui32>, tensor<3xui32>) loc(#loc150)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc256)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc256)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<3x1xui32>, tensor<3x1xui32>) -> tensor<3x2xui32> loc(#loc256)
    return %14 : tensor<3x2xui32> loc(#loc)
  } loc(#loc272)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg1: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg2: tensor<3xui32> loc("RecurrentPPO.init"(#loc4)), %arg3: tensor<3xui32> loc("RecurrentPPO.init"(#loc4))) -> (tensor<3xui32>, tensor<3xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc242)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc242)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc242)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc257)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc257)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc258)
    %3 = stablehlo.add %arg2, %2 : tensor<3xui32> loc(#loc258)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc258)
    %5 = stablehlo.add %arg3, %4 : tensor<3xui32> loc(#loc258)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc299)
      stablehlo.return %7 : tensor<i1> loc(#loc273)
    } do {
      %7:8 = func.call @closed_call(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc300)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc301)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc273)
    } loc(#loc273)
    return %6#2, %6#3 : tensor<3xui32>, tensor<3xui32> loc(#loc150)
  } loc(#loc150)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<3xui32> loc(unknown), %arg2: tensor<3xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc97)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %3 = stablehlo.add %arg1, %arg2 : tensor<3xui32> loc(#loc97)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc100)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<3xui32> loc(#loc100)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc101)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc102)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<3xui32> loc(#loc102)
    %9 = stablehlo.or %5, %8 : tensor<3xui32> loc(#loc103)
    %10 = stablehlo.xor %3, %9 : tensor<3xui32> loc(#loc104)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %13 = stablehlo.add %3, %10 : tensor<3xui32> loc(#loc97)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc100)
    %15 = stablehlo.shift_left %10, %14 : tensor<3xui32> loc(#loc100)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc101)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc102)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<3xui32> loc(#loc102)
    %19 = stablehlo.or %15, %18 : tensor<3xui32> loc(#loc103)
    %20 = stablehlo.xor %13, %19 : tensor<3xui32> loc(#loc104)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %23 = stablehlo.add %13, %20 : tensor<3xui32> loc(#loc97)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc100)
    %25 = stablehlo.shift_left %20, %24 : tensor<3xui32> loc(#loc100)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc101)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc102)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<3xui32> loc(#loc102)
    %29 = stablehlo.or %25, %28 : tensor<3xui32> loc(#loc103)
    %30 = stablehlo.xor %23, %29 : tensor<3xui32> loc(#loc104)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %33 = stablehlo.add %23, %30 : tensor<3xui32> loc(#loc97)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc100)
    %35 = stablehlo.shift_left %30, %34 : tensor<3xui32> loc(#loc100)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc101)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc102)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<3xui32> loc(#loc102)
    %39 = stablehlo.or %35, %38 : tensor<3xui32> loc(#loc103)
    %40 = stablehlo.xor %33, %39 : tensor<3xui32> loc(#loc104)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc97)
    %42 = stablehlo.add %33, %41 : tensor<3xui32> loc(#loc97)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc97)
    %44 = stablehlo.add %40, %43 : tensor<3xui32> loc(#loc97)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc97)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc105)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc97)
    %48 = stablehlo.add %44, %47 : tensor<3xui32> loc(#loc97)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc275)
  func.func private @_threefry_split_0(%arg0: tensor<2xui32> loc(unknown)) -> tensor<16x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc277)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc277)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc278)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc279)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc278)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc279)
    %4 = stablehlo.iota dim = 0 : tensor<16xui64> loc(#loc277)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<16xui64> loc(#loc277)
    %6 = stablehlo.multiply %5, %4 : tensor<16xui64> loc(#loc277)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<16xui64> loc(#loc277)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<16xui64> loc(#loc277)
    %9 = stablehlo.convert %6 : (tensor<16xui64>) -> tensor<16xui32> loc(#loc277)
    %10 = stablehlo.convert %8 : (tensor<16xui64>) -> tensor<16xui32> loc(#loc277)
    %11:2 = call @threefry2x32_1(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<16xui32>, tensor<16xui32>) -> (tensor<16xui32>, tensor<16xui32>) loc(#loc261)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<16xui32>) -> tensor<16x1xui32> loc(#loc280)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<16xui32>) -> tensor<16x1xui32> loc(#loc280)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<16x1xui32>, tensor<16x1xui32>) -> tensor<16x2xui32> loc(#loc280)
    return %14 : tensor<16x2xui32> loc(#loc)
  } loc(#loc302)
  func.func private @threefry2x32_1(%arg0: tensor<ui32> loc(callsite(#loc243 at #loc244)), %arg1: tensor<ui32> loc(callsite(#loc243 at #loc244)), %arg2: tensor<16xui32> loc(callsite(#loc243 at #loc244)), %arg3: tensor<16xui32> loc(callsite(#loc243 at #loc244))) -> (tensor<16xui32>, tensor<16xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc242)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc242)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc242)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc281)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc281)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc282)
    %3 = stablehlo.add %arg2, %2 : tensor<16xui32> loc(#loc282)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc282)
    %5 = stablehlo.add %arg3, %4 : tensor<16xui32> loc(#loc282)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc327)
      stablehlo.return %7 : tensor<i1> loc(#loc303)
    } do {
      %7:8 = func.call @closed_call_2(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc328)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc329)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc303)
    } loc(#loc303)
    return %6#2, %6#3 : tensor<16xui32>, tensor<16xui32> loc(#loc261)
  } loc(#loc261)
  func.func private @closed_call_2(%arg0: tensor<i32> loc(unknown), %arg1: tensor<16xui32> loc(unknown), %arg2: tensor<16xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<16xui32>, tensor<16xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc97)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %3 = stablehlo.add %arg1, %arg2 : tensor<16xui32> loc(#loc97)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc100)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<16xui32> loc(#loc100)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc101)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc102)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<16xui32> loc(#loc102)
    %9 = stablehlo.or %5, %8 : tensor<16xui32> loc(#loc103)
    %10 = stablehlo.xor %3, %9 : tensor<16xui32> loc(#loc104)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %13 = stablehlo.add %3, %10 : tensor<16xui32> loc(#loc97)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc100)
    %15 = stablehlo.shift_left %10, %14 : tensor<16xui32> loc(#loc100)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc101)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc102)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<16xui32> loc(#loc102)
    %19 = stablehlo.or %15, %18 : tensor<16xui32> loc(#loc103)
    %20 = stablehlo.xor %13, %19 : tensor<16xui32> loc(#loc104)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %23 = stablehlo.add %13, %20 : tensor<16xui32> loc(#loc97)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc100)
    %25 = stablehlo.shift_left %20, %24 : tensor<16xui32> loc(#loc100)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc101)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc102)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<16xui32> loc(#loc102)
    %29 = stablehlo.or %25, %28 : tensor<16xui32> loc(#loc103)
    %30 = stablehlo.xor %23, %29 : tensor<16xui32> loc(#loc104)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc98)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc99)
    %33 = stablehlo.add %23, %30 : tensor<16xui32> loc(#loc97)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc100)
    %35 = stablehlo.shift_left %30, %34 : tensor<16xui32> loc(#loc100)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc101)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<16xui32> loc(#loc102)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<16xui32> loc(#loc102)
    %39 = stablehlo.or %35, %38 : tensor<16xui32> loc(#loc103)
    %40 = stablehlo.xor %33, %39 : tensor<16xui32> loc(#loc104)
