#loc = loc(unknown)
#loc1 = loc("key")
#loc4 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":298:50 to :74)
#loc33 = loc("/Users/noahfarr/reinforcement-learning/.venv/lib/python3.13/site-packages/flax/linen/linear.py":263:13 to 268:5)
#loc34 = loc("/Users/noahfarr/noahfarr.github.io/tools/whlo/export_ppo_wordle.py":121:24 to :77)
#loc35 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":307:17 to 314:9)
#loc98 = loc("/Users/noahfarr/reinforcement-learning/src/environments/environments/wrappers/vectorize.py":31:15 to :51)
#loc99 = loc("/Users/noahfarr/reinforcement-learning/src/algorithms/algorithms/recurrent_ppo.py":85:38 to 87:9)
#loc105 = loc("vmap()")
#loc127 = loc("erf")
#loc132 = loc("reduce_window_sum")
#loc136 = loc("RecurrentPPO.init"(#loc4))
#loc165 = loc("Dense.__call__"(#loc33))
#loc166 = loc("MaskedActorCriticNetwork.__call__"(#loc34))
#loc167 = loc("RecurrentPPO.init"(#loc35))
#loc221 = loc("Vectorize.step"(#loc98))
#loc222 = loc("RecurrentPPO.rollout"(#loc99))
#loc226 = loc("reduce_window_sum:"(#loc132))
#loc229 = loc(callsite(#loc166 at #loc167))
#loc239 = loc(callsite(#loc221 at #loc222))
#loc247 = loc(callsite(#loc165 at #loc229))
module @jit_init attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32> loc("key")) -> (tensor<i32> {jax.result_info = "result.step"}, tensor<64x16xi1> {jax.result_info = "result.timestep.obs['action_mask']"}, tensor<64x15xf32> {jax.result_info = "result.timestep.obs['observation']"}, tensor<64xi32> {jax.result_info = "result.timestep.action"}, tensor<64xf32> {jax.result_info = "result.timestep.reward"}, tensor<64xi1> {jax.result_info = "result.timestep.terminated"}, tensor<64xi1> {jax.result_info = "result.timestep.truncated"}, tensor<64xf32> {jax.result_info = "result.timestep.info['guess_count']"}, tensor<64xf32> {jax.result_info = "result.timestep.info['illegal_guesses']"}, tensor<64xf32> {jax.result_info = "result.timestep.info['matched_secret']"}, tensor<64x5xi32> {jax.result_info = "result.environment_state.secret_answer"}, tensor<64x5xi32> {jax.result_info = "result.environment_state.guess_feedback"}, tensor<64xi1> {jax.result_info = "result.environment_state.guess_revealed"}, tensor<64xi32> {jax.result_info = "result.environment_state.guess_count"}, tensor<64xi1> {jax.result_info = "result.environment_state.matched_secret"}, tensor<64x16xi32> {jax.result_info = "result.carry[1].done"}, tensor<64x16x2x16xf32> {jax.result_info = "result.carry[1].key"}, tensor<64x16x2x16xf32> {jax.result_info = "result.carry[1].value"}, tensor<32x16xf32> {jax.result_info = "result.params['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.params['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.params['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.params['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['key']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['key']['kernel']"}, tensor<32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['output_projection']['bias']"}, tensor<2x16x32xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['output_projection']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['query']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['query']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['value']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.params['params']['torso']['blocks_1']['value']['kernel']"}, tensor<i32> {jax.result_info = "result.optimizer_state[1][0].count"}, tensor<32x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['key']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['key']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['output_projection']['bias']"}, tensor<2x16x32xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['output_projection']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['query']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['query']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['value']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.optimizer_state[1][0].mu['params']['torso']['blocks_1']['value']['kernel']"}, tensor<32x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['actor']['kernel']"}, tensor<1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['critic']['bias']"}, tensor<32x1xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['critic']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['obs']['bias']"}, tensor<15x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['obs']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_0']['Dense_0']['bias']"}, tensor<48x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_0']['Dense_0']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['key']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['key']['kernel']"}, tensor<32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['output_projection']['bias']"}, tensor<2x16x32xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['output_projection']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['query']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['query']['kernel']"}, tensor<2x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['value']['bias']"}, tensor<32x2x16xf32> {jax.result_info = "result.optimizer_state[1][0].nu['params']['torso']['blocks_1']['value']['kernel']"}) {
    %c = stablehlo.constant dense<3831938679> : tensor<ui32> loc(#loc240)
    %c_0 = stablehlo.constant dense<3491981184> : tensor<ui32> loc(#loc240)
    %cst = stablehlo.constant dense<-3.40282347E+38> : tensor<f32> loc(#loc240)
    %c_1 = stablehlo.constant dense<2876566538> : tensor<ui32> loc(#loc240)
    %c_2 = stablehlo.constant dense<1084336556> : tensor<ui32> loc(#loc240)
    %c_3 = stablehlo.constant dense<1674886045> : tensor<ui32> loc(#loc240)
    %cst_4 = stablehlo.constant dense<0xFF800000> : tensor<f32> loc(#loc)
    %cst_5 = stablehlo.constant dense<-2.38197633E+38> : tensor<f32> loc(#loc240)
    %cst_6 = stablehlo.constant dense<2.500000e-01> : tensor<f32> loc(#loc240)
    %c_7 = stablehlo.constant dense<765341026> : tensor<ui32> loc(#loc240)
    %c_8 = stablehlo.constant dense<647299094> : tensor<ui32> loc(#loc240)
    %c_9 = stablehlo.constant dense<3894293043> : tensor<ui32> loc(#loc240)
    %c_10 = stablehlo.constant dense<440882211> : tensor<ui32> loc(#loc240)
    %c_11 = stablehlo.constant dense<1902230596> : tensor<ui32> loc(#loc240)
    %cst_12 = stablehlo.constant dense<3.125000e-02> : tensor<f32> loc(#loc)
    %c_13 = stablehlo.constant dense<847609177> : tensor<ui32> loc(#loc240)
    %c_14 = stablehlo.constant dense<3178254832> : tensor<ui32> loc(#loc240)
    %cst_15 = stablehlo.constant dense<0.020833334> : tensor<f32> loc(#loc240)
    %c_16 = stablehlo.constant dense<1157806390> : tensor<ui32> loc(#loc240)
    %c_17 = stablehlo.constant dense<3085490160> : tensor<ui32> loc(#loc240)
    %c_18 = stablehlo.constant dense<2> : tensor<i32> loc(#loc)
    %c_19 = stablehlo.constant dense<-2> : tensor<i32> loc(#loc)
    %cst_20 = stablehlo.constant dense<0.879625678> : tensor<f32> loc(#loc)
    %cst_21 = stablehlo.constant dense<0.0666666701> : tensor<f32> loc(#loc240)
    %c_22 = stablehlo.constant dense<2075703144> : tensor<ui32> loc(#loc240)
    %c_23 = stablehlo.constant dense<1> : tensor<i32> loc(#loc240)
    %c_24 = stablehlo.constant dense<true> : tensor<i1> loc(#loc)
    %cst_25 = stablehlo.constant dense<0.000000e+00> : tensor<f32> loc(#loc)
    %c_26 = stablehlo.constant dense<false> : tensor<i1> loc(#loc)
    %c_27 = stablehlo.constant dense<5> : tensor<i32> loc(#loc240)
    %c_28 = stablehlo.constant dense<16> : tensor<i32> loc(#loc)
    %c_29 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_30 = stablehlo.constant dense<[[0, 20, 3, 8, 14], [1, 17, 8, 2, 10], [2, 7, 0, 8, 17], [2, 11, 14, 20, 3], [2, 17, 0, 13, 4], [5, 11, 8, 13, 19], [5, 17, 14, 18, 19], [6, 11, 0, 25, 4], [6, 17, 0, 15, 4], [7, 14, 20, 18, 4], [11, 4, 12, 14, 13], [12, 14, 20, 13, 3], [15, 11, 0, 13, 19], [18, 11, 0, 19, 4], [18, 15, 0, 3, 4], [18, 19, 14, 17, 12]]> : tensor<16x5xi32> loc(#loc240)
    %0 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<3x2xui32> loc(#loc300)
    %1 = stablehlo.slice %0 [0:1, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc264)
    %2 = stablehlo.reshape %1 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc265)
    %3 = stablehlo.slice %0 [1:2, 0:2] : (tensor<3x2xui32>) -> tensor<1x2xui32> loc(#loc264)
    %4 = stablehlo.reshape %3 : (tensor<1x2xui32>) -> tensor<2xui32> loc(#loc265)
    %5 = call @_threefry_split_0(%2) : (tensor<2xui32>) -> tensor<64x2xui32> loc(#loc333)
    %6 = stablehlo.broadcast_in_dim %5, dims = [0, 2] : (tensor<64x2xui32>) -> tensor<64x1x2xui32> loc(#loc302)
    %7 = stablehlo.reshape %6 : (tensor<64x1x2xui32>) -> tensor<64x2xui32> loc(#loc303)
    %8 = call @_randint(%7, %c_29, %c_28) : (tensor<64x2xui32>, tensor<i32>, tensor<i32>) -> tensor<64xi32> loc(#loc400)
    %9 = stablehlo.broadcast_in_dim %c_29, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc401)
    %10 = stablehlo.compare LT, %8, %9, SIGNED : (tensor<64xi32>, tensor<64xi32>) -> tensor<64xi1> loc(#loc401)
    %11 = stablehlo.broadcast_in_dim %c_28, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc402)
    %12 = stablehlo.add %8, %11 : tensor<64xi32> loc(#loc402)
    %13 = stablehlo.select %10, %12, %8 : tensor<64xi1>, tensor<64xi32> loc(#loc403)
    %14 = stablehlo.compare LT, %c_29, %c_29, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc401)
    %15 = stablehlo.add %c_29, %c_27 : tensor<i32> loc(#loc402)
    %16 = stablehlo.select %14, %15, %c_29 : tensor<i1>, tensor<i32> loc(#loc403)
    %17 = stablehlo.broadcast_in_dim %13, dims = [0] : (tensor<64xi32>) -> tensor<64x1xi32> loc(#loc404)
    %18 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<i32>) -> tensor<64x1xi32> loc(#loc404)
    %19 = stablehlo.concatenate %17, %18, dim = 1 : (tensor<64x1xi32>, tensor<64x1xi32>) -> tensor<64x2xi32> loc(#loc405)
    %20 = "stablehlo.gather"(%c_30, %19) <{dimension_numbers = #stablehlo.gather<offset_dims = [1, 2], start_index_map = [0, 1], index_vector_dim = 1>, slice_sizes = array<i64: 1, 5>}> : (tensor<16x5xi32>, tensor<64x2xi32>) -> tensor<64x1x5xi32> loc(#loc406)
    %21 = stablehlo.reshape %20 : (tensor<64x1x5xi32>) -> tensor<64x5xi32> loc(#loc407)
    %22 = stablehlo.broadcast_in_dim %c_29, dims = [] : (tensor<i32>) -> tensor<5xi32> loc(#loc408)
    %23 = call @_one_hot(%22) : (tensor<5xi32>) -> tensor<5x3xf32> loc(#loc477)
    %24 = stablehlo.reshape %23 : (tensor<5x3xf32>) -> tensor<15xf32> loc(#loc478)
    %25 = call @_where(%c_26, %24, %cst_25) : (tensor<i1>, tensor<15xf32>, tensor<f32>) -> tensor<15xf32> loc(#loc479)
    %26 = stablehlo.broadcast_in_dim %c_24, dims = [] : (tensor<i1>) -> tensor<16xi1> loc(#loc412)
    %27 = stablehlo.broadcast_in_dim %22, dims = [1] : (tensor<5xi32>) -> tensor<64x5xi32> loc(#loc305)
    %28 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc305)
    %29 = stablehlo.broadcast_in_dim %c_29, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc305)
    %30 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc305)
    %31 = stablehlo.broadcast_in_dim %26, dims = [1] : (tensor<16xi1>) -> tensor<64x16xi1> loc(#loc305)
    %32 = stablehlo.broadcast_in_dim %25, dims = [1] : (tensor<15xf32>) -> tensor<64x15xf32> loc(#loc305)
    %33 = stablehlo.broadcast_in_dim %c_29, dims = [] : (tensor<i32>) -> tensor<64xi32> loc(#loc305)
    %34 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc305)
    %35 = stablehlo.broadcast_in_dim %c_24, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc305)
    %36 = stablehlo.broadcast_in_dim %c_26, dims = [] : (tensor<i1>) -> tensor<64xi1> loc(#loc305)
    %37 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc305)
    %38 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc305)
    %39 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<64xf32> loc(#loc305)
    %40 = stablehlo.broadcast_in_dim %c_23, dims = [] : (tensor<i32>) -> tensor<64x16xi32> loc(#loc413)
    %41 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<64x16x2x16xf32> loc(#loc414)
    %42 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<64x16x2x16xf32> loc(#loc415)
    %43 = stablehlo.broadcast_in_dim %31, dims = [0, 2] : (tensor<64x16xi1>) -> tensor<64x1x16xi1> loc(#loc337)
    %44 = stablehlo.broadcast_in_dim %32, dims = [0, 2] : (tensor<64x15xf32>) -> tensor<64x1x15xf32> loc(#loc337)
    %45 = stablehlo.broadcast_in_dim %33, dims = [0] : (tensor<64xi32>) -> tensor<64x1xi32> loc(#loc337)
    %46 = stablehlo.broadcast_in_dim %35, dims = [0] : (tensor<64xi1>) -> tensor<64x1xi1> loc(#loc337)
    %47 = stablehlo.broadcast_in_dim %36, dims = [0] : (tensor<64xi1>) -> tensor<64x1xi1> loc(#loc337)
    %48 = stablehlo.or %46, %47 : tensor<64x1xi1> loc(#loc308)
    %49 = call @_threefry_fold_in(%4, %c_22) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc379)
    %50 = stablehlo.sqrt %cst_21 : tensor<f32> loc(#loc339)
    %51 = stablehlo.divide %50, %cst_20 : tensor<f32> loc(#loc340)
    %52 = call @_truncated_normal(%49, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<15x32xf32> loc(#loc341)
    %53 = stablehlo.broadcast_in_dim %51, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc342)
    %54 = stablehlo.multiply %52, %53 : tensor<15x32xf32> loc(#loc342)
    %55 = call @_threefry_fold_in(%4, %c_17) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc380)
    %56 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc344)
    %57 = stablehlo.dot_general %44, %54, contracting_dims = [2] x [0] : (tensor<64x1x15xf32>, tensor<15x32xf32>) -> tensor<64x1x32xf32> loc(#loc345)
    %58 = stablehlo.reshape %56 : (tensor<32xf32>) -> tensor<1x1x32xf32> loc(#loc346)
    %59 = stablehlo.broadcast_in_dim %58, dims = [0, 1, 2] : (tensor<1x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc347)
    %60 = stablehlo.add %57, %59 : tensor<64x1x32xf32> loc(#loc347)
    %61 = call @relu(%60) : (tensor<64x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc314)
    %62 = call @_one_hot_14(%45) : (tensor<64x1xi32>) -> tensor<64x1x16xf32> loc(#loc315)
    %63 = stablehlo.concatenate %61, %62, dim = 2 : (tensor<64x1x32xf32>, tensor<64x1x16xf32>) -> tensor<64x1x48xf32> loc(#loc316)
    %64 = call @_threefry_fold_in(%4, %c_16) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc550)
    %65 = stablehlo.sqrt %cst_15 : tensor<f32> loc(#loc481)
    %66 = stablehlo.divide %65, %cst_20 : tensor<f32> loc(#loc482)
    %67 = call @_truncated_normal_15(%64, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<48x32xf32> loc(#loc483)
    %68 = stablehlo.broadcast_in_dim %66, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc484)
    %69 = stablehlo.multiply %67, %68 : tensor<48x32xf32> loc(#loc484)
    %70 = call @_threefry_fold_in(%4, %c_14) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc551)
    %71 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc486)
    %72 = stablehlo.dot_general %63, %69, contracting_dims = [2] x [0] : (tensor<64x1x48xf32>, tensor<48x32xf32>) -> tensor<64x1x32xf32> loc(#loc487)
    %73 = stablehlo.reshape %71 : (tensor<32xf32>) -> tensor<1x1x32xf32> loc(#loc488)
    %74 = stablehlo.broadcast_in_dim %73, dims = [0, 1, 2] : (tensor<1x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc489)
    %75 = stablehlo.add %72, %74 : tensor<64x1x32xf32> loc(#loc489)
    %76 = call @relu(%75) : (tensor<64x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc421)
    %77 = call @_threefry_fold_in(%4, %c_13) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc552)
    %78 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc553)
    %79 = stablehlo.divide %78, %cst_20 : tensor<f32> loc(#loc554)
    %80 = call @_truncated_normal_20(%77, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc555)
    %81 = stablehlo.broadcast_in_dim %79, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc556)
    %82 = stablehlo.multiply %80, %81 : tensor<32x32xf32> loc(#loc556)
    %83 = stablehlo.reshape %82 : (tensor<32x32xf32>) -> tensor<32x2x16xf32> loc(#loc557)
    %84 = call @_threefry_fold_in(%4, %c_11) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc558)
    %85 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc559)
    %86 = stablehlo.reshape %85 : (tensor<32xf32>) -> tensor<2x16xf32> loc(#loc560)
    %87 = stablehlo.dot_general %76, %83, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x2x16xf32>) -> tensor<64x1x2x16xf32> loc(#loc496)
    %88 = stablehlo.reshape %86 : (tensor<2x16xf32>) -> tensor<1x1x2x16xf32> loc(#loc497)
    %89 = stablehlo.broadcast_in_dim %88, dims = [0, 1, 2, 3] : (tensor<1x1x2x16xf32>) -> tensor<64x1x2x16xf32> loc(#loc498)
    %90 = stablehlo.add %87, %89 : tensor<64x1x2x16xf32> loc(#loc498)
    %91 = call @_threefry_fold_in(%4, %c_10) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc561)
    %92 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc562)
    %93 = stablehlo.divide %92, %cst_20 : tensor<f32> loc(#loc563)
    %94 = call @_truncated_normal_20(%91, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc564)
    %95 = stablehlo.broadcast_in_dim %93, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc565)
    %96 = stablehlo.multiply %94, %95 : tensor<32x32xf32> loc(#loc565)
    %97 = stablehlo.reshape %96 : (tensor<32x32xf32>) -> tensor<32x2x16xf32> loc(#loc566)
    %98 = call @_threefry_fold_in(%4, %c_9) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc567)
    %99 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc568)
    %100 = stablehlo.reshape %99 : (tensor<32xf32>) -> tensor<2x16xf32> loc(#loc569)
    %101 = stablehlo.dot_general %76, %97, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x2x16xf32>) -> tensor<64x1x2x16xf32> loc(#loc505)
    %102 = stablehlo.reshape %100 : (tensor<2x16xf32>) -> tensor<1x1x2x16xf32> loc(#loc506)
    %103 = stablehlo.broadcast_in_dim %102, dims = [0, 1, 2, 3] : (tensor<1x1x2x16xf32>) -> tensor<64x1x2x16xf32> loc(#loc507)
    %104 = stablehlo.add %101, %103 : tensor<64x1x2x16xf32> loc(#loc507)
    %105 = stablehlo.concatenate %41, %104, dim = 1 : (tensor<64x16x2x16xf32>, tensor<64x1x2x16xf32>) -> tensor<64x17x2x16xf32> loc(#loc432)
    %106 = stablehlo.slice %105 [0:64, 1:17, 0:2, 0:16] : (tensor<64x17x2x16xf32>) -> tensor<64x16x2x16xf32> loc(#loc433)
    %107 = call @_threefry_fold_in(%4, %c_8) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc570)
    %108 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc571)
    %109 = stablehlo.divide %108, %cst_20 : tensor<f32> loc(#loc572)
    %110 = call @_truncated_normal_20(%107, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc573)
    %111 = stablehlo.broadcast_in_dim %109, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc574)
    %112 = stablehlo.multiply %110, %111 : tensor<32x32xf32> loc(#loc574)
    %113 = stablehlo.reshape %112 : (tensor<32x32xf32>) -> tensor<32x2x16xf32> loc(#loc575)
    %114 = call @_threefry_fold_in(%4, %c_7) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc576)
    %115 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc577)
    %116 = stablehlo.reshape %115 : (tensor<32xf32>) -> tensor<2x16xf32> loc(#loc578)
    %117 = stablehlo.dot_general %76, %113, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x2x16xf32>) -> tensor<64x1x2x16xf32> loc(#loc514)
    %118 = stablehlo.reshape %116 : (tensor<2x16xf32>) -> tensor<1x1x2x16xf32> loc(#loc515)
    %119 = stablehlo.broadcast_in_dim %118, dims = [0, 1, 2, 3] : (tensor<1x1x2x16xf32>) -> tensor<64x1x2x16xf32> loc(#loc516)
    %120 = stablehlo.add %117, %119 : tensor<64x1x2x16xf32> loc(#loc516)
    %121 = stablehlo.concatenate %42, %120, dim = 1 : (tensor<64x16x2x16xf32>, tensor<64x1x2x16xf32>) -> tensor<64x17x2x16xf32> loc(#loc439)
    %122 = stablehlo.slice %121 [0:64, 1:17, 0:2, 0:16] : (tensor<64x17x2x16xf32>) -> tensor<64x16x2x16xf32> loc(#loc440)
    %123 = stablehlo.convert %48 : (tensor<64x1xi1>) -> tensor<64x1xi32> loc(#loc517)
    %124 = stablehlo.concatenate %40, %123, dim = 1 : (tensor<64x16xi32>, tensor<64x1xi32>) -> tensor<64x17xi32> loc(#loc518)
    %125 = call @cumsum(%124) : (tensor<64x17xi32>) -> tensor<64x17xi32> loc(#loc519)
    %126 = stablehlo.slice %125 [0:64, 16:17] : (tensor<64x17xi32>) -> tensor<64x1xi32> loc(#loc520)
    %127 = stablehlo.broadcast_in_dim %126, dims = [0, 1] : (tensor<64x1xi32>) -> tensor<64x1x1xi32> loc(#loc521)
    %128 = stablehlo.slice %125 [0:64, 1:17] : (tensor<64x17xi32>) -> tensor<64x16xi32> loc(#loc522)
    %129 = stablehlo.broadcast_in_dim %128, dims = [0, 2] : (tensor<64x16xi32>) -> tensor<64x1x16xi32> loc(#loc523)
    %130 = stablehlo.broadcast_in_dim %127, dims = [0, 1, 2] : (tensor<64x1x1xi32>) -> tensor<64x1x16xi32> loc(#loc524)
    %131 = stablehlo.compare EQ, %130, %129, SIGNED : (tensor<64x1x16xi32>, tensor<64x1x16xi32>) -> tensor<64x1x16xi1> loc(#loc524)
    %132 = stablehlo.iota dim = 0 : tensor<17xi32> loc(#loc525)
    %133 = stablehlo.slice %132 [16:17] : (tensor<17xi32>) -> tensor<1xi32> loc(#loc526)
    %134 = stablehlo.broadcast_in_dim %133, dims = [0] : (tensor<1xi32>) -> tensor<1x1xi32> loc(#loc527)
    %135 = stablehlo.slice %132 [1:17] : (tensor<17xi32>) -> tensor<16xi32> loc(#loc528)
    %136 = stablehlo.broadcast_in_dim %135, dims = [1] : (tensor<16xi32>) -> tensor<1x16xi32> loc(#loc529)
    %137 = stablehlo.broadcast_in_dim %134, dims = [0, 1] : (tensor<1x1xi32>) -> tensor<1x16xi32> loc(#loc530)
    %138 = stablehlo.compare GE, %137, %136, SIGNED : (tensor<1x16xi32>, tensor<1x16xi32>) -> tensor<1x16xi1> loc(#loc530)
    %139 = stablehlo.broadcast_in_dim %138, dims = [1, 2] : (tensor<1x16xi1>) -> tensor<1x1x16xi1> loc(#loc531)
    %140 = stablehlo.broadcast_in_dim %139, dims = [0, 1, 2] : (tensor<1x1x16xi1>) -> tensor<64x1x16xi1> loc(#loc532)
    %141 = stablehlo.and %131, %140 : tensor<64x1x16xi1> loc(#loc532)
    %142 = stablehlo.broadcast_in_dim %141, dims = [0, 2, 3] : (tensor<64x1x16xi1>) -> tensor<64x1x1x16xi1> loc(#loc533)
    %143 = stablehlo.reshape %90 : (tensor<64x1x2x16xf32>) -> tensor<64x1x2x1x16xf32> loc(#loc452)
    %144 = stablehlo.broadcast_in_dim %142, dims = [0, 1, 3, 4] : (tensor<64x1x1x16xi1>) -> tensor<64x1x1x1x16xi1> loc(#loc453)
    %145 = stablehlo.dot_general %143, %106, batching_dims = [0, 2] x [0, 2], contracting_dims = [4] x [3] : (tensor<64x1x2x1x16xf32>, tensor<64x16x2x16xf32>) -> tensor<64x2x1x1x16xf32> loc(#loc454)
    %146 = stablehlo.broadcast_in_dim %cst_6, dims = [] : (tensor<f32>) -> tensor<64x2x1x1x16xf32> loc(#loc455)
    %147 = stablehlo.multiply %145, %146 : tensor<64x2x1x1x16xf32> loc(#loc455)
    %148 = stablehlo.broadcast_in_dim %c_24, dims = [] : (tensor<i1>) -> tensor<64x2x1x16xi1> loc(#loc456)
    %149 = stablehlo.broadcast_in_dim %148, dims = [1, 2, 3, 4] : (tensor<64x2x1x16xi1>) -> tensor<1x64x2x1x16xi1> loc(#loc456)
    %150 = stablehlo.transpose %144, dims = [2, 0, 1, 3, 4] : (tensor<64x1x1x1x16xi1>) -> tensor<1x64x1x1x16xi1> loc(#loc457)
    %151 = stablehlo.broadcast_in_dim %150, dims = [0, 1, 2, 3, 4] : (tensor<1x64x1x1x16xi1>) -> tensor<1x64x2x1x16xi1> loc(#loc458)
    %152 = stablehlo.and %149, %151 : tensor<1x64x2x1x16xi1> loc(#loc458)
    %153 = call @_where_26(%152, %147, %cst_5) : (tensor<1x64x2x1x16xi1>, tensor<64x2x1x1x16xf32>, tensor<f32>) -> tensor<1x64x2x1x16xf32> loc(#loc459)
    %154 = stablehlo.reduce(%153 init: %cst_4) applies stablehlo.maximum across dimensions = [4] : (tensor<1x64x2x1x16xf32>, tensor<f32>) -> tensor<1x64x2x1xf32> loc(#loc460)
    %155 = stablehlo.broadcast_in_dim %cst_4, dims = [] : (tensor<f32>) -> tensor<1x64x2x1xf32> loc(#loc461)
    %156 = stablehlo.maximum %155, %154 : tensor<1x64x2x1xf32> loc(#loc461)
    %157 = stablehlo.broadcast_in_dim %156, dims = [0, 1, 2, 3] : (tensor<1x64x2x1xf32>) -> tensor<1x64x2x1x1xf32> loc(#loc456)
    %158 = stablehlo.broadcast_in_dim %157, dims = [0, 1, 2, 3, 4] : (tensor<1x64x2x1x1xf32>) -> tensor<1x64x2x1x16xf32> loc(#loc462)
    %159 = stablehlo.subtract %153, %158 : tensor<1x64x2x1x16xf32> loc(#loc462)
    %160 = stablehlo.exponential %159 : tensor<1x64x2x1x16xf32> loc(#loc463)
    %161 = stablehlo.reduce(%160 init: %cst_25) applies stablehlo.add across dimensions = [4] : (tensor<1x64x2x1x16xf32>, tensor<f32>) -> tensor<1x64x2x1xf32> loc(#loc464)
    %162 = stablehlo.broadcast_in_dim %161, dims = [0, 1, 2, 3] : (tensor<1x64x2x1xf32>) -> tensor<1x64x2x1x1xf32> loc(#loc456)
    %163 = stablehlo.broadcast_in_dim %162, dims = [0, 1, 2, 3, 4] : (tensor<1x64x2x1x1xf32>) -> tensor<1x64x2x1x16xf32> loc(#loc465)
    %164 = stablehlo.divide %160, %163 : tensor<1x64x2x1x16xf32> loc(#loc465)
    %165 = stablehlo.dot_general %122, %164, batching_dims = [0, 2] x [1, 2], contracting_dims = [1] x [4] : (tensor<64x16x2x16xf32>, tensor<1x64x2x1x16xf32>) -> tensor<64x2x16x1x1xf32> loc(#loc466)
    %166 = stablehlo.transpose %165, dims = [3, 0, 4, 1, 2] : (tensor<64x2x16x1x1xf32>) -> tensor<1x64x1x2x16xf32> loc(#loc467)
    %167 = stablehlo.transpose %166, dims = [1, 2, 3, 0, 4] : (tensor<1x64x1x2x16xf32>) -> tensor<64x1x2x1x16xf32> loc(#loc457)
    %168 = stablehlo.reshape %167 : (tensor<64x1x2x1x16xf32>) -> tensor<64x1x2x16xf32> loc(#loc452)
    %169 = call @_threefry_fold_in(%4, %c_3) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc579)
    %170 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc580)
    %171 = stablehlo.divide %170, %cst_20 : tensor<f32> loc(#loc581)
    %172 = call @_truncated_normal_20(%169, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x32xf32> loc(#loc582)
    %173 = stablehlo.broadcast_in_dim %171, dims = [] : (tensor<f32>) -> tensor<32x32xf32> loc(#loc583)
    %174 = stablehlo.multiply %172, %173 : tensor<32x32xf32> loc(#loc583)
    %175 = stablehlo.reshape %174 : (tensor<32x32xf32>) -> tensor<2x16x32xf32> loc(#loc584)
    %176 = call @_threefry_fold_in(%4, %c_2) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc585)
    %177 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc586)
    %178 = stablehlo.dot_general %168, %175, contracting_dims = [2, 3] x [0, 1] : (tensor<64x1x2x16xf32>, tensor<2x16x32xf32>) -> tensor<64x1x32xf32> loc(#loc539)
    %179 = stablehlo.reshape %177 : (tensor<32xf32>) -> tensor<1x1x32xf32> loc(#loc540)
    %180 = stablehlo.broadcast_in_dim %179, dims = [0, 1, 2] : (tensor<1x1x32xf32>) -> tensor<64x1x32xf32> loc(#loc541)
    %181 = stablehlo.add %178, %180 : tensor<64x1x32xf32> loc(#loc541)
    %182 = call @_threefry_fold_in(%4, %c_1) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc393)
    %183 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc350)
    %184 = stablehlo.divide %183, %cst_20 : tensor<f32> loc(#loc351)
    %185 = call @_truncated_normal_27(%182, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x16xf32> loc(#loc352)
    %186 = stablehlo.broadcast_in_dim %184, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc353)
    %187 = stablehlo.multiply %185, %186 : tensor<32x16xf32> loc(#loc353)
    %188 = stablehlo.dot_general %181, %187, contracting_dims = [2] x [0] : (tensor<64x1x32xf32>, tensor<32x16xf32>) -> tensor<64x1x16xf32> loc(#loc354)
    %189 = call @_where_32(%43, %188, %cst) : (tensor<64x1x16xi1>, tensor<64x1x16xf32>, tensor<f32>) -> tensor<64x1x16xf32> loc(#loc320)
    %190 = call @_threefry_fold_in(%4, %c_0) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc394)
    %191 = stablehlo.sqrt %cst_12 : tensor<f32> loc(#loc356)
    %192 = stablehlo.divide %191, %cst_20 : tensor<f32> loc(#loc357)
    %193 = call @_truncated_normal_33(%190, %c_19, %c_18) : (tensor<2xui32>, tensor<i32>, tensor<i32>) -> tensor<32x1xf32> loc(#loc358)
    %194 = stablehlo.broadcast_in_dim %192, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc359)
    %195 = stablehlo.multiply %193, %194 : tensor<32x1xf32> loc(#loc359)
    %196 = call @_threefry_fold_in(%4, %c) : (tensor<2xui32>, tensor<ui32>) -> tensor<2xui32> loc(#loc395)
    %197 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc361)
    %198 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc594)
    %199 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc594)
    %200 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc594)
    %201 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc594)
    %202 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc594)
    %203 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc594)
    %204 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc594)
    %205 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16xf32> loc(#loc594)
    %206 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x2x16xf32> loc(#loc594)
    %207 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc594)
    %208 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16x32xf32> loc(#loc594)
    %209 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16xf32> loc(#loc594)
    %210 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x2x16xf32> loc(#loc594)
    %211 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16xf32> loc(#loc594)
    %212 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x2x16xf32> loc(#loc594)
    %213 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x16xf32> loc(#loc595)
    %214 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<1xf32> loc(#loc595)
    %215 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x1xf32> loc(#loc595)
    %216 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc595)
    %217 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<15x32xf32> loc(#loc595)
    %218 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc595)
    %219 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<48x32xf32> loc(#loc595)
    %220 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16xf32> loc(#loc595)
    %221 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x2x16xf32> loc(#loc595)
    %222 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32xf32> loc(#loc595)
    %223 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16x32xf32> loc(#loc595)
    %224 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16xf32> loc(#loc595)
    %225 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x2x16xf32> loc(#loc595)
    %226 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<2x16xf32> loc(#loc595)
    %227 = stablehlo.broadcast_in_dim %cst_25, dims = [] : (tensor<f32>) -> tensor<32x2x16xf32> loc(#loc595)
    return %c_29, %31, %32, %33, %34, %35, %36, %37, %38, %39, %21, %27, %28, %29, %30, %40, %41, %42, %187, %197, %195, %56, %54, %71, %69, %100, %97, %177, %175, %86, %83, %116, %113, %c_29, %198, %199, %200, %201, %202, %203, %204, %205, %206, %207, %208, %209, %210, %211, %212, %213, %214, %215, %216, %217, %218, %219, %220, %221, %222, %223, %224, %225, %226, %227 : tensor<i32>, tensor<64x16xi1>, tensor<64x15xf32>, tensor<64xi32>, tensor<64xf32>, tensor<64xi1>, tensor<64xi1>, tensor<64xf32>, tensor<64xf32>, tensor<64xf32>, tensor<64x5xi32>, tensor<64x5xi32>, tensor<64xi1>, tensor<64xi32>, tensor<64xi1>, tensor<64x16xi32>, tensor<64x16x2x16xf32>, tensor<64x16x2x16xf32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<32xf32>, tensor<2x16x32xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<i32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<32xf32>, tensor<2x16x32xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<32x16xf32>, tensor<1xf32>, tensor<32x1xf32>, tensor<32xf32>, tensor<15x32xf32>, tensor<32xf32>, tensor<48x32xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<32xf32>, tensor<2x16x32xf32>, tensor<2x16xf32>, tensor<32x2x16xf32>, tensor<2x16xf32>, tensor<32x2x16xf32> loc(#loc240)
  } loc(#loc)
  func.func private @_threefry_split(%arg0: tensor<2xui32> loc(unknown)) -> tensor<3x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc231)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc231)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc232)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc233)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc232)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc233)
    %4 = stablehlo.iota dim = 0 : tensor<3xui64> loc(#loc231)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc231)
    %6 = stablehlo.multiply %5, %4 : tensor<3xui64> loc(#loc231)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<3xui64> loc(#loc231)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<3xui64> loc(#loc231)
    %9 = stablehlo.convert %6 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc231)
    %10 = stablehlo.convert %8 : (tensor<3xui64>) -> tensor<3xui32> loc(#loc231)
    %11:2 = call @threefry2x32(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<3xui32>, tensor<3xui32>) -> (tensor<3xui32>, tensor<3xui32>) loc(#loc136)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc234)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<3xui32>) -> tensor<3x1xui32> loc(#loc234)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<3x1xui32>, tensor<3x1xui32>) -> tensor<3x2xui32> loc(#loc234)
    return %14 : tensor<3x2xui32> loc(#loc)
  } loc(#loc250)
  func.func private @threefry2x32(%arg0: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg1: tensor<ui32> loc("RecurrentPPO.init"(#loc4)), %arg2: tensor<3xui32> loc("RecurrentPPO.init"(#loc4)), %arg3: tensor<3xui32> loc("RecurrentPPO.init"(#loc4))) -> (tensor<3xui32>, tensor<3xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc220)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc220)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc220)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc235)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc235)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc236)
    %3 = stablehlo.add %arg2, %2 : tensor<3xui32> loc(#loc236)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc236)
    %5 = stablehlo.add %arg3, %4 : tensor<3xui32> loc(#loc236)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc281)
      stablehlo.return %7 : tensor<i1> loc(#loc251)
    } do {
      %7:8 = func.call @closed_call(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc282)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc283)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc251)
    } loc(#loc251)
    return %6#2, %6#3 : tensor<3xui32>, tensor<3xui32> loc(#loc136)
  } loc(#loc136)
  func.func private @closed_call(%arg0: tensor<i32> loc(unknown), %arg1: tensor<3xui32> loc(unknown), %arg2: tensor<3xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc89)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc90)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc91)
    %3 = stablehlo.add %arg1, %arg2 : tensor<3xui32> loc(#loc89)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc92)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<3xui32> loc(#loc92)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc93)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<3xui32> loc(#loc94)
    %9 = stablehlo.or %5, %8 : tensor<3xui32> loc(#loc95)
    %10 = stablehlo.xor %3, %9 : tensor<3xui32> loc(#loc96)
    %11 = stablehlo.slice %arg6 [1:2] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc90)
    %12 = stablehlo.reshape %11 : (tensor<1xui32>) -> tensor<ui32> loc(#loc91)
    %13 = stablehlo.add %3, %10 : tensor<3xui32> loc(#loc89)
    %14 = stablehlo.broadcast_in_dim %12, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc92)
    %15 = stablehlo.shift_left %10, %14 : tensor<3xui32> loc(#loc92)
    %16 = stablehlo.subtract %c, %12 : tensor<ui32> loc(#loc93)
    %17 = stablehlo.broadcast_in_dim %16, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %18 = stablehlo.shift_right_logical %10, %17 : tensor<3xui32> loc(#loc94)
    %19 = stablehlo.or %15, %18 : tensor<3xui32> loc(#loc95)
    %20 = stablehlo.xor %13, %19 : tensor<3xui32> loc(#loc96)
    %21 = stablehlo.slice %arg6 [2:3] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc90)
    %22 = stablehlo.reshape %21 : (tensor<1xui32>) -> tensor<ui32> loc(#loc91)
    %23 = stablehlo.add %13, %20 : tensor<3xui32> loc(#loc89)
    %24 = stablehlo.broadcast_in_dim %22, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc92)
    %25 = stablehlo.shift_left %20, %24 : tensor<3xui32> loc(#loc92)
    %26 = stablehlo.subtract %c, %22 : tensor<ui32> loc(#loc93)
    %27 = stablehlo.broadcast_in_dim %26, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %28 = stablehlo.shift_right_logical %20, %27 : tensor<3xui32> loc(#loc94)
    %29 = stablehlo.or %25, %28 : tensor<3xui32> loc(#loc95)
    %30 = stablehlo.xor %23, %29 : tensor<3xui32> loc(#loc96)
    %31 = stablehlo.slice %arg6 [3:4] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc90)
    %32 = stablehlo.reshape %31 : (tensor<1xui32>) -> tensor<ui32> loc(#loc91)
    %33 = stablehlo.add %23, %30 : tensor<3xui32> loc(#loc89)
    %34 = stablehlo.broadcast_in_dim %32, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc92)
    %35 = stablehlo.shift_left %30, %34 : tensor<3xui32> loc(#loc92)
    %36 = stablehlo.subtract %c, %32 : tensor<ui32> loc(#loc93)
    %37 = stablehlo.broadcast_in_dim %36, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc94)
    %38 = stablehlo.shift_right_logical %30, %37 : tensor<3xui32> loc(#loc94)
    %39 = stablehlo.or %35, %38 : tensor<3xui32> loc(#loc95)
    %40 = stablehlo.xor %33, %39 : tensor<3xui32> loc(#loc96)
    %41 = stablehlo.broadcast_in_dim %arg3, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc89)
    %42 = stablehlo.add %33, %41 : tensor<3xui32> loc(#loc89)
    %43 = stablehlo.broadcast_in_dim %arg4, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc89)
    %44 = stablehlo.add %40, %43 : tensor<3xui32> loc(#loc89)
    %45 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc89)
    %46 = stablehlo.convert %45 : (tensor<i32>) -> tensor<ui32> loc(#loc97)
    %47 = stablehlo.broadcast_in_dim %46, dims = [] : (tensor<ui32>) -> tensor<3xui32> loc(#loc89)
    %48 = stablehlo.add %44, %47 : tensor<3xui32> loc(#loc89)
    return %0, %42, %48, %arg4, %arg5, %arg3, %arg7, %arg6 : tensor<i32>, tensor<3xui32>, tensor<3xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc)
  } loc(#loc253)
  func.func private @_threefry_split_0(%arg0: tensor<2xui32> loc(unknown)) -> tensor<64x2xui32> {
    %c = stablehlo.constant dense<32> : tensor<ui64> loc(#loc255)
    %c_0 = stablehlo.constant dense<1> : tensor<ui64> loc(#loc255)
    %0 = stablehlo.slice %arg0 [0:1] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc256)
    %1 = stablehlo.reshape %0 : (tensor<1xui32>) -> tensor<ui32> loc(#loc257)
    %2 = stablehlo.slice %arg0 [1:2] : (tensor<2xui32>) -> tensor<1xui32> loc(#loc256)
    %3 = stablehlo.reshape %2 : (tensor<1xui32>) -> tensor<ui32> loc(#loc257)
    %4 = stablehlo.iota dim = 0 : tensor<64xui64> loc(#loc255)
    %5 = stablehlo.broadcast_in_dim %c_0, dims = [] : (tensor<ui64>) -> tensor<64xui64> loc(#loc255)
    %6 = stablehlo.multiply %5, %4 : tensor<64xui64> loc(#loc255)
    %7 = stablehlo.broadcast_in_dim %c, dims = [] : (tensor<ui64>) -> tensor<64xui64> loc(#loc255)
    %8 = stablehlo.shift_right_logical %6, %7 : tensor<64xui64> loc(#loc255)
    %9 = stablehlo.convert %6 : (tensor<64xui64>) -> tensor<64xui32> loc(#loc255)
    %10 = stablehlo.convert %8 : (tensor<64xui64>) -> tensor<64xui32> loc(#loc255)
    %11:2 = call @threefry2x32_1(%1, %3, %10, %9) : (tensor<ui32>, tensor<ui32>, tensor<64xui32>, tensor<64xui32>) -> (tensor<64xui32>, tensor<64xui32>) loc(#loc239)
    %12 = stablehlo.broadcast_in_dim %11#0, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc258)
    %13 = stablehlo.broadcast_in_dim %11#1, dims = [0] : (tensor<64xui32>) -> tensor<64x1xui32> loc(#loc258)
    %14 = stablehlo.concatenate %12, %13, dim = 1 : (tensor<64x1xui32>, tensor<64x1xui32>) -> tensor<64x2xui32> loc(#loc258)
    return %14 : tensor<64x2xui32> loc(#loc)
  } loc(#loc284)
  func.func private @threefry2x32_1(%arg0: tensor<ui32> loc(callsite(#loc221 at #loc222)), %arg1: tensor<ui32> loc(callsite(#loc221 at #loc222)), %arg2: tensor<64xui32> loc(callsite(#loc221 at #loc222)), %arg3: tensor<64xui32> loc(callsite(#loc221 at #loc222))) -> (tensor<64xui32>, tensor<64xui32>) {
    %c = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %c_0 = stablehlo.constant dense<5> : tensor<i32> loc(#loc)
    %c_1 = stablehlo.constant dense<0> : tensor<i32> loc(#loc)
    %c_2 = stablehlo.constant dense<466688986> : tensor<ui32> loc(#loc220)
    %c_3 = stablehlo.constant dense<[13, 15, 26, 6]> : tensor<4xui32> loc(#loc220)
    %c_4 = stablehlo.constant dense<[17, 29, 16, 24]> : tensor<4xui32> loc(#loc220)
    %0 = stablehlo.xor %arg0, %arg1 : tensor<ui32> loc(#loc259)
    %1 = stablehlo.xor %0, %c_2 : tensor<ui32> loc(#loc259)
    %2 = stablehlo.broadcast_in_dim %arg0, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc260)
    %3 = stablehlo.add %arg2, %2 : tensor<64xui32> loc(#loc260)
    %4 = stablehlo.broadcast_in_dim %arg1, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc260)
    %5 = stablehlo.add %arg3, %4 : tensor<64xui32> loc(#loc260)
    %6:9 = stablehlo.while(%iterArg = %c_1, %iterArg_5 = %c_1, %iterArg_6 = %3, %iterArg_7 = %5, %iterArg_8 = %arg1, %iterArg_9 = %1, %iterArg_10 = %arg0, %iterArg_11 = %c_3, %iterArg_12 = %c_4) : tensor<i32>, tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>
    cond {
      %7 = stablehlo.compare LT, %iterArg, %c_0, SIGNED : (tensor<i32>, tensor<i32>) -> tensor<i1> loc(#loc324)
      stablehlo.return %7 : tensor<i1> loc(#loc285)
    } do {
      %7:8 = func.call @closed_call_2(%iterArg_5, %iterArg_6, %iterArg_7, %iterArg_8, %iterArg_9, %iterArg_10, %iterArg_11, %iterArg_12) : (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) -> (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) loc(#loc325)
      %8 = stablehlo.add %iterArg, %c : tensor<i32> loc(#loc326)
      stablehlo.return %8, %7#0, %7#1, %7#2, %7#3, %7#4, %7#5, %7#6, %7#7 : tensor<i32>, tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32> loc(#loc285)
    } loc(#loc285)
    return %6#2, %6#3 : tensor<64xui32>, tensor<64xui32> loc(#loc239)
  } loc(#loc239)
  func.func private @closed_call_2(%arg0: tensor<i32> loc(unknown), %arg1: tensor<64xui32> loc(unknown), %arg2: tensor<64xui32> loc(unknown), %arg3: tensor<ui32> loc(unknown), %arg4: tensor<ui32> loc(unknown), %arg5: tensor<ui32> loc(unknown), %arg6: tensor<4xui32> loc(unknown), %arg7: tensor<4xui32> loc(unknown)) -> (tensor<i32>, tensor<64xui32>, tensor<64xui32>, tensor<ui32>, tensor<ui32>, tensor<ui32>, tensor<4xui32>, tensor<4xui32>) {
    %c = stablehlo.constant dense<32> : tensor<ui32> loc(#loc)
    %c_0 = stablehlo.constant dense<1> : tensor<i32> loc(#loc)
    %0 = stablehlo.add %arg0, %c_0 : tensor<i32> loc(#loc89)
    %1 = stablehlo.slice %arg6 [0:1] : (tensor<4xui32>) -> tensor<1xui32> loc(#loc90)
    %2 = stablehlo.reshape %1 : (tensor<1xui32>) -> tensor<ui32> loc(#loc91)
    %3 = stablehlo.add %arg1, %arg2 : tensor<64xui32> loc(#loc89)
    %4 = stablehlo.broadcast_in_dim %2, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc92)
    %5 = stablehlo.shift_left %arg2, %4 : tensor<64xui32> loc(#loc92)
    %6 = stablehlo.subtract %c, %2 : tensor<ui32> loc(#loc93)
    %7 = stablehlo.broadcast_in_dim %6, dims = [] : (tensor<ui32>) -> tensor<64xui32> loc(#loc94)
    %8 = stablehlo.shift_right_logical %arg2, %7 : tensor<64xui32> loc(#loc94)
    %9 = stablehlo.or %5, %8 : tensor<64xui32> loc(#loc95)
    %10 = stablehlo.xor %3, %9 : tensor<64xui32> loc(#loc96)
